{
    "id": "resume_c8f55e77-c59e-48da-af1a-da7361f116b0",
    "metadata": {
        "filename": "Abiral_Pandey_Fullstack_Java.docx",
        "processed_date": "2025-09-24T08:45:37.799050+00:00"
    },
    "raw_text": "Name: Abiral Pandey\nEmail: abiral.pandey88@gmail.com\nPhone: 940-242-3303\nCurrent Location: Woonsocket, Rhode Island\nVisa Status: US Citizen\n\nSUMMARY:\nDynamic individual with 6 years of software development experience in design, development, deployment, maintenance, production and support of web - based and Client-Server business applications using OOP and Java/J2EE technologies.\nExposure to all phases of Software Development Life Cycle(SDLC) using Agile, RUP, Waterfall.\nDesigned and developed web UI screen using Angular-JS.\nDeveloped AngularJS Controllers, Services, filters and directives for various modules in the application.\nKnowledge on ETL tools like Kettle Pentaho and Microsoft SSIS tools.\nCreated custom directives, decorators and services using AngularJS to interface with both RESTful and legacy network services also DOM applications.\nExperience with MVC frameworks like Struts, SPRING and ORM tools like Hibernate.\nExperienced in working with batch jobs using Spring-Batch, Autosys and Quartz.\nWorked extensively with XML related technologies like XML/XSLT to process, validate, parse and extract data from XML using DOM and SAX parsers for DTD and SCHEMAand also worked with JAX-B.\nStrong experience in J2EE technologies like Java Beans, Servlets, JSP (including custom tags), JSTL, JDBC, Struts, Spring, JMS, JNDI and Multithreading.\nExpertise in web development technologies like HTML, DHTML, XHTML, CSS, Java Script, JQuery, JSF, AJAX, Bootstrap JS, Node JS and Angular JS.\nExperienced in RESTful web services using JAX-RS, Jersey framework and SOAP using JAX-WS, Axis-2 framework.\nExpert knowledge over J2EE Design Patterns like MVC, Adapter, Front End Controller, Value object, Singleton, Session Facade, Business Delegate, Factory DAO in designing the architecture of large applications.\nExperience in using Maven and Ant build scripts for the project build automation.\nExperience in using version control and configuration management tools like SVN, Clear Case and CVS.\nExpertise in working with various Application Servers such as IBM WebSphere, JBoss, Glassfish, Oracle WebLogic and Apache Tomcat server.\nGood knowledge in using IDE’s such as Eclipse, NetBeans, JBuilder, RAD and STS.\nExpertise in working with Relational databases such as Oracle, PostgreSQL, DB2, MySQL and NoSQL database MongoDB.\nExperience in database design using PL/SQL to write Stored Procedures, Functions, Triggers, views and good at writing complex queries for Oracle 10g/11g.\nGood experience in developing test cases with JUnit for Unit testing, Load testing and logging using Log4J.\nExperienced in using Operating Systems like Windows 98 / 2000 / NT / XP, AIX, Sun Solaris.\nProficient in software documentation and technical report writing.\nInvolved in Performance analysis and improvements of the application using tools like Jmeter and using commands on Unix box to resolve deadlocks and improve performance.\n\nTECHNICAL SKILLS:\nProgramming Languages: Java/J2EE, PL/SQL, Unix Shell Scripts\nJava/J2EE Technologies: JavaBeans, collections, Servlets, JSP, JDBC, JNDI, RMI, EJB\nFrameworks: Struts 1.x/2.x, Spring 2.5/3.0, Web Framework, JSF, Hibernate, iBatis, JPA, Axis-2, Jersey\nMethodologies/Design Patterns: OOAD, OOP, UML, MVC, Singleton, DTO Pattern, DAO Pattern, Service Fa ade, Factory Pattern\nBuild Automation: Jenkins, Maven, Ant\nApplication/Web Servers: IBM Web Sphere 6.x/5.x, BEA Web Logic 8.1/9.1, Apache Tomcat 5.x/6.x, JBOSS 4.x/3.x\nXML processing: DTD, Schema, JAX-P (DOM, SAX), JAX-B\nWeb Services: RESTful, SOAP\nWeb Development: HTML, DHTML, XHTML, CSS, Java Script, JQuery, AJAX, LADP, JSF, Bootstrap JS, Node JS, Angular JS\nVersion Control Tools: CVS, Harvest, IBM Clear case, SVN and GIT\nDatabases: Oracle 9i/10g/11g, IBM DB2, SQL Server 2005/2008, PostgreSQL, MySQL, MangoDB\nMessaging Techologies: JMS, IBM MQ\nIDE s: Eclipse, NetBeans, RAD, WSAD\nTesting and Logging Frameworks: Junit, Log4j, Mockito, Finesse Tests\nReporting Tools: Crystal Reports 11, Jasper Reports\nTools: Rational Rose, MS Visio, XML Spy, TOAD\nOperating Systems: Windows 98/2000/NT/XP, AIX, Sun Solaris, HP-UX\nPROFESSIONAL EXPERIENCE:\n\nCVS, Woonsocket, Rhode Island                                 Full Stack Java Developer\nApril 2016 – Present\nResponsibilities:\nInvolved in various stages of Software Development Life Cycle (SDLC) deliverables of the project using the Agile methodology.\nUsed AWS Cloud platform and its features which include EBS, AMI, SNS, RDS, EBS, Cloud Watch, Cloud Trail, Cloud Formation, Cloud Front, S3, and Route53. \nExpertise in building rich, interactive user interfaces using HTML, CSS, JavaScript, jQuery, Node.Js and Angular.Js.\nGathered and clarified requirements with business analyst to feed into high-level customization design, development and installation phases.\nUsed Spring Framework for dependency injection for Action classes using Application Context XML file. \nInvolved in implementation of MVC pattern using JSP and Spring Controller.\nDeveloped business objects using Spring IOC, Spring MVC and Spring AOP. Implemented MVC architecture using JSP Spring, Hibernate and used Spring Framework to initialize managed beans and services.\nImplemented SOA architecture with Web Services using SOAP, JAX-WS, WSDL, UDDI and XML.\nUsed Collections for Model classes in the DAO layer (Data Access Object) Involved in modifying some changes in DAO layer using Hibernate.\nCreated mappings among the relations and written SQL queries using Hibernate.\nImplemented Concurrency, Exception Handling and Collections whenever necessary.\nUsed Entity Beans to persist the data into IBM DB2 database like database access components, Creating Schemas and Tables.\nUsed SQL to perform data mapping and backend testing, also documented all the SQL queries for future testing purpose.\nCreated process flow for deploying application in Web Sphere application server.\nManaged build, reporting and documentation from the project information using Jenkins, Maven Tool and SVN for version control.\nUsed Jenkins for Continuous Integration.\nUsed JUnit for testing and used JIRA for tracking bugs.\nResponsible for the dealing with the problem, bug fixing and troubleshooting.\n Environment: Java, J2EE, HTML, CSS, JavaScript, jQuery, Ajax, Spring, Spring IOC, Spring AOP, Spring MVC, Hibernate, REST, SOAP, XML, Eclipse, PL/SQL, JUnit, Maven Build Tool, DB2, JIRA, Jenkins, SVN and IBM Web Sphere, AngularJS, EBS, AMI, SNS, RDS, Cloud Watch, Cloud Trail, Cloud Formation, Auto scaling\n\nToll Brothers, Horsham Township, Pennsylvania                  Software Engineer\nDecember 2015 -  March 2016\nResponsibilities:\nDeveloped JSP and extensively used tag libraries. \nDesigned the system with OOAD methodology using various design patterns like factory method, Singleton, Adaptor, Template etc. \nImplementing and planning the server-side architecture using Spring and Hibernate \nConfigured the spring framework for entire business logic layer with XML bean configuration files. \nPreparation of Low Level Designing and High Level Designing and relevant documentation. \nExtensively used Spring IOC for Dependency Injection and worked on Custom MVC Frameworks loosely based on Struts \nexperienced in build tools like Micro services, Ant, Maven and Gradle tools.\nWrote Controller classes in Spring MVC framework in the web layer. \nProduced the shopping cart on the client Front-end using jQuery, JavaScript, HTML5, CSS3. \nExtensively used Eclipse based STS IDE for building, developing and integrating the application. \nUsed Table per hierarchy inheritance of hibernates and mapped polymorphic associations. \nDeveloped one-much, many-one, one-one annotation based mappings in Hibernate. \nWrote queries Using Cassandra CQL to create, alter, insert and delete elements. \nDeveloped DAO service methods to populate the domain model objects using hibernate. \nUsed java collections API extensively such as Lists, Sets and Maps.  \nWrote DAO classes using spring and Hibernate to interact with database for persistence. \nDeveloped components of web services (JAX-WS, JAX-RPC) end to end, using different JAX-WS standards with clear understanding on WSDL, SOAP using various message patterns  \nPerformed on e-Commerce by using JSF framework and JavaScript, jQuery, HTML5 pages\nWrote and tested Java Beans to retrieve trading data and subscriber's information from MySQL database server,\n Extensive experience in Angular.JS for application implementation, proficient in creating modules, controllers, route-Providers, factory services, ng-repeat, customizable filter, http get/post methods and directives to realize functionalities like REST service with Ajax call , input validations, searchable and sortable contents.  \nImplemented Unit and Integration test cases with JUnit Framework based on Functional Flow. \nUsed tools like My Eclipse IDE, configured and deployed the applications onto Web Logic application server \nConfigured Log4j for logging and debugging \n Environment: Eclipse, Java J2EE, HTML, JSP, JAX RPC, JAXB, CSS3, JavaScript, and jQuery, Spring MVC, Hibernate, RESTful web services, Apache Tomcat7.0, Cucumber, Cassandra, Junit, Jenkins, Maven, GitHub, XML, Log4j, EJB, MySQL, Ajax.\n\nDairy Farmers of America, Kansas City, Missouri                      Java Developer\nNovember 2014 – December 2015\nResponsibilities:\nResponsible for developing use cases, class and sequence diagram for the modules using UML and Rational Rose.\nIdentifying and design of common interfaces across multiple systems or modules of social insurance.\nDeveloped the application using Spring Framework that leverages classical Model View Layer (MVC) architecture. UML diagrams like use cases, class diagrams, interaction diagrams (sequence and collaboration) and activity diagrams were used.\nDeveloped J2EE modules using XMI and CORE JAVA.\nInteraction with Business users for user and system acceptance testing.\nValidated the data against the business rules.\nData access layer is implemented using Hibernate.\nUsed Apache POI to generate Excel documents\nImplemented Struts action classes.\nUsed Spring Security for Authentication and authorization extensively.\nUtilized Eclipse to create JSPs/Servlets/Hibernate that pulled information from a Oracle database and sent to a front end GUI for end users.\nUsed JDBC for Oracle database connection and written number of stored procedures for retrieving the data.\nDeveloped modules for validating the data according to business rules and used Castor to convert data into array of XML strings and XSLT for transformation.\nUsed Hibernate for data persistence.\nDeveloped SOAP based HTTP requests for communicating with Web Services.\nWas involved in the design of multi-tier architecture using EJB, Servlets and JSP.\nUsed Spring Dependency Injection properties to provide loose-coupling between layers.\nCollaborated with Web designers to create the JSP pages, applying HTML, JavaScript, JQuery and Struts Tags.\nExtensively worked on debugging using Logging Frameworks such as Apache Log4j.\nCreated test plans for unit testing to validate component functionality.\nEnvironment: Java 1.4.2, J2EE, Servlets, MVC, Web services, Struts, Spring - Core, MVC, Security, Eclipse, Hibernate, XML, XSLT, EJB, JSP, JDBC, JAX-B, JQuery, JavaScript, HTML, Log4j, Oracle 10g, Apache POI, Caster, XMI.\n\nBank of Utah, Ogden, Utah                                                           J2EE Developer\nMay 2013 – October 2014\n\nResponsibilities:\nDesigned and developed Servlets and JSP, which presents the end user with form to submit the details of the problem.\nCreated SQL statements and triggers for the effective retrieval and storage of data from the database.\nPerformed JUnit testing, proposed and implemented performance enhancements, worked with Oracle databases, running SQL scripts and stored procedures.\nDeveloped Restful based Web Services.\nWas involved in the design of multi-tier architecture using EJB, Servlets and JSP.\nDeveloped Servlets used to store user information in the database, which makes a JDBC-ODBC connection to the database and inserts the details into to the database.\nDesigned and developed a Servlet, which presents the engineer a form to submit solution to particular problem.\nSetting up test environments and configuring various components of the application using JDBC API to establish a connection with oracle database and configuring.\nDesigned and developed a Servlet, which allows the end user to query on the problem, makes a JDBC-ODBC connection to the database and retrieve the details regarding the call number and the status of the submitted problem.\nEnvironment: Java, J2EE, Servlets, JSP, EJB, Custom tags, JDBC, JUNIT, Restful, Data Source, DAO, VO Patterns, Tomcat 5.0, SQL, Oracle 9i, Linux.\n\n\nEpsilon, Irving, Texas                                                         Junior Java Developer\nJanuary 2012 – April 2013\nResponsibilities:\nDesigned the user interfaces using JSP.\nDeveloped Custom tags, JSTL to support custom User Interfaces.\nDeveloped the application using Struts (MVC) Framework.\nImplemented Business processes such as user authentication, Account Transfer using Session EJBs.\nUsed Eclipse to writing the code for JSP, Servlets, Struts and EJBs.\nDeployed the applications on Web Logic Application Server.\nUsed Java Messaging Services (JMS) and Backend messaging for reliable and asynchronous exchange of important information such as payment status report.\nDeveloped the Ant scripts for preparing WAR files used to deploy J2EE components.\nUsed JDBC for database connectivity to Oracle.\nWorked with Oracle Database to create tables, procedures, functions and select statements.\nUsed JUnit Testing, debugging and bug fixing.\nUsed Log4J to capture the log that includes runtime exceptions and developed WAR framework to alert the client and production support in case of application failures.\nWorked in Rational Unified Process (RUP) Methodology.\nEnvironment: Java, J2EE, JSP, JSTL, JDBC, Struts, EJB, JMS, Oracle, HTML, XML, Web Logic, Ant, CVS, Log4J, JUnit, JMS, PL/SQL, JavaScript, Eclipse IDE, UNIX Shell Scripting, Rational Unified Process (RUP).\nEducation: \nBachelor of Computer Science – University of North Texas, Denton, Texas\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "collaboration",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "postgresql",
        "rds",
        "s3",
        "sql"
    ]
}