{
    "id": "resume_b3cb003c-c903-4408-9f97-d6220844c4da",
    "metadata": {
        "filename": "Adelina_Erimia_PMP1.docx",
        "processed_date": "2025-09-24T08:45:37.938117+00:00"
    },
    "raw_text": "Adelina Erimia, PMP, Six Sigma Green Belt, SMC\n469-331-7851   erimia@msn.com\n\n\nPROJECT MANAGER\n\nExperienced project manager offering over 10 years of successful leading diverse projects in the IT, Construction and Insurance industries; PMP, Six Sigma Green Belt and Scrum Master certified.  Member of PMI Savannah Chapter Board of Directors.\nBusiness strategist; plan and manage projects aligning business goals with technology solutions to drive process improvements, competitive advantage and bottom-line gains.\nExcellent communicator; leverage business and financial acumen to communicate effectively with client executives and their respective teams.\nExpert in project management methodologies. Able to manage large project teams and known for high-quality deliverables that meet or exceed timeline and budgetary targets.\n\nCareer Progression\n\nProject Management Institute (PMI), Savannah Chapter\tSavannah, GA\t\t12/2016 – Present\nProject Manager/VP of Volunteers\n▪ Chairing the planning committee for the “2018 Meet me in Savannah Leadership Conference”.\n▪ Defining conference goals, objectives and target audience.\n▪ Recruiting conference committee/assigning preliminary roles and responsibilities.\n▪ Developing initial budget for each component and pricing model for delegate fees.\n▪ Communicating/releasing final conference agenda and executing/monitoring sponsorship deliverables.\n▪ Developing marketing plan and objectives and identifying logistics needs.\n\nATN international\t\t\t\tRincon, GA\t\t\t\t04/2016 – 11/2016\nIT Project Manager/Billing Support Manager\n▪ Managed the Billing Support Team for One Communications – cellular, internet and cable service provider in Bermuda with 4 direct reports.\n▪ Led large packaged application implementation project for the billing system. \n▪ Introduced, trained and mentored the local office in Project Management methodology and tools.\n▪ Executed process improvements, software upgrades, re-branding and integration projects.\n▪ Performed QA and UAT testing.\n▪ Ensured that Billing Support Team members are maintaining the availability, integrity and accuracy of One Communications systems.  \n▪ Monitored internal tracking systems to ensure that customer issues are getting resolved in the appropriate time frames. \n\nHCL America (Gulfstream Aerospace)\t\tSavannah, GA\t\t\t\t8/2012 – 12/2015\nIT Project Manager \n▪ Planned, executed and finalized infrastructure IT projects per strict deadlines and within budget.\n▪ Worked with project sponsor and stakeholders to understand and document scope, goals, deliverables, resources and timelines, to ensure projects deliver on time, scope, budget, quality and within expectations and strategic vision.\n▪ Tracked and reported on project milestones and provided status reports to sponsor and management.\n▪ Developed tools and best practices for project management, project execution and project transition and continuity.\n▪ Managed project team and third-party contractors, identified, assessed and minimized project risks until successful project completion.\n▪ Vendor management – selected vendors trough RFP projects, keeping track of bids, vendor performance, previous contract terms and alternative providers.\n▪Coordinate project management requirements with Legal, EHS, Real Estate and Facilities for IT infrastructure internal and international group moves and new office set-ups. \n•Led SCADA software implementation project at various Gulfstream water pump locations.\n•Directed in collaboration with Verizon Wireless a major improvement project (3 million dollars budget) that involved installing fiber optic cables, replacing antennas, connecting to network, reviewing contracts, keeping track and selecting subcontractors and third-party vendors.\n•Drove various projects such as: voice command implementation, major hardware replacement (over 1,200 computers), security camera replacement and security software implementation, throughout all Gulfstream locations in the US.\n\nCraiovan Consulting SRL\t\t\tTimisoara, Romania\t\t\t6/2009 – 5/2011\nProject Manager Consultant\n▪ Managed international relocation, construction and remodel projects.\n▪ Provided support with the preparation of design, development and construction of new and major renovation projects.\n▪ Interacted with governmental agencies, utilities and sub-contractors to implement the company’s real estate requirements.\n▪ Performed punch list completion, financial close-out and transfer of property to customer.\n▪ Defined and implemented project standards and processes for all the projects.\n▪ Tracked projected versus actual project performance and informed management of accomplishments and major problem areas as well as budget and schedule status.\n▪ Conducted post implementation project reviews to evaluate sustaining support and document lessons learned. \n▪ Led cross-functional and virtual teams and meetings.\n\nUnitedHealth Group\t\t\t\tHartford, CT\t\t\t\t8/2002 - 5/2008\nProject Coordinator\n▪ Acted as a Green Belt on Six Sigma Projects involving the improvement of pharmacy submissions.\n▪ Coordinated and tracked status of multiple projects for the IT Coding Department.\n▪ Traced and resolved escalated ID card issues for the Key Accounts Department.\n▪ Achieved savings of over $800,000 on an Operational Excellence Six Sigma Project.\n▪ Collected, tracked, analyzed and reported data.  \n▪ Generated, analyzed and run complex reports on a daily and weekly basis as well as ad hoc reports.\n▪ Researched and analyzed various projects.\n▪ Hired, trained and supervised the temporary staff.\n\n\nEducation & Credentials\n\nUniversitatea de Vest, Romania - BA - Business and Management \nPMI-Certified Project Management Professional (PMP)\nSix Sigma Green Belt\nThe George Washington University School of Business - Project Management\t\nLiceul Industrial,Romania - Mechanics.\n\nSKILLS\n▪ Proficient with MS Project, PPM, Smartsheet, Microsoft Word, Excel, PowerPoint, Outlook, Visio, SharePoint, Remedy and Service Now. \n▪ Skilled in Waterfall and Agile/Scrum methodologies as well as ITIL.\n▪ Versed in Incident, Change and Problem Management.\n\n469-331-7851  erimia@msn.com\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "leadership",
        "project management",
        "scrum"
    ]
}