{
    "id": "resume_49b11c42-f995-4682-b574-2137c9a341a5",
    "metadata": {
        "filename": "Anudeep N_Sr Java Developer.docx",
        "processed_date": "2025-09-24T08:45:39.060794+00:00"
    },
    "raw_text": "Anudeep\nSr Java Programmer\nanudeepreddynallamada@gmail.com\n\n\nProfessional Summary:\nIT professional with 8+ years of IT experience in designing and developing N-tier applications based on OOPS (Object Oriented Programming), Internet and Intranet, Client-Server Architecture using Java/J2EE and supporting technologies.\n Strong Experience in developing user interfaces with HTML, DHTML, XML and CSS. \nExperienced in processing, validating, parsing and extracting data from .xml file. \n Worked with scripting languages like JavaScript, JQuery. \n Well versed in MVC (Model View Controller) architecture using Spring, JSF and implementing JSTL (JSP Standard Tag Library), custom tag development and tiles. \n Experience in JSP, Java Beans and Servlets for developing applications using MVC architecture. \n Good exposure in implementing web services-WSDL using SOAP protocol. \n Experienced in Persistence Framework like Hibernate ORM (Object Relational Mapping) in a typical n-tier architecture. \nExperienced in build tools like ANT and Maven. \nExperienced in using testing Frameworks like JUnit and JMockit. \nExperienced in using logging tools like Intellij and Log4j. \nHands on experience on Web/Application servers such as Apache Tomcat, JBoss, WebLogic and Web Sphere. \nExperienced in developing various UML designs like class diagrams, cases and sequence diagrams using Rational Rose. \nWorked on different platforms like Windows 2003 Server, Windows 2000 Professional, Windows XP, Windows […] UNIX and LINUX. \nExperience in using UML like Rational Rose and MS Visio \nWell versed in using version control tools like SVN, Clear Case and CVS. \nStrong experience in using IDEs like Eclipse, NetBeans and RAD\nDeveloped projects and products using Agile Methodology, SDLC (Software development life cycle), from initiation, planning, designing, execution, implementation and Maintenance.\nEducation:\nBachelor of Engineering in Computer Science and Engineering        JNTU, Hyderabad, India.     2009\nTechnical Skills:\n\n\nPROFESSIONAL EXPERIENCE:\n\nWind Stream Communication, Dallas, TX                                                                SEP-2016 -TILL DATE\nRole: Sr Java Programmer\nResponsibilities:\n• Involved in the application development using Java platform. Model View Control (MVC) structure implementation. \n• Responsible for providing the client-side JavaScript validations and usage of HTML, JavaScript, XML, JSP, CSS as per the requirements to enhance the Portal UI. \n• Used Spring Core for Dependency Injection. \n• Mapping of ORM objects to tables using the Hibernate as the persistence framework. \n• Involved in different service classes, used across the framework. \n• Implementation of Web Services using Axis for the integration of different systems \n• Developed applications using J2EE technologies like Spring Boot, Spring MVC on the business layer and the persistent layer using Hibernate as ORM tool. \n• Testing of Web Services using the Postman. \n• Used HTML, CSS, Spring MVC, JSP, and jQuery, JavaScript, Angular.js in the development and the designing the     UI. \n• Gradient effects through the development of the CSS style sheets. Developed navigation, icons and layouts. \n• Code review and configuration build management for the application using Maven. \n• Implementation of business logic, validation Frame Work using Spring Web flow and Spring MVC. \n• Implemented Web tier of the application through the usage of Spring MVC framework. \n• Implementation of clean separation of layers through the usage of different design patterns like Factory pattern, Singleton and DAO pattern. \n• Serialization in the flattening of the objects. \n• Used core java concepts like Collections while developing server-side services. \n• Data storage using DB2 and used PL/SQL for queries. \n• Worked with IBM Web Sphere Application Server Developer Tools for Eclipse by using lightweight set of tools to assemble, develop and deploy Java EE, Web 2.0, and mobile applications. \n• Involved with GUI using JSP, Java Script and HTML. \n• Involved in using continuous integration tool (CI/CD) Jenkins. Created builds using Maven and pulled the project code from GitHub repositories. \n• Experience with Garbage collection and multithreading. \n• Experience with Concurrency, Exception Handling, File handling\nEnvironment: HTML, CSS, XML, SOAP, Hibernate, Java,J2EE,Java Script,MySQL DB, Spring Boot, PL/SQL, Log4j, JQuery, Angular JS, Eclipse, IBM Web Sphere Application server.\n \nIBM DALLAS,TEXASSEP 2015–AUG 2016\nRole: Sr Java Programmer\nResponsibilities:\nInvolved in SDLC Requirements gathering, Analysis, Design, Development and Testing of application using AGILE methodology (SCRUM).\nDesigned APIs and analytics using IBM Cloud. Built mobile backend services, powerful app management, and insights into app usage using IBM mobile first.\nDesigned DOM based interactive to reprogram selected links and adopted WCAG 2.0 standards for HTML and XHTML and W3C standards for CSS as well.\nHave achieved proficiency in Unit Test, Mock, Test Driven Development etc.\nImplemented client-side Interface using React JS. Worked on Redux.\nDesign, develop and test HTML, CSS, jQuery and React.JS that meets accessibility and web browser standards for car dealerships websites. \nInstalled, configured and Administered WebSphere Commerce Server 6.0 on Windows and Linux platform.\nInvolved in Stopping/Starting & Monitoring the logs for Application Server Instances.\nImplemented Horizontal and Vertical Clustering, Performance tuning and troubleshooting of IBM WebSphere Application Server 6.0/6.1.\nInstalled EARs, WARs and configured application specific JVM settings, Web container parameters using the Admin Console and WSCP/WSadmin scripts.\nMigrated existing applications from WebSphere V6.0 to V7.0.\nInvolved in issues like Application not responding. Application Deployment Errors, Wrong Database host name, Server Hung due to out of memory or thread hanging, Owner ship issue.\nCreated sites to organize client contracts and to summarize monthly financial data using React.js, Ember.js, D3.js and MySql.\nCreated web services and desktop applications to access and display data needed by support teams using, Ajax, JavaScript, jQuery, React.js, Angular.js, Node.js, Java, CSS and HTML.\nBuilt data visualizations to monitor file server load, Web server speed, Data Processing using D3.js, jQuery and MySql.\nPrepared exhaustive test cases to comprehensively test functionality and code.\nCreating Java code and modifying the existing code to match with the front JavaScript files.\nCreated an on -the-fly configuration changes set up, with application saved in Node.js.\n\nEnvironment: Java, JSP, Spring (MVC and Core), JSON, Servlets, Webservices(RESTful), Web Logic Application server, WebSphere Application Server 6.0/6.1/7.0, Websphere Portal Server 6.0/6.1, Websphere Commerce Server 6.0, Apache 2.0.47, IHS 6.0/6.1\n\nACADEMIC BANK KANSAS CITY,MO                                              AUG 2014 – AUG 2015\nRole: Java Programmer\nResponsibilities:\nJSF Portal Framework at Presentation Tier and Faces Servlet acts as the Front Controller.\nActively participated and mentoring in requirements gathering, analysis, design, and development and testing phases.\nWorked one-on-one with client to develop layout, color scheme for his website and implemented it into a final interface design with the HTML5/CSS3 & JavaScript using Dreamweaver. \nDeveloped CSS3 style sheets to give gradient effects. Developed page layouts, navigation and icons. Applied industry best practices and standards when project requirements were lagging.\nCreated Images, Logos and Icons that are used across the web pages using Adobe Flash and Photoshop.\nDesigned Frontend with in object oriented JavaScript framework like Angular.JS, Node.js and Ext.JS.\nUsed EXTJS for building rich internet applications, backbone JS & Require JS to optimize in-browser use and to load the module and to improve the Speed.\nWorking on all the latest technologies like HTML5, CSS3, etc. Tackled various issues related browser compatibility to accommodate these advanced and fast technologies\nTroubleshoot Admin Server start-up issues, Java code defects after deployment, and class path issues by checking the JVM logs, plug-in logs and the Webserver logs\nWorked closely with developers to define and configured application Servers, Virtual Hosts, Web Applications, Web resources, Servlets, JDBC drivers and Servlet Engines-as well as deployment of EJBs across multiple instances of WebSphere.\nMaintained security, tuning and clustering on Web Sphere Application Server using IBM Web seal Tivoli Access Manager.\nMonitored the logs for Application Server Instances.\nUpdated application code from JDK 1.3 to 1.4 using WSAD, RAD and redeployed in a clustered environment.\nDesign and develop solutions using C, C++, Multi-Threaded, Shell Scripting.\nDebugged the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions using Firefox and IE Developer Tool bar for IE. \nUsed JavaScript and XML to update a portion of a web page thus reducing bandwidth usage and load time and add modal dialog in web pages to get user input and requests.\nUsed Soap over Http and Soap over JMS for communication between components.\nWorked with the team of architects and back-end Developers to gather requirements and enhance the application functionality and add new features. \nEnvironment:HTML5, CSS3, JavaScript, jQuery, DOM, DML, DHTML, EXT JS, Angular.js, Node.js, Backbone.js, Require.js, Adobe Flash, Photoshop, Dreamweaver, XML, Apache, SOAP, Internet Explorer, Firefox, Chrome, Oracle, Windows, C, C++, Agile Methodology.\nVALUE LABS, HYDERABAD, INDIA                                                                                      JUNE 2012 – JULY2014\nRole: Java Programmer\n\n\nResponsibilities:\nUtilized the base UML methodologies and Use cases modeled by architects to develop the front-end interface. The class, sequence and state diagrams were developed using Microsoft Visio.\nCreated User Interface (UI) to gather data and communicate with Business Layer by using Swing, HTML, JSP, JSP Tags Lib, JSTL and Java Script.\nUtilized AJAX to increase web page’s interactivity, speed and functionality.\nImplemented MVC architecture using Spring 2.5 MVC framework and enhanced the design using Stateless Session Beans for the Middle Tier Development\nUtilized WSDL and SOAP to implement Web Services to optimize performance by using remote model applications.\nUsed JSF framework for implementing the Web tier of the application.\nDesigned and implemented complex multi-application flow through integration implemented using XML, XSL and JMS configurations.\nImplemented Object-relation mapping in the persistence layer using hibernate frame work in conjunction with Spring Aspect Oriented Programming (AOP) functionality.\nUsed CVS as a documentation repository and version controlling tool.\nUsed ANT scripts for build creation and to push onto various environments.\nUsed JUnit 4.2 for extensive functional and unit testing code.\nUsed Log4j for logging and debugging.\n\nEnvironment: Core Java, JDK 1.5, J2EE 5, HTML, CSS 2.1, JSP 2.1, JSF 1.2, JNDI, AJAX, Swing, Spring 2.5, Hibernate 3.0, JMS 1.1, SOAP UI, WSDL, UML, XML, XSLT, Windows XP, ANT, UNIX, Log4J, MVC Design Pattern, DAO, Eclipse IDE.\n\nAjr InfoTech, Hyderabad, India                                                                              AUG-2009 – JUNE-2012\nRole: Java Developer \n\nResponsibilities: \n\nWorked on writing Java code for extracting backend data from the main frames.\nInstantiated business objects with IOC pattern using spring framework and for Dependency Injection.\nImplemented Object-relation mapping in the persistence layer using Hibernate frame work in conjunction with spring functionality.\nAgile process is used for tracking and developing the application.\nDevelopment and Integration of the Application using Eclipse IDE and used StarTeam as Version Control Tool.\nImplemented the integration with the back-end system with web services using Axis and SOAP\nUtilized JUnit test cases for all the developed modules. \nExtensive experience in different IDEs like RAD, Eclipse, NetBeans.\t\n\nEnvironment: Java, J2EE, Spring Framework, HTML, JavaScript, Hibernate, Eclipse IDE, Star Team, Axis, SOAP, JUnit, RAD, Eclipse, NetBeans.\n.\n\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "ci/cd",
        "communication",
        "css",
        "html",
        "java",
        "javascript",
        "jenkins",
        "mentoring",
        "mysql",
        "node.js",
        "oracle",
        "react",
        "redux",
        "scrum",
        "sql"
    ]
}