{
    "id": "resume_cc4afcd6-8e5b-4a33-8cbb-99642a439f0f",
    "metadata": {
        "filename": "Ashwini J2EE Developer.docx",
        "processed_date": "2025-09-24T08:45:39.167487+00:00"
    },
    "raw_text": "\nAshwini C\n©732-352-1613\nashwinicha8@gmail.com\nSr. Java/J2EE Developer\n\n  Summary:\n\nAround 8+ years of experience in analysis, design, implementation and testing of Object Oriented Applications in Client/Server environments using Java/J2EE. \nExperienced in Java Application Development, Object Oriented Concepts, Object Oriented Design (OOD), Object Oriented Analysis (OOA), Object Oriented Programming (OOP) and its implementation. \nExpertise in design and development of various web and enterprise-level applications using Java/J2EE technologies like Spring, Hibernate, XML, Struts framework, EJB, JSF, JSP, JSTL, JQuery, JavaScript, Ajax, JDBC, JMS, JavaBeans and Servlets.\nStrong experience in implementing Service oriented architecture and Web Services using SOAP, RESTFUL API’s.\nWorked on micro- service based architecture using spring boot for developing the micro services, Netflix components (eureka, ribbon), spring cloud for supporting the cloud native environment. \nDeveloped web applications by implementing Model View Control (MVC) architecture and considerable experience in various front-end technologies. \nExperienced in developing web applications with Single Page Applications (SPAs) Framework using AngularJS and also good knowledge of NodeJS. \nCreated Typescript reusable components and services to consume REST API's using Component based architecture provided by angular 2.\nExperienced in frameworks: Jakarta struts framework, JSF, Spring, SpringBoot, SpringBatch, Spring Security, Hibernate. \nExperience working with Service Oriented Architecture, which includes Universal Description and Discovery Integration (UDDI) lookups and Web Services Description Language (WSDL) using SOAP protocol.\nExpertise in XML technologies such as DTD/Schemas, DOM, SAX, JAX-B and XSLT.\nExperience working with Hibernate for mapping Java classes with database and using Hibernate Query Language (HQL). \nExperience in configuring and deploying the applications on Tomcat, WebSphere, WebLogic and JBoss Servers.\nExperience working with various SDLC methodologies like Agile Scrum, Domain Driven Design and Waterfall Model. \nExperienced in writing complex SQL queries, Triggers and Stored Procedures in various databases such as Oracle, DB2 and MySQL. \nExperienced in Development, testing and deployment of enterprise applications on Windows &UNIX platforms using IDE's such as Eclipse, Rational Application Developer (RAD), IntelliJ and NetBeans. \nExperience in using different version controlling/tracking systems GIT, CVS, Subversion.\nExperienced in working with multiple databases like Oracle 10/11g, SQL Server, MySQL, PL/SQL and DB2.\nExperienced in performing unit testing using JUnit, Mockito integration and deployment of applications using tools such as ANT, Jenkins and Maven& debugging through log4j. \nExperience in document preparation including Requirement Specification, Analysis,design documents, Test cases and User Training documents and Technical Help documents. \nExperienced in working with E-Commerce software systems.\nExcellent verbal, written communication and presentation skills, problem solving and conflict resolution skills. \n\n\nTechnical Skills:\n\n\nEducation: Bachelor of Electronics and communication Engineering, JNTUH, INDIA \n\nWork Experience:\nOnsite work experience: October 2015 to Present\nSenior Java Developer\nFPL/Infosys – Jupiter, Florida – February 2017 to present\n\nDescription:\n\nThis project which has been developed on PowerBI  tool for monitoring the Dashboard applications. Developed Dashboards on PowerBI desktops, PowerBI.com and PowerBI mobile view.\n\nResponsibilities:\nWorked as the  Lead developer in the architecture team to design the application.\nWorked in agile, Scrum environment and Jira board to update the task on daily basis.\nDeveloped Rest Services using Spring Boot. To Rest Call the service which prints the JSON Response from the Database.\nDeveloped Unix scripts, Perl scripts and SQL control files to load data through SQL Loader & Oracle data pump.\nExperience on Database Oracle 11.6, Microsoft SQL Server 2014.\nImplementing the service layer converting XML to JSON through Restful using JAXB.\nImplementing the Proxy settings for Data binding the JSON, XML and pushing Datasets to PowerBI.com.\nWorked in test environment and deployed services on test servers.\nCreate Java Batch jobs for running bulk Queries and datasets to run on PowerBI tool.\n\nEnvironment: Spring 4.0, Spring Boot 1.5.9, Unix scripts, SQL, Oracle 11.6.0, Microsoft SQL Server 2014, maven, Java Batch, Java 8.0.\n\nSenior Engineer \nTarget/TCS – Brooklyn Park, Minnesota – February 2016 to February 2017\n\nDescription:\n\nTarget Enterprise, Inc Senior Engineer will be responsible for writing, developing and unit testing software and building, testing and implementing infrastructure components to meet design specifications. Worked in a scrum team on backlog items including custom java development and upgrade activities traditional mainframe batch applications will be replaced by java batches and restful services. \n\nResponsibilities:\n\nExperience in Agile Methodology, SCRUM, KANBAN.\nCreate and maintain APIs utilizing swagger framework backed by JPA data access layer.\nDesign and Implement OAuth2 integration on RESTful APIs.\nImplementing complex large-scale, real-time Web and Enterprise applications by utilizing Java/J2EE based technologies including Spring MVC, JSP, Ibatis and Web services.\nCarrying-out the root-cause analysis of Java related incidents, events and problems.\nExperience in application server (Websphere, Tomcat).\nHands on experience in working on Spark-SQL queries, Data frames, import data from Data sources, perform transformations, perform read/write operations, save the results to output directory into HDFS.\nManage OpenStack for growing development teams. Build, configure and maintain all instances.\nWrote Spring Security based authentication and authorization layer. \nExtensive experience in developing RESTful Web Services using Apache CXF and Jersey using spring boot.\nHas knowledge on spring cloud using spring boot for integration, routing and distributed messaging.\nImplemented Message Forwarder Java Middleware to fetched messages from variety of input \nmodule and forwarded data to Kafka cluster.\nExperience with SQL (Oracle, DB2, DBA) and NoSQL (Postgres) databases.\nUsing test driven development (JUNIT) and building CICD pipeline using Maven, Jenkins(JAYS), Drone Chef and Git.\nDeveloped UI components using HTML5, CSS3, Bootstrap and JavaScript for front-end development.\nInvolved in writing application level code to interact with APIs, Web Services using AJAX, JSON and XML.\nCreate Spring Batch jobs for running Bulk Query and used PK chunk method for retrieving data from the portal.\nBuilding micro services - Rest web services to support enterprise architecture.\nDeveloped Controller classes, DOA classes, beans, JSP's and Data Objects in Java.\nThe build process involves Spinning Up an OpenStack/VMaaS VMs with CentOS on two different Data Centers with complete Load Balancer setup.\nMerged an existing Angular 2 application into an Angular 3 applications as part of an effort to retire use of AngularJS\nImplemented an MVC based web application in Scala language using Web Sockets.\nUsed Java 8 lambda expression to represent one method interface and used sequential and parallel streams in collections source.\n\nEnvironment: Spring 4.0, Spring boot 1.5.6, Java 8.0, netbeans, Spring Batch 4.0, maven 3.0, Drone, Chef, Jenkins, Docker, Spring Security, VmaaS, DBA, OpenStack, Kafka, Oauth2, Scala, HTML5, JSP, Spark, Swagger, HDFS, AngularJS 3.\n\t\nFull Stack Developer\nVerizon- Atlanta, GA – August 2015 to February 2016\n\nDescription: \n\nThis project, which has been developed to significantly reduce the development effort of the various developer teams within the organization. RDLU: Remote Door Lock Unlock allows the users to lock or unlock their vehicle using an application on their mobile device. \n\n\n\nResponsibilities:  \n\nWorked as a developer in the architecture team to design the application and define standards for other development teams within the organization. \nDesigned and coded application components in an agile environment utilizing a test driven    development approach.\nExtensively used Spring components and concepts like Aspect Oriented programming, Transaction Management, Dependency Injection, DAO and MVC.\nDesigned and developed functionality with excellent understanding of design patterns like singleton, factory and MVC.\nImplemented service layer offering JSON or XML data through RESTful services using CXF.\nImplemented REST client using JERSY to consume data from Legacy application.\nUsed Hibernate to do object relational mapping in the application. Involved in creating hibernate mapping files for class associations, inheritances and generating sequences.\nUsed HQL Criteria, Restrictions to retrieve and manipulate data from backend.\nDeveloped presentation layer using JSP, JSTL, HTML5, CSS, and jQuery.\nKnowledge on micro- service based architecture using spring boot for developing the microservices, Netflix\ncomponents(eureka, ribbon), spring cloud for supporting the cloud native environment.\nDeveloped SPA using ReactJS to utilize the HTML5 DOM features and update elements that are modified in the webpage.\nDevelop cross browser compatible web pages quickly and effectively using jQuery, HTML5, CSS3, Responsive Web Design, Bootstrap and Angular JS 3.\nExperience in Design and development of test automation frameworks for Web applications (responsive, Cross browser) using various Open Source/ Commercial testing tools like Selenium Web Driver/IDE,Testing, JUnit.\nUsed XML technologies like XPath, XSTL for preparing reports.\nIntegrated Hibernate with Spring and configured corresponding xml configuration files.\nImplemented Java beans with JAXB Annotations for marshalling and un-marshalling of Java Objects.\nUsed SQL Developer tool and written PLSQL functions, procedures, triggers. Involved in tuning performance by creating Indexes.\nCame up with Test Suites and Test Cases for unit testing and implemented unit testing using JUnit.\nInvolved in Peer Level design and code reviews.\nExperience writing unit tests and performing and end to end testing.\nHas experience in CI and CD – Understands Jenkins, GitHub, etc.\nUsed Git for source code management and source tree for managing the code push, pulls and resolving conflicts. \nExperience Developing application using Groovy, Grails, GSP, GORM, Grails Plugins and Grails Rest\nServices.\nSetting up Java/J2EE development environment using Eclipse, Maven and WebLogic.\nHelped developed Restful API in JAX-RS such as servlet to handle database operation.\nBuilt the AngularJS 2 dashboard and supported Java backend.\n\nEnvironment: Core JavaJDK 8, Restful Services, Spring 4.2.6, Webservice, HTML5, CSS3, Java Script, Groovy, AngularJS 2, ReactJS, Maven, Eclipse, JAX-B, JAX-RS/Jersey, JAX-WS, XML and JSON.\n\n\nJava/J2EE Developer\nDisney- FL – September 2013 to July 2015\n\nDescription: DIPR (Disney ID for Parks and Resorts): The main purpose of the application is to capture user activity on Disney and its affiliate sites in real time and apply the changes in the database. This application solves the problem of an existing Interface with rules driven, event based (with queuing) interface, to capture all new affiliate registrations, and all updates to known guests providing a recovery mechanism. \nThese projects were developed using Java EE 7, IBM WebSphere Application Server v8.5, drools 6.3, Tomcat 7.0, Spring 3.2, SOAP Web Service, Spring Security, RESTful, Servlet 3.0, JDBC, XML, JSON, Eclipse, JAX-RS, Oracle RDBMS.\n \n Responsibilities: \n\nResponsible for coordinating the design and implementation activities, collaborated with project managers and engineering teams.\nDesigned and coded application components in an agile environment utilizing a test driven    development approach.\nWorked on providing Authentication to Restful Web services using Authz and OAuth.\nDeveloped the application using Java multi threading to enable scheduling and management of the offs tasks to keep up with the huge amount of user records received from CNS. \nDeveloped Controllers for Restful services using spring-web mvc.\nDeveloped web services callers using Jersey framework.\nWorked on MVC (Model View Controller) architecture using Springs/Strutsframework and various Java / J2EEdesignpatterns.\nExperience with third-party APIsExperience with CSS pre-processors.\nServers installation and Maintenance of windows 2008 and RedHat 6.x & 7 Linux Server.\nDesigned and Developed Web Services using Restful and SOAP protocols using Elasticsearch.\nUsed Soap-UI and Rest Client for functional testing of the web services. \nUsed the DOM parser to parse xml’s and extensively used javacollections framework. \nConsuming and exposing various Web services using JAX-RS and JSON to different systems for business services. \nInvolved in creating Database SQL and PL/SQL queries and StoredProcedures.\nImplemented Singleton pattern for property loading, loading xml’s, jaxb context creation and static data from DB.\nWorked on performance tuning of the application to greatly improve the efficiency and execution time. \nUsed Hibernate for mapping java classes to the database.\nDeveloped web services components using XML, SOAP and Axis2.\nDeveloped Database interaction objects by implementing the DAO pattern.\nDeployed applications on WebSphere application server and tomcat web server. \nUsed Log4j API for logging in the application.\nDeveloped web applications on Tomcat server.\nUsed GIT for version control across common source code used by developers.\nDeveloped the application using Eclipse.\nPeriodic on-call/after-hours production support for scheduled maintenance routines, quarterly system updates and patches, and other items that affect operations.\nSupported transition in platform to AngularJS, used Protractor for testing.\n\nEnvironment: Java EE 7, IBM WebSphere Application Server v8.5, Tomcat 7.0, Spring 3.2, Spring Security, Spring 4.2.6, SOAP Web Services, RESTful web services, Servlet 3.0, JDBC, Hibernate, Spring boot 1.2.6, JUNIT 3.8, Eclipse, Log 4j, Axis 2, OAuth 1.4, JAVAX 2.1, D3, JAX-B, JAX-RS/Jersey, JAX-WS, XML, AngularJS, Oracle RDBMS and JSON.\n\nJava/J2EE Developer\nAustin County State Bank - Austin, TX – September 2010 to August 2013\nDescription: Austin County State Bank is a leading property and casualty insurance company based in Texas. Austin County’s safety team works with clients to help protect their employees and their dividend program provides rewards for keeping clients workplace safe. The application developed provides the clients with insurance quotes and forms online. It allows the client to buy insurance online, check policy information, direct bill statues and report claims. This Project was developed using Spring, Hibernate, Struts 2.x, Maven, HTML5, CSS3, JavaScript, JMS, RAD, Oracle Database, Ajax, EJB, JQuery, E-trade,E-Commerce, Websphere Application Server, SOAP and Web Services.   \n \n Responsibilities: \n\nDeveloped Use case diagrams, Object diagrams, Class diagrams, and Sequence diagrams using UML. \nThe application architecture of the System is based on Spring MVC (Model View Controller) and J2EE specifications. \nImplemented the application using design patterns such as Session Façade, Business Delegate, Bean Factory, Singleton, Data Access Object, and Service Locator. \nImplemented Hibernate Template to great extent making use of HQL, Named Parameters, Named Queries and interfaces such as Expression, Query and Criteria.\nWorked on developing POJO classes to map database tables with java objects. \nInvolved in creating test cases using JUnit strictly following Test Driven Development. \nWorked on SOA Web Services using SOAP for transmission of large blocks of XML data. \nUsed Maven and Jenkins to automate the build and deploy process. \nInvolved in full project management life cycle from development to integration, testing and release to lower environments. \nHave managed QA and UAT phases for various large IT implementations in Capital Market.\nResponsible for all backup, recovery, and upgrading of all the PostgreSQL databases. \nResponsible for configuring, integrating, and maintaining all Development, QA, Staging and Production PostgreSQL databases within the organization.\nExperience with performance tuning of code – ex – better file reads, algorithms, handling connections, transactions, Thread –safe and its pro-cons, performance tools, etc.\nAbility to design frameworks which are extensible and flexible.\nUsed log4j for logging errors in the application. \nInvolved in testing the JMS integration between queues and topics. \nUsed JUnit for unit testing of the application and log4j for logging.\njQuery template for markup. Implemented two way data binding through scope in applications built on AngularJS.\n\nEnvironment: Java 7.0, Struts 2.X, Spring, Hibernate, JavaScript, AJAX, EJB, JQuery, HTML5, CSS3, E-Commerce, JMS, JAXP (SAX & DOM), WebSphere Application Server, RAD, AngularJS, Oracle Database, SOAP, Maven, log4j, Junit, XML, Web Services.\n\nSenior J2EE Developer\nGE Healthcare– Hyderabad, INDIA - September 2008 to August 2010\n Description: GE Healthcare provides transformation medical technologies and services helping to deliver patient care to people around the world. GE provides an online website for the customers. This web website is an e-commerce application which provides an online interface to manage user accounts for the customers to facilitate customers to view, purchase products and request services. This project was developed using Struts 2.0, Hibernate 3.0, HTML5, JSP, JSTL, JMS, JavaScript, XSL, XSLT, Servlets 2.5, RAD, WebSphere Application Server and Oracle 10g.\n \n Responsibilities: \nDesigned Use Case and Sequence Diagrams according to UML standard using Rational Rose. \nImplemented Model View Controller (MVC-2) architecture and developed Form classes, Action Classes for the entire application using Struts Framework. \nPerformed client side validations using JavaScript and server side validations using in built Struts Validation Framework. \nDesigned and developed HTML5, JavaScript, Ajax, XML, MYSQL, apps working in a LINUX Web Server and Apache environment.\nImplemented the data persistence functionality of the application by using Hibernate to persist java objects to the relational database. \nUsed Hibernate Annotations to reduce time at the configuration level and accessed Annotated bean from Hibernate DAO layer. Used HQL statements and procedures to fetch the data from the database. \nTransformed, Navigated and Formatted XML documents using XSL, XSLT. \nUsed JMS for asynchronous exchange of message by applications on different platforms. \nDeveloped the view components using JSP, HTML5, StrutsLogictags and Strutstaglibraries. \nInvolved in designing and implementation of Session Facade, Business Delegate, Service Locator patterns to delegate request to appropriate resources. \nUsed JUnit Testing Framework for performing Unit testing. \nDeployed application in WebSphere Application Server and developed using Rational Application Developer RAD. \nObjectives of securing confidentiality, integrity, and availability of assets, TCP/IP, Host and Network based intrusion detection and prevention systems such as HIPS and NIPS, risk management, incident \n\nresponse, common threats to web application vulnerabilities, penetration testing, designing networking infrastructure and configuring cisco routers and switches.\n\n Environment: Struts 2.0, Hibernate 3.0, JSP, RAD, JMS, JavaScript, PHP, XSL, XSLT, Servlets 2.5, WebSphere Application Server and Oracle.\n\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "communication",
        "css",
        "docker",
        "git",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "lambda",
        "microsoft sql server",
        "mysql",
        "oracle",
        "php",
        "postgresql",
        "problem solving",
        "project management",
        "rest api",
        "scala",
        "scrum",
        "spark",
        "sql",
        "typescript"
    ]
}