{
    "id": "resume_1de4d13c-24d2-490a-aa89-b567eb28a977",
    "metadata": {
        "filename": "Atul_Mathur_Resume.docx",
        "processed_date": "2025-09-24T08:45:39.221928+00:00"
    },
    "raw_text": "\nPROFILE SUMMARY                                                                                                                    \n\n11 years of work experience in Program Management, Project Management, Strategic Research, Business Analysis, Requirement Elicitation, Identifying root causes and developing work product in Agile (SCRUM) and waterfall SDLC methodologies.\nExtensive experience in Insurance (Life and P&C) and Banking (Mortgage, claims) domain\nGo to person regarding all client communications, client escalations, budgeting, reporting and planning.\nExtensive client facing experience leading strategic Initiatives including offshoring IT projects and systems replacement by working with product partners and geographically diverse teams.\nSCRUM certified professional experienced in Release management and defining the Project Roadmap, Velocity planning and Leadership reports.\nExtensive experience in defining project scope, project initiation, implementing planning and strategy and closure as a Scrum Master.\nExtensive experience to manage the project and track the progress by using the Tools like JIRA.\nExtensive experience to manage the RISK by using Impact Probability grid and define the mitigation strategy.\n\nEDUCATION\t\n\nMasters of Business Administration (M.B.A.) – 2009 – NMIMS University, Mumbai, India\nBachelor of Engineering (B.E.) (Computer Engineering) – 2004 – University of Rajasthan, India\n\nCertifications and Tools:\n\nCertified Professional Scrum Master™ level I (PSM I)\nJIRA, Confluence, Microsoft Project, MS Visio, Microsoft Office\n\nPROFESSIONAL EXPERIENCE                                                                                           11 YEARS 4 MONTHS\n\nClient: DXC Technology   \t\t\t\t\t\t\t\t    Apr ‘17 – Jan’18\nRole: Senior Manager – DXC Channel\nLocation: Los Angeles/ New York        \n\nProgram Manager handling projects for Metlife account at DXC \nSingle point of contact for all client escalations and new project discussions\nResponsible for client management and exploring and initializing new projects and opportunities\nThe work profile includes creating a plan to address project goals and working with customer stakeholders/SME’s while owning tracking and resolution.\nMaintain accurate program reporting information and up-to-date project assets and metrics while identifying risks and roadblocks.\nProgram managing solution roadmap workshops, use case discussions and vendor relations for capability procurement and use case definition.\nDiscussing business performance, value generation and lead generation to track business growth goals\n\nProject: Metlife, USA\n\nProject Description: G2C is a Java application migrated from mainframe applications which helps the clients to send the most up to date employee information and loaded to consumer database. This data will be used by various portals like member portal, client portal and doctor portal. G2C makes sure that the data coming from the clients is valid and accurate. G2C does all the complex validations, and generate reports for the clients and necessary actions in case of failure to load the data.\n\nRole: SCRUM Master/PM \nResponsibilities:\nRelease coordinator for corporate efforts and define/identify the scope of works\nCreate the Project reports to forecast the future work, team velocity and time taken by each process\nDefine the definition of done and work with Mphasis PM on resource management\nCoordinate with APO, Business SME’s and Implementation team.\nConduct the SCRUM ceremonies like Daily standup, Sprint Planning, Backlog grooming, Sprint Review/Retrospective.\nParticipate/Conduct SCRUM of SCRUMs\nManage the production issues and adhoc request by leadership team.\nResolve Impediments, conflicts and shields the team.\nParticipate proactively in developing and maintaining standards, tools and best practices. \nTrack, monitor and communicate team metrics and progress.\nWalkthrough on Burn down chart and Risk management chart.\nDeflect team distractions, remove execution impediments and escalate issues appropriately.\nEnsure transparency within and outside of team.\n\nClient: USAA\t\t\t\t\t\t\t\t\t\t  Apr ‘15 – Apr’-17\nRole: Program manager/ Principal Research Analyst\nLocation: San Antonio, Texas        \n\nProgram Manager for CTO Architecture and Strategic Research/Innovation Group at USAA\nPrimarily focused on handling team providing innovative research and approach towards business problems faced by Business and Architects in the IT strategic roadmap planning and execution\nResponsibilities include leading a team of Research Analysts performing market profiling, identifying desirable functionalities/approach and providing actionable business solutions and approach\nUnderstanding the client needs, prioritizing the research with Architecture board and responsible for presenting team KPI and performance metrics to client senior management.\nAn integral part of profile includes bringing product vendor solutions in the lab and performing specific business use cases to validate functionality and client requirements to prepare a comparison score card\nThe deliverables include detailed Project plan, performance metrics, Team forecast, Budget adherence, Research whitepapers, product/approach recommendation and business use case validations\n\nCompany: HCL Technologies Ltd\t\t\t\t\t\t\t  Feb ‘10 – Apr ’15\nRole: Deputy Manager\nLocation: Bangalore, India                \nClient Name: Genworth - a leading provider of Lenders Mortgage Insurance (LMI)\nIndustry Sector: Insurance\n\nProject Description: We were working with the client in claims administration area. The client was using Guidewire Claims center for Mortgage claims. The scope of work included Application Maintenance, Enhancement and Support and product version upgrade for : \nOxygen – This is a claims application based on ClaimCenter V5.0. It includes claims application interfaces, Reporting and Configuration\n\nDuration: (Mar 2014 – Apr 2015)\nRole: SCRUM Master/Business Analyst \nResponsibilities:\nMentored the core IT team to follow Agile practices instead of waterfall and deliver the project using Scrum\nGathered requirements from various business teams\nCreated stories out of various requirements and planned for implementing them in various iterations\nCreated a story backlog in JIRA and keeps on updating them accordingly\nBase lining of all the business artifacts and requirements implemented in each iteration and release accordingly\nCompliance to schedule and containment of defect leakage\n\nDuration: (Feb 2010 - Mar 2014) – Business Solutions Group\n\nProactive proposals, Response to RFP’s and collateral preparation\nResponsible for end-to-end opportunity life-cycle including bid management & planning, proposal handling, win strategy formulation, solution development, estimations, bid pricing, deal reviews & approvals, proposal defense, due diligence, best & final offer (BAFO) and contract negotiation.\nUnderstanding customer pain points and recommending solutions, Market research, and competitive intelligence based on sales pursuits.\n\nStrategic Initiatives\nSpearheaded Solution workshops with clients to validate scope and refine the solution offerings  \nWorked extensively in giving joint proposals with product partner like eBao, CSC etc. to cement long term partnership and evolution of go to market strategy\n\nCompany: Office Depot Reliance\nRole: Management Trainee, IT, Supply Chain and Merchandising                                      Jul ‘09 – Feb’10\nLocations: Navi Mumbai, India                \n\nIdentified problem areas and suggested ways to tackle business issues by data generation and analysis for catalogue marketing campaigns.\nRedesigning SKU creation process to improve follow ups by defining department specific response time and escalation matrix\nInvolved in process improvements for transparency and better compliance during Supply Chain training.\n\nCompany: Schneider Electric India\nRole: Software Engineer                                                                                                        Aug ‘04 – May’07\nLocations: Bangalore, India                \n\nLed a team for a prestigious firmware verification project, coordinating across four countries.\nResponsible for project execution, planning, resource requirements, duration, risk analysis and mitigation.\nMember of steering committee responsible for obtaining quality certification (CMMI Level 3).\n\nSUMMER INTERNSHIP                                         TATA COMMUNICATIONS (Corporate Strategy Department)\n\nFormulated Market Entry Strategy for TATA Communications in middle-east markets (U.A.E., Qatar and Bahrain) \nAssessed market attractiveness from the macroeconomic, regulatory and telecom market perspective\n",
    "extracted_skills": [
        "agile",
        "confluence",
        "go",
        "java",
        "jira",
        "leadership",
        "project management",
        "scrum"
    ]
}