{
    "id": "resume_ae8041d5-c81d-4fb5-ad90-e0f29fc928db",
    "metadata": {
        "filename": "BA - Navneet.docx",
        "processed_date": "2025-09-24T08:45:39.681508+00:00"
    },
    "raw_text": "NAVNEET \n407-401-9023 / 11baconsultant@outlook.com\n\nSUMMARY\nConsultant with 8+ years of proven track record of success in delivering outstanding results in a client facing role in the field of Law Enforcement, Health Care, Mortgage, Loan origination including Equipment Financing Govt., Manufacturing and Insurance products with IT Support in various financial domains.\n\n• Full project life cycle experience as a consultant and manager of large-scale IT projects, consistently producing quality deliverables on schedule and under budget.\n\n• Several years of experience and advance knowledge of the Systems Development Life Cycle (SDLC), and project life cycles like Agile, Rapid Application Development (RAD) and Waterfall Model.\n\n• Worked in all aspects of solution development, including business case development, workshop facilitation, Gap analysis, requirements definition, business analysis, solution design, testing, and training and also assisted Architecture with technical proposal document.\n\n• Capturing the Technical Requirements and defining technology solutions using user interviews, document analysis, requirements workshops, surveys, local site visits, business process descriptions, use cases, business analysis, and task and workflow analysis.\n\n• Scheduled Training sessions for Client, with the help of training needs analysis, detailed training plan, development of comprehensive training and support materials, delivery of training and evaluation of training.\n\nTECHNICAL SKILLS\n\n\n\n\n\n\n\n\nPROFESSIONAL EXPERIENCE \n\nNew Orleans Police Department, Louisiana, LA\t\t\t\t\t\tSept 2015 – present\nBusiness Analyst and Tester\t\t\t\t\t\t\t\t\t   \nProject is a web based application for Police Departments located in New Orleans. I am working as part of a multidisciplinary project team in all aspects of solution development, including business case development, workshop facilitation, gap analysis, requirements definition, business analysis, solution design, testing, and training I worked effectively and efficiently, independently and as a team member.\n\nResponsibilities:\nApplied proven business and analytical skills through the application of established frameworks, methodologies and processes.\nFollowing the Agile methodology during the entire SDLC and supported development teams through the agile development process.\nPerform QA for website enhancements and bug fixes.\nTroubleshoot CMS problems related to the workflow or publishing of pages or content.\nConducting daily Scrum meeting to know the progress of the team. \nProviding Level of Effort (LOE) estimates for requirements analysis work, participating in the planning for systems requirements development and artifacts completion.\nWorking with various end users to understand and document their current business operations and collected functional, non-functional, and technical requirements and documented them in artifacts such as Requirements Traceability Matrices, System Requirements documents and SOW (Statement of Work).\nCapturing the technical requirements and defining technology solutions using user interviews, document analysis, requirements workshops, surveys, local site visits, business process descriptions, use cases, business analysis, and task and workflow analysis.\nCreating modeling diagrams such as Activity flow diagrams, and Data Models.\nWorking closely with Project manager in handling the whole project.\nMade GAP Analysis documents to avoid conflicts and last-minute changes asked by Client.\nScheduling Training sessions for Client, with the help of training needs analysis, detailed training plan, development of comprehensive training and support materials, delivery of training and evaluation of training.\nWritten high quality Test Plans and Test Cases in Pilot Release.\nIdentified and communicated defects and bugs to Developers and other team members.\nWorking on SharePoint servers to store documents and keep tracks of the whole team.\nConducting UAT (User Acceptance Testing).\nFollowed the defined QA processes to ensure all standards are met.\nTroubleshooting and resolving application issues; identifying ways to improve existing processes via writing SQL, Java and HTML code.\nExecuted and evaluate manual and automated test cases and report test results.\nIdentified any potential quality issues per defined process and escalate potential quality issues immediately to management.\nEnsured that validated deliverables met functional and design specifications and requirements.\nIsolate, replicate and reported defects and verify defect fixes.\n\nBusiness Analyst \t\t\t\t\t\t\t\t\tFeb 2015 – Aug 2015\nMagellan Health Services, Richmond, VA                                                        \t\t\t\nMagellan offers full service PBM (pharmacy benefit manager) that combines clinical expertise in mental illness and chronic conditions with flexible technology to deliver holistic solutions that improve the health of patients and manage spend. The project I was assigned to was to work on prescription drug program for Federal Employees Health Benefits Program.\n\n\n\nResponsibilities:\nVerified, consolidated, documented and tracked requirement capture and implementation.\nReported completed requirements artifacts to stakeholders for approvals and communicated them with technical team including architects, developers and testers for clarification and acceptance.\nCreated clearly defined user stories with acceptance criteria for validity purposes.\nInvolved in overall tracking of Project Management/Test Management activities like work plan management and consolidation of overall project related activities.\nCreated AS-IS and TO-BE documents as part of GAP Analysis for requirements for all applications and worked on solutions for closing the gaps.\nCreated implementation plan for implementation of process, methods and tool to ensure that all applications follow the process, methods and tools as established by the quality management team of Magellan.\nFollowed up on SDLC to ensure that implementation was going smoothly as per software development life cycle as charted in project charter.\nCreated and maintained RAID logs for risk management and smooth closure of implementation activities.\nResponsible for tracking hardware/software acquisitions and purchase as per necessity to provide productive working environment for developers/testers and to ensure deployment process goes as smoothly as possible.\nPerformed UAT testing and was heavily involved in UAT coordination including scheduling setting up environments and creating test scenario.\nWorked with system testers to ensure requirement are completely and accurately implemented and tested.\nEnvironment: MS Word, MS Excel, MS Visio, Windows XP, Quality Center, Clear Quest, JIRA.\n\nU.S Department of Interior, Herndon, VA\t\t\t\t\t\t\tOct 2014 – Feb 2015\nSr. Business System Analyst (Information Management)\nSCI Group is the vendor of U.S Department of Interior who is reviewing the current and future needs of Renewable Energy Program for storage, management and access of document for Data Management and Records Management. \n\nResponsibilities:\nWorked with SCI Group to collect information and document keeping Presidential M-12-18, NARA Guidelines and DOD5015.02 in mind.\nERP framework.\nWorked closely with Project Manager on Need Report and Options Report.\nDeliver requirements under the Agile Scrum SDLC methodology to meet a very fast release schedule.\nOnsite Program Management of existing Information Management projects.\nExperience working on SharePoint. \nWorked on enhancements closely with developer team to fix the bug. \nSuccessfully developed the architecture, system design, metadata, and workflow design for modernization of a large credit union’s electronic document management system.\nWorked on life cycle management from creation to destruction.\nProviding enterprise level software to vendors based on their current requirement.\nMaintained and implemented rules as per M-12-18 and NARA guidelines.\nExperience in documenting as per NARA guidelines and DOD 5015.02.\nData mapping for Captured Source and Destination database mapping for housing information in-house for downstream application.\nCreated Business requirements, functional requirements and Use case diagrams.\nResponsible for defining the scope of the project(s), feasibility analysis, project planning, gathering business requirements by conducting user interviews, JAD sessions, and story boarding.\nUpdated and modified progress and resources allocation in MS project for the team.\nConverted the technical document in to business document for better understanding for SME of backend process. \nDocumented various Business rules, Technical requirements, Business requirements and Supplemental requirements.\n\nGE Transportation, Erie, PA\t\t\t\t\t\t\t\t\tFeb 2014 – Sept 2014\nBusiness System Analyst\nA division of the General Electric (GE) Company that manufactures equipment for the railroad, marine, mining, drilling and energy generation industries. The Project is a web based application. Determining how the present GE Transportation's software is in alignment with the overall corporate goals.\n\nResponsibilities:\n\nCapturing the technical requirements and defining technology solutions using user interviews, document analysis, requirements workshops, surveys, local site visits, business process descriptions, use cases, business analysis, and task and workflow analysis.\nGive directions to other System and Business Analyst to analyze the business.\nProficiency with enterprise business management software – PeopleSoft.\nValidate reporting and troubleshoot data issues; recommend and implement resolutions.\nLead strategic improvement efforts related to data collection, allocation, and costing methodologies to enhance the current Business Support execution model. Integrate improvements into the standard production process. \nLead other analysts in understanding the business use cases and writing inner queries.   \nCreating the conceptual, logical and physical design of the solution to ensure appropriate technology is acquired and implemented via producing and maintaining requirement specification documentation.\nUtilized Rational Unified Process (RUP) to configure and develop processes, standards, and procedure.\nWork with application SME's, QA analyst, and business partners to ensure that the programmed solution meets the requirements.\nPerforming application development activities – writing source code, configuring applications and unit testing – that support the enterprise application strategy.\nMaintaining the change control process for all source code and application changes generated across a distributed environment that includes both on premise and cloud technologies. \nDelivering against a backlog of production issues and enhancement requests using the IT Service Management system. \nConducting UAT (User Acceptance Testing) using HP Application Lifecycle Management tool.\nTroubleshooting and resolving application issues; identifying ways to improve existing processes via writing SQL, Java and HTML code.\nDeveloping, manually executing and documenting test cases and test scripts via the HP Lifecycle Management tool (version 11.00).\nCoding and executing performance tracking and reporting scripts in Oracle SQL, PL/SQL, JavaScript and HTML.\n\nPNC Bank, Strongsville, OH\t\t\t\t\t\t\t\t          Jan 2012-Feb 2014\nBusiness Analyst\nThe project was a web based application involving the automation of Student Mortgage Loan Origination process beginning from origination/opening the mortgage through fund closing. The system performs all the functions of loan processes such as set up an account information, new student loan set up, appraisal, credit, income, making loan payments, managing personal and amortization schedules, obtaining documents, forms, payoff statements, and managing automatic account drafting. Extending capital to businesses for the purpose of acquiring equipment. The project involved modules for Student Loan Pre-approval, application, underwriting, pricing, processing and closing.  \n\nResponsibilities:\nHighly skilled to translate business requirements or functional requirements into functional specifications.\nFirm understanding of the Software Development Life Cycle (SDLC).\nDeliver requirements under the Agile Scrum SDLC methodology to meet a very fast release schedule.\nWorked on various applications and Conducted Gap Analysis between “As is” and “To be” process for the applications. Participated in the Logical and Physical Design sessions and developed Design Documents. \nCreated role based matrix for these applications and worked with the developer to create applications supporting these roles.\nExcellent knowledge of mortgage life cycle and worked on mortgage loan origination fee generation system\nUtilized Rational Unified Process (RUP) to configure and develop processes, standards, and procedure.\nConducting UAT (User Acceptance Testing) using HP Application Lifecycle Management tool.\nPerformed UAT to make sure that all requirements were catered for in the application\nConducted Functional Walkthroughs, User Acceptance Testing (UAT) sessions, and assisted the development of User Manuals for customers.\nTroubleshooting and resolving application issues; identifying ways to improve existing processes via writing SQL, Java and HTML code.\nPerformed Gap analysis by identifying existing technologies, documenting the enhancements to meet the end state requirements.\nAnalyzed and documented Business requirements and detail design of the software for full understanding of the business.\nAccumulated student’s requirements from various end through surveys, interviews and JAD sessions, stake holders and translated them into system requirements.\nDefined the change management approval procedures to control the scope of the order management requirements.\nActively engaged various partners from the client team to monitor and control the risk associated with changing scope.\nIdentified the business risks associated with the new system and formulated a Mitigation Plan to reduce the effect of critical risk factors.\nCreated Business requirements, functional requirements and Use case diagrams.\n\nThompson Reuters, Mclean, VA\t\t\t\t\t\t\t\t\tNov 2010 – Jan 2011\nBusiness Analyst\t\nOmgeo Connect, a complementary offering to Omgeo's existing solutions, Omgeo Connect provides a single point of access for investment managers and investment manager outsourcers to interact with Omgeo services and other best-of-breed post-trade solutions, enabling the trade and settlement management of multiple asset classes via an ASP environment.  Omgeo Connect will be most valuable for investment managers with large, multiple asset class trading volumes and complex environments, as well as investment manager outsourcers looking to consolidate multiple investment manager operations onto a single platform. Omgeo Connect enables clients to reduce operating costs and risks quickly without high up-front costs and unpredictable ongoing expenditures associated with custom-developed environments and various vendor-system upgrades.\n\nResponsibilities:\n\nWorked as a team player and as a business analyst on Omgeo Connect, Oasys, INSITE and P&O Projects, cross functional tasks from clarifying functional specifications through implementation, for product development efforts. Work in partnership with Cross Functional team business analysts, product managers, and software developers, both within the company and sometimes with offsite partners for UAT. \nWorking on post trade confirmation, pre-settlement and trade communication products; “CTM, OASYS, Trade Suite and BBH messaging”.\nGathered and documented User Requirements for proprietary Global and Domestic trading systems\nCoordinated product reviews of Requirement documents, incorporated agreed changes and obtained global sign off on final versions from Project Management and CFT.\nDocumented existing processes and assisted in identifying areas of improvement for Operating Model in Pre-Trade and Post trade settlement process.\nCreated and executed test scripts for existing defects, system enhancements and new system functionality.\nUtilized Rational Unified Process (RUP) to configure and develop processes, standards, and procedure.\nImplemented functionality for Omgeo Connect, a single point of entry for multiple Omgeo services, such as Omgeo Central Trade Manager (CTM), Omgeo OASYS, and Omgeo Trade Suite ID.\nReviewed System and Functional Design documents to ensure adherence to specified business requirements.\nResearched current techniques, systems and processes in place to determine changes to reduce costs, enhance efficiency and meet business needs.\nAssisted in User Acceptance Testing (UAT), developing and maintaining quality procedures, and ensuring that appropriate documentation is in place.\nInteracted with third party vendor during all product development lifecycles (including system design, testing, defect review and implementation).\nInvestigated system defects generated by Omgeo Connect trading system while interacting with End Clients.\nCreated system “workarounds” for end-users upon discovery of defects.\nServed a leading role in internal agile transformation and in presenting the company's agile transformation to customers Worked in implementation of QA methodologies like Waterfall, Agile, CMMI and SCRUM.\nWorked with the Technical Support Manager to ensure that all Support QA tasks have resources assigned and the workloads are level. \nIdentifying the Security Risks in the application that being built and address them in the requirement document to avoid the security breaches. \nWorked with subject matter experts including architects, software engineers, and QA professionals to gather detailed information about the product being built. \n\nNetsoft Microsystems, India                 \t\t\t\t\t\t\t\tApril 2009 – Oct 2010\nBusiness Systems Analyst\nNetsoft Microsystems specializes in Offshore and Inshore Development of Software, and offers to engage in a long-term partnership with the clients. Applicant Tracking System (APS) application is designed to help companies in streamlining their recruitment process. It can be used for post job openings, screen resumes, generate and send interview requests to potential candidates by email. It also has a gamut of other features like individual applicant tracking; pre-screening questions, response tracking, automated resume ranking etc. and a wide variety of reports can be generated to perform recruitment data analysis.\n\nResponsibilities:\nCoordinated all aspects of projects such as initiation, planning, scheduling, task assignment and tracking, status reporting and risk management.\nFacilitated JAD sessions to coordinate activities for project schedules, presented deliverables to the management, conducted JAD sessions to elicit requirements.\nIdentified processes for developing and documenting detailed business requirements including process, data flow analysis and modeling. \nCreated Use-Cases, BPM, and Requirement documents to document the Business needs.\nRequirements were gathered through interactions and meetings and periodic walkthroughs with loan analysts, credit analysts and other potential users of the application. \nConducted Use-Case reviews and identified Gaps, leading to improvements/enhancements in the same. \nManaged requirements to minimize scope issues. Understood all system requirements and provided feedback, collected requirements from stakeholders and prioritized them.\nWorked with the Project Manager on various Project Management activities such as keeping track of the\nProject Status, Deadlines, Environment Request, and Compliance Issues. \nPrepared Business Process Models including modeling of all the activities of the business from the conceptual to procedural level.\nResponsible for building training materials to train team members with Business process.     \nTracked issues that were detected and updated the status of existing issues based on the daily meetings with the offshore team.\nWorked closely with Project manager/Senior Analysts in handling the whole project.\nFollowed the Agile methodology during the entire SDLC. \n\n\n\n\nEDUCATION \n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "data analysis",
        "html",
        "java",
        "javascript",
        "jira",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}