{
    "id": "resume_e3ba3d00-3c7f-4bde-92de-ec19b110d960",
    "metadata": {
        "filename": "BA Kiran.docx",
        "processed_date": "2025-09-24T08:45:39.747630+00:00"
    },
    "raw_text": "\nPROFESSIONAL SUMMARY\nMore than 7 years of comprehensive experience in the field of Information Technology as Business Analyst in diverse fields such as Finance, Mortgage, Trading, Insurance, Wealth Management, Banking, Investment Management and Accounting. \nExtensive experience in the development, implementation and integration strategies towards a team-oriented environment, utilizing quantitative and qualitative analytical skills. With ease in communicating/converting clients vague/non-technical requirements into precise/concise representation to the team. \nKnowledge of Capital Markets, Initial Public Offering(IPO), Fixed Income Securities, Equity Securities, derivatives. \nExperience with investment banking regulatory/compliance reporting regulations like Basel II and III Accord. \nExperience in interviewing Business users & SME providing recommendations to resolve issues for various business/technical groups & defining strategic solutions to business problems in a multiple project environment. \nExtensive experience in Banking Industry group including Credit, Risk, Investment and Operational Risk Banking that involve knowledge in CCAR, Basel II, Basel III\nExperienced in working with User Interface team in creating Mockups and Wireframes \nProficient in authoring Business Requirement Documents (BRD), System Requirement Specifications (SRS) and identifying interfaces and business process specifications. \nExperience in developing detailed functional specs through JAD sessions, interviews, on site meetings with business users & development team. \nStrong experience in working with all phases of SDLC throughout the project life cycle in Waterfall and Agile (SCRUM) environment. \nMature understanding of Quality Assurance Methodology relative to SDLC.\nExperienced in creating various Unified Modeling Language (UML) Diagrams using UML modeling tools such as MS Visio. \nProficient in documentation of As-is and To-be business processes. \nProficient in utilizing Project Management tools, project plans, project schedules, resource planning and management, budgeting, project kickoff meetings, status meetings, and timeline management. \nKnowledge of GAP Analysis, Traceability Matrices, SWOT Analysis, Risk Analysis, Data Analysis, Competitive Analysis, Impact Analysis, and Cost Benefit Analysis \nKnowledge of Commercial Off the Shelf Products (COTS) \nDid User Acceptance Testing (UAT) and Manual testing (Functionality Testing) of UI and Web Applications. \nWorked with the Testing Team in reviewing Test Procedures, Test plans, Test cases for quality assurance. \nTracking defects and interacting with team members in fixing errors. \nExperienced in creating Training Materiel and providing End User Training \nExcellent interpersonal and customer relational Skills. Enthusiastic and a self-starter with a need of minimal inputs.\n\n\n\nEDUCATIONAL DETAILS:\nBachelor’s in engineering and Technology.\n\nTECHNICAL SKILLS:\n\nPROFESSIONAL EXPERIENCE:\n\nCiti Bank, NJ                                                                                                                      Aug 2016 to till date\nBusiness Analyst, Commercial Banking IT\nResponsibilities:\t\n\nIT Business Analyst & QA Analyst for Commercial Banking, dealing with releases involving compliance and regulatory Projects. \nDocumented business requirements and system functional specifications in the form of BRDs and FSDs respectively and created Impact Matrix and Requirements Traceability Matrix. \nInteracted with business users and software development teams as a liaison in helping translate the business Requirements in technical standards ensuring the proposed applications and solutions comply with Business specifications. \nCollaborated with system architects, SMEs, Developers, QA and UAT teams and played a key role in planning, analysis, Design, and development and implementation phases to accomplish timely release objectives. \nInvolved in Build Verification Testing, positive, negative and boundary testing, conducted system testing, and Regression Testing.\nDocumented Daily Defect Status with the help of QA metrics \nReviewed and triaged defects. Bug reporting, Defect tracking and re-testing using ALM. \nWrote SQL queries to test the database and to perform validations. \nTrained new joiners to the team on business functionalities and the processes. Organized daily calls with QA and DEV teams to clarify queries and triage issues during releases. \nProvided production support and clarified business queries for impacts and prioritization of any issues. \nPreparation of induction manuals and application documents. \nWorked closely with business users to develop the test scenarios. \nUAT kick off call and testing sessions with business users. \nWorked with Strategy team to provide feedback on sworn document future state process mapping. \nLogged critical defects and was appreciated by the UAT Program team.\n\n\nChase Bank, Columbus, Ohio                                                                                             Sep 2014 to June 2016\nBusiness Analyst\nResponsibilities:\nFacilitated Scrum planning meetings to coordinate between Clients, Product Owner, Dev and QA teams. \nShadow and assist some of the Product Owner activities by providing high level estimates, prioritizing stories for the sprint and maintaining backlogs and release plans. \nPerformed GAP analysis by communicating with business head regarding the existing system and upgrades required. \nInterfaced with users to gather reporting and business requirements to create user stories, analyzed workflow and created new business processes and used JIRA to document use cases and user stories. \nHelped create sprint backlogs from the product backlog after sprint planning. \nDefined process flows for Lead Management, Application Processing, Underwriting and Closing and funding.\nDefined the various business transactions and business rules dealing with digital payments, online banking, credit and debit cards. \nDeveloped user screens prototype and performed management sign-off. \nCreated business process flows using MS Visio for operations process. \nWorked with the Design and architect team to review and evaluate the Application for credit and debit card holders to view their activity and pay their bills online without any problem. \nUsed UML diagrams to document the deployment scenarios. \nCoordinated with data modeling team in building the new data model, which will serve the better needs for Reports Development. \nOrganized weekly Bug Triage meetings with the Dev team and testing team to clear any pending tickets in regard to Bug fixing. \nDocumented Test Plans that contains Test Scripts, Test Cases, Test Data and expected results for the Unit, Integration, Functional, Performance, and User Acceptance Testing, using Test Manager. \nProactively worked with development and QA teams to fasten the project delivery. \nConducted walkthroughs and documented and involved User Acceptance Test (UAT), provided training to user. \nProvided production support and released software updates. \nDocumented the entire business process, user manuals with screen-shots for hand over. \nProvided on call support to end users for Tier 2 level. \nEscalated technical problem to the Tier 3 level support team and document it. \nTracked the sheet until the problem is solved by the tier 2 team and document it.\nChannelized Service request using Service Now for Tier 1 and 2 Production Support and Maintain release for builds created. \n \nFidelity Investments, Chennai, India                                                                                  Jan 2014 to July 2014\nBusiness analyst\nResponsibilities:\nDocumented and validated the business process flow of Online Securities Trading System to use MS Word \nContinuously engage stake holders on Basel II.5/ III requirements gathering especially on liquidity risk.\nOutstanding expertise and professional experience across credit risk, market risk or liquidity risk.\nInteracted with SMEs in Fixed Income, Bonds and Bond Trading Cycle, Bond Pricing, and Asset Management & used MS Outlook.\nWrote the functional and technical specifications and communicated requirements to development teams. \nFollowed project development lifecycle, responsible for performing gap analysis, prepared the Project Plan according to the project scope, prepared BRD, FSD & used MS word for documentation & made slide to use, MS Power point.\nAnalyzed and investigated business user issues and worked with SME's and Managers to identify related \"defects\" and required \"enhancements\" in the application and captures business requirements.\nCreated and maintained complete development plans that included functional specifications, requirements engineering, Use Case modeling, risk assessment and mitigation, internal and external workflow. \nInvolved in System test in the URL\n\n\nUnion Bank of India, Mumbai                                                                                        Aug 2011 to Dec 2013\nBusiness System / QA Analyst \nResponsibilities: \nSystem study and preparing business requirement documents and followed Agile Methodology. \nDealt with Fixed income, Wealth Management, and Sales & Marketing. \nAs a Technical Business Analyst Conducted requirements gathering sessions with different SOX Compliance Applications Development (AD) Managers, their teams, understand the current provision/authorization process, analyze it and provide the technical solutions to automate their application provision process. \nProvided feasible solutions and proof of concepts (POC) to the business users based on analysis. \nAs a Business Analyst, Analyzed and Prepared Business Requirement Document (BRD), Functional Requirement Documents (FRD), Test Case Document (TCD) and Technical Requirement Documents (TRD) Deriving Implementation solutions. \nServes as a conduit between the Business users/customers (internal and external customers) and the technology teams through which requirements flow. \nAssisted in identifying and quantifying Credit Risk, Operational Risk and Market Risk \nGather all the functional and technical requirements, maintain the info in internal 'Wiki/Confluence' sites. \nCoordinating functional requirements of application to Technical Lead and Team. \nPrepared SQL Stored Procedures APIs, performed debugging and fixed the issues. \nDefine Project Scope, Goals and Deliverables that support business goals in collaboration with senior management and stakeholders. \nPreparing Test Scenarios, Test Cases and Test scripts and performed Functional and Integration Testing Report & Track the issues with Technical Team, Make sure all the issues resolved before moving to Production. \nCoordinated as a Single Point of Contact for business users with regards to essential interactions during design, development and testing phases with offshore/onshore teams. \nUnderstand and analyzed the existing provision process directly which was in Software as a Service (SaaS) and provided the automation solutions. \nAttended weekly Business Analysis (BA's) meetings and provide all the changes/implementations of the application as part of the application release process. \nHad a discussion with Database Teams and convey the Database schema changes. \nTaken Full responsibility of Application Changes (UI/DB/API's) in all the environments (Test, QA and Production), validate it and performed necessary Tests and finally validate the data. \nConducting User Acceptance Test (UAT) with Business, execute test cases and get approval of the UAT. \nDiscussed with Business Users about New Changes or Enhancements of Application and explained them about the technical feasibility of the same and provided the high-level estimation to complete it. \nIdentify and let technical team knows if any issues in application, create issue tickets, track it and make sure all issues get resolved well in time before production move. \nProviding Transition to Support knowledge to support team. \n\nEvoke Technologies, Hyderabad                                                                             December 2009 to July 2011\nBusiness Analyst, Mortgage Banking IT\nResponsibilities: \nIT Business Analyst for Mortgage Banking, dealing with releases involving Regulatory Compliance, RESPA-TILA/TRID.\nDeveloped and managed the formal Software Development Life Cycle (SDLC) Methodology which includes Configuration Management, Requirements Management, UML Analysis and Design. \nWorked under Agile methodology and interacted with business heads to finalize the Business Requirements for the Application. Performed the requirement Ad-Hoc Analysis and documented the requirements. \nClosely interacted with designers and software developers to understand application functionality and navigational flow and keep them updated about Business users' sentiments.\nDeveloped BRD, FRD, Use Case diagrams, business flow diagrams, Activity/State diagrams and Wire Frame Diagrams So that developers and other stakeholders can understand the business process. \nAnalyzed and investigated business user issues and worked with SME's and Managers to identify related \"defects\" and Required \"enhancements\" in the application and captures business requirements. \nPeer review, inspection, and Code Walkthroughs. \nUpdate the business on the progress of the testing effort. \nHandled the Defect tracking calls. \nApplication training and domain knowledge.\nProvided production support and clarified business queries for impacts and prioritization of any issues. \nPreparation of induction manuals and application documents. \nPreparation of test strategy, test requirements, test cases and test procedures based on Functional Requirement.\n\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "confluence",
        "data analysis",
        "jira",
        "project management",
        "scrum",
        "sql"
    ]
}