{
    "id": "resume_e4f5cb00-d225-4680-9da4-f2f979c7d5f3",
    "metadata": {
        "filename": "Balaji Gopalakrishnan Project Manager.docx",
        "processed_date": "2025-09-24T08:45:39.900825+00:00"
    },
    "raw_text": "\n\n\n\n\n\nIT Professional with 15 years of experience in all phases of Software Development Lifecycle (SDLC) including Requirement gathering, Analysis, Design, Development, Testing, Deployment, Delivery and Support. Managed to deliver large-scale Data warehouse software and Web development projects on time and on budget. \nProfessional experience performing as Technical Project Manager, Scrum Master, Architect, Team Lead and Individual contribution roles etc.\n Primary responsibilities Manage including scope, budget, project deliverables, project status reporting, developing project metric reports, implementing technology tools, , the creation of system development process (process engineering and re-engineering) and managing providers and service levels (SLA)\nMonitoring project risks and scope creep to identify potential problems and proactively identifying solutions to address them in advance.  \nExperience in managing the architect application Web based application Asp.Net. Hands on programming experience of Object oriented programming in JAVA, C# and ETL programming.\nHands on experience with relational databases including Oracle, SQL Server, Teradata and MySQL involving stored procedures, triggers, functions, indexes, and packages. \n Good knowledge and handled the project that has TERADATA, Hadoop Map-Reduce job scheduler paradigms, Hive, Pig, Flume, Sqoop, Oozie and NO SQL database like HBase.\nHand on development experience  Business Intelligence Reporting Tool –Teradata, ORACLE, Sybase, SQL –Server, DTS, Crystal Reports, MUMS,,MS-ACCESS, Core JAVA , Hands on experience working other Web based technology like Classic Asp, Asp.net, C#, Net 3.5.\nRisk management and monitor project performance using the Project Dashboard page using CLARITY tool.\nManaging various application as technical project manager for architect \nFacilitated Agile Ceremonies like Daily Stand-up, Sprint Planning, Capacity Planning, Sprint Burn down, Velocity Management, Impediment Management, Demo & Retrospective sessions, Product Backlog prioritization ,Story Pointing , user story gathering & Release Planning\nResponsible for conducting shake holder meetings, Communication , phase end deliverables and getting approvals on them from leadership\nDemonstrated capacity to analyze complex business requirements and translate them into technical specifications, while maintaining a customer focus for outcomes.\n\n\n\n\nExpertise in RALLY & JIRA Tools for Agile methodology & as a bug tracking tool\n\n\n\n\n\n\n\n\n\n\nAmerican Express, Technical Project Manager phoenix AZ, July 2016 – Till date.\t\n\nAs a part of the cornerstone 2015 Audit Map and in pursuit of AEXP's Enterprise Data Production program objective we require all CS legacy platform Use Cases to be migrated to CS 3.0 environment. This Migration to CS 3.0 will not only help us secure enterprise data with enhanced security measure like enabling encryption of data at rest, but also achieve our company vision of one enterprise platform for all data  and application. Our goal is to have end to end migration completed followed by the decommissioning of the legacy platforms.\nPrimary Responsibilities:\nGathering requirement for Document archival and big data archival framework.\nFacilitate Planning/Kick-Off meetings, Retrospectives and Daily Standup \nScheduling and Conducting the Agile Iteration Planning and Retrospective (lesson learned) meetings\nWork directly with Application Owners and Project Managers to prioritize User Stories for each iteration and release\nCalculate development velocity. Work with QA and Demand Management to manage and forecast iteration capacity\nManage all release activities, including code deployment and verification\nCoordination of activities with Release Management to ensure successful delivery of iterations and deployments\nManaged and conducted the Sprint Demos\nResource allocation, monitoring and control Management.\nCoordinate dependencies between teams with other Iteration Managers\nProject planning, execution, monitoring and resource balancing skills with ability to support multiple simultaneous projects in a matrix organizational structure.\nManage risks and issues impacting project deliverables and dependency management coordinated multiple work groups to ensure internal agreement, cost, and delivery capability.\nManage on cost ,budget and generating reports on daily, weekly, monthly and on demand\nImplemented ETL solution with Hive and also written custom UDFs for building marts.\nManage and Implemented Hive tables and HQL Queries for the reports\nManage and Implementing a solution that could map Oracle external table to Hive and at the run time it could provide seamless data for dynamic queries\nIntegrated with Tessaract (OCR) to extract the text information from scanned documents\nData modeling to persist the unstructured data within HBase.\nFacilitating index through Solr with advanced features like Rank and Scoring\nMPP Databases prototype development using Greenplum, Vertica\nTracking of project using PM tool Rally.\n\nEnvironment: Hadoop, HBase, Hive, Tesseract OCR, Solr, Nice, Greenplum, Vertica and Rally \n\n\n\n\n\nHumana, Technical Project Manager SEP 2015 – June 2016\n\nEnterprise Marketing CRM data model to ensure the campaign data mart designs are optimized for marketing campaign execution, reporting, and analysis. Also supporting the EDW is having multiple data mart such as Pharmacy, Clinical, External Pharmacy, Vitality and many more. It is also having different source system. Many OLTP sources loads data Monthly, Weekly and Daily basis from Campaign and Companion Management to EDW and downstream generate reports which use for data mining for better decision making. Campaign and Companion Management support includes application Maintenance, Enhancements and Production support activities\n \nPrimary Responsibilities:\nConducting reviews with subject matter experts on the various deliverables for each phase of the project to ensure the quality deliverables for the project.\nPrepare project plan and participate in product development life cycle. Prepare and present status reports to Shake holders\nMonitoring project risks and scope creep to identify potential problems and proactively identifying solutions to address them in advance.  \nWorking onsite-offshore model of project delivery using Water fall and Agile methodologies and there is a procedural communication model that is being followed to fulfil the project needs.\t\nTechnical management of projects that develop programs that can ingest this real-time data into Enterprise Data warehouse running on like Oracle and/or Netezza\nResponsible for SLA & Penalties management, Incident, SR, Release and CR management.\nManage and control timelines through tracking of project tool Rally.\nExtensive SQL and PL/SQL Procedures, Functions in to Hive and Pig flow respectively.\nProvided technical expertise to handle non equi-join issue and provided work around to resolve the problem.\nSuggested and have implemented incremental updates and deletes using a strategic implementation\nInvolved in creating Hive tables, loading with data and writing hive queries which will run internally in map reduce way. \nCreating business use case ,charters ad reports using rally and incident management tool\n\nEnvironment: Hadoop, Hive, Pig, Sqoop, Oracle ,Rally, Campaign and Companion Management tool.\n\n\n\n\n\n\n\n\n\nIntegrated Data Network - American Express – Technical project Manager, Nov 2012 – AUG 2015\n \nPrimary Responsibilities:\n\nPlan, execute, and finalize projects within triple constraints of delivering on time, within budget and scope objectives\nDesigning documentation deliverables including: process models, process decomposition diagrams, network architecture diagrams, data models, data flow diagrams, entity-relationship diagrams (ERD)\nIdentify, effectively communicate, and resolve project issues and risks.\nEffectively communicate project status to project stakeholders. Coach, mentor, and motivate team members, influencing them to take positive action and accountability for assigned work.\nDay to day follow up with the Client managers to suggest the improvements in existing process of obtaining requirements. To gather requirements and do the scoping.\nManage and assist the offshore team in the creation of design, development and testing, mitigate technical risks, if any and provide quality and timely deliverables.\nResource allocation, monitoring and control Management.\nEnd to End AMEX project Management using clarity\nEnsure internal agreement, cost, and delivery capability.\nWorked in IDN Data Warehouse Transformation for complete uplifting of our existing system and platform to Teradata. \nManage on SIT, UAT, GO & NO GO decision and Warranty support.\nWorked with  IDN Delivery of  Sybase to Teradata , Teradata to Sybase data migration process developed as part of the IDN Transformation\nManaged  on the project Contact BI ETL deliverables on –Analyzing, optimizing table and query to have for  minimum response time in dimension fact load from Sybase to Teradata transformation using  star schema or snowflake schema that allow for flexibility while improving performance (views, join indexes,  functions,  stored procedures, global volatile temporary aggregate tables, reporting ) on Teradata and Cassandra etc.\nPerformed the data analysis and mapping; database normalization and clean-up; data extraction, transfer, and loading (ETL). \nMQ payload modeling and channelizing it to HDFS. \nDesigned and Implemented XML parser (Record Reader) to parse XML string in Hadoop.\nProposed and Implemented Reconciliation logic to match the transactions and to get tagged with ECR\nEnvironment: Hadoop, Hive, Cassandra, MongoDB, Oracle, SQL, Pig, Sqoop and Teradata, Sybase Flume, Kafka, Pig, Oozie, Java, and Clarity for project management.\n\n\n\n\n\n\n\n\n\n\n\nAustralia and Newlands Banking, Lead Designer(Manager Group),Dec 2010 –  Jan 2012\n\nPrimary Responsibilities:\nManage multiple projects under single program umbrella specifically in the area of Offshore-Onsite model.\nProgram / project schedule, cost and resource management\nWork with multiple project team and managed the program\nStatus reporting to the senior management\nHeld Teradata Database Designer role on this project.\nDeveloped/modified, tested and performance-tuned data manipulation procedures for the warehouse: store-day combination data deletion procedure (for unload of erroneous data), aggregation calculation procedures and others.\nTemplates for the other developers to follow.\nFast – ESP integration with existing application.\nParticipated in architectural decisions regarding the newly built system\nManaged the program in a smoother way with multiple acquisitions happened at the customer side\nKey Person for achieving rapid growth in revenue and team size of the engagement\nProject planning, execution, monitoring and resource balancing skills with ability to support multiple simultaneous projects in a matrix organizational structure.\nExperienced in coordinating, negotiating and motivating outside vendors and off-shore resources in support of time line and IT project deliverables\nWorking closely with Microsoft to Integrate the ANZ application and the Search engine FAST ESP. \nEnvironment: FAST ESP ,TeraData and Sql server.\nCareVoyant Technologies Private Ltd  -  Technical Project Lead  April 2010 – Dec 2010\nPrimary Responsibilities:\nBasic functional design. Created UML diagrams using Microsoft Visio.\nConstructed Class Libraries containing code for business and data access in the form of ASP.NET pages.\n The logic was implemented using C#.NET and ADO.NET.\nUsed ADO.NET Dataset Object to access the databases and gather all relevant information to be stored. \nDeveloped stored procedures to carry out all the Data Manipulation operations on the Database.\nCreated ASP .Net pages and Class Libraries containing code for business and data access logic using C#.\nNegotiated by study delivery managers, with contract award contingent upon project manager assignment. \nDemonstrated outstanding leadership and superb project management skills, consistently scoring 90% or Greater on Customer Satisfaction surveys distributed to study delivery managers during project initiation, Monitoring, and closeout phases.\n\n\n\nDeemsys inc,USA First Data corporation, Drugstore.com, Dimentiondata, Technical Project Manager/Lead    June 2007 – March 2010\n\nPrimary Responsibilities:\n\nReviewing and assessing existing data processing methods and techniques\nRationalizing existing systems and procedures to correct deficiencies and maintain more effective data handling, conversion, input/output requirements, and storage\nDesigning documentation deliverables including: process models, process decomposition diagrams, network architecture diagrams, data models, data flow diagrams, entity-relationship diagrams (ERD)\nModeling processes, work-flows, and structures\nInvolved in Design, Construction and testing of applications such as  Portfolio tracker\nCreated ASP.NET web pages that provide new features such as Smart Navigation.\nExtensively used ASP.NET to develop front end screens making use of\nServer and User Controls.\nWorking with SSIS and SSRS for Reports.\nWas involved in Status reporting to the senior management.\nASP.NET validation controls such as RegularExpressionValidator and CustomValidator to validateand information provided by the users. \nDesigned the web forms in ASP.NET and code logic in C# to effectively mirror the business processes.\nEnvironment: C# ,ASP.net , MVP ,MVC ,SSIS,SSRS  and VB.Net\n\nCapgemini Consultant     Lucent  Technologies,Technical Project Lead, Feb 2006-April 2007\n \nPrimary Responsibilities:\nInvolved in Analysis and design of the required projects. \nPlayed the role of the team member \nEnvironment :  VB / ASP.net /SQL Server/DTS/SSIS.\t\t\n\nCovansys India PvtLtd..\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\nHofinSoft Technologies Private Limited\t\t\t\t\n\n\n\n\n\n\n\nMaster of Computer Application, Annamalai University, 2005\nPost Graduate Diploma in Computer Application, Annamalai University,  2003\nBachelor of Commerce, University of Madras, 1996\n\n\nGender\t\t\tMale\nNationality\t\tIndian\nAddress\t\t\t16641 N 56 St , APT  1067, Scottsdale ,AZ -85254 \nPersonal e-mail ID\temailbalajig@gmail.com\nContact No         \t781 600 2755\n\n",
    "extracted_skills": [
        "agile",
        "asp.net",
        "cassandra",
        "communication",
        "data analysis",
        "go",
        "hadoop",
        "java",
        "jira",
        "leadership",
        "mongodb",
        "mysql",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}