{
    "id": "resume_255c57b1-5e8c-4f53-a36b-da40a0900c0a",
    "metadata": {
        "filename": "Bharatha BA Resume.docx",
        "processed_date": "2025-09-24T08:45:40.116407+00:00"
    },
    "raw_text": "PROFESSIONAL SUMMARY:\n\n7 years of experience as a Business Analyst working across various domains like Finance and IT.\nExtensive experience in business analysis, business processes, business process flows, gathering requirements, development and enhancement of healthcare and finance applications.\nExpertise in conducting Joint Application Development (JAD), Brainstorming Sessions, project meetings, reviews and walkthroughs acting as a liaison between application vendors, technical, managerial teams at various levels. \nHands on experience working on SDLC methodologies such as Waterfall, Agile (SCRUM) and RUP (Rational Unified Process) in Application development.\nProficient in creating UML Diagrams and Data Analysis by writing Complex SQL Queries on various databases such as Oracle, MS SQL servers, and Ms Access.  \nExtensive experience of documenting system blueprints, business process workflows, used cases using MS Visio and Rational Rose. \nExcellent Documentation skills to generate Business Requirement Document (BRD), Functional Specification Document (FSD), and Risk Analysis.\nExpertise in delivering Time-Sensitive information ensuring the scope & requirements of the project and tracing the deliverables from initiation to implementation via Requirement Traceability Matrix (RTM). \nExperience in performing GAP Analysis, identifying the variances between ‘as-Is’ and ‘To-Be’ business process. Performed incremental improvements to the ‘To-Be’ process by employing Business refinement procedures. \nExperience in developing various screen mockups and wireframes using Ms Visio and Dreamweaver. \nExperience in creating Test-Cases, Test-Plans, and have hands-on experience on different QA Testing Methods including Data Testing, Integration Testing, Functional Testing, System Testing, GUI Testing, and UAT.\nExperience in managing testing life cycle – Prioritizing Defects and resolving Critical Issues, reporting, maintaining the issue log.  \nStrong Technical background, Analytical and Problem Solving skills, Multi-Tasking abilities, with proven experience in utilizing people and process knowledge to assist enterprises in making critical decisions.\nTechnical Competencies/ Working Knowledge:\n\n\n\nWORK EXPERIENCE: \n\nWells Fargo Bank. \t\t\t\t\t\t\t\t\tCharlotte, NC\nBusiness Analyst - Finance\t\t\t\t\t\t\t(May 2017 – Present)\n\nThe project I was involved in built data driven strategies to support business operations. The goals were to produce models, create forecasts reports, and predict trends to assist senior management for more effective decision making on consumer loan products. Often leads responsibilities related to capturing action items and tracking milestones in term project environments.\n\nRoles and Responsibilities as Business Analyst:\n\nActively involved in conduction reviews, walkthroughs and facilitating in requirement definition workshops (JAD) to get consensus on business requirements for the project.\nAnalyzed and assessed client requests to create professional, presentation quality deliverables in the form of dashboards & reports to provide additional insight to any critical indicators.\nModels using Developed UML MS Visio.\nPresented the business process workflows to business stakeholders\nTasked with coordination, tracking and updating project issues risks and change controls that impacted the business unit.\nRun Ad-hoc reports for management, as well writing SQL queries on MS SQL server R2 and upload reports on SharePoint Site.\nDocumented API, XML and BATCH file transfer process requirements to maintain information.\nAssisted QC term to ensure requirements are translated into executable Test Plans and strategies.\nAlignment of scope, process, skill set and KPI with market expectations.\nDevelopment of account data (Financial/metrics) benchmark tools.\n\nThe Vanguard Group. \t\t\t\t\t\t\t Wayne, PA\nSenior Business Analyst\t\t\t\t\t\t\t\t\t(July 2016 – April 2017)\n\nAs a part of this project, provided support Investment Management Group and their organizational objectives and imperatives by effectively participating in defining their future state business technology solutions via leading business projects that have people, process and technology implications.\n\nRoles and Responsibilities as Business Analyst:\n\n Identified, contributed and lead business process models, process flows and service/operating models. Identified challenges in current state business processes and provided input into potential future state solutions.\nCaptured, documented, and validated business requirements for business and technology initiatives.\nUnderstood industry best practices and brought them to Vanguard’s investment processes and technology.\nLead prioritization and execution of technology enhancements and maintenance activities with business and IT project managers.\nPartnered with product managers and project managers to plan, schedule and coordinate business activities and deliver business technology projects. Facilitated meetings and presentations with project clients, management team, and/or department, as needed.\nPartnered with project manager to define, plan, coordinate, and implement project plans for larger technology initiatives.\nReviewed and inspected business test strategies and plans to ensure quality and coverage. Served as liaison between business and IT to validate test results and addressed communication and prioritization of test issues.\nIdentified business production post-certification test scenarios and assist with production verification.\nLead change management and training activities via developing training documentation and executed user training.\nLead in post implementation reviews as required. Lead post project production support and ensured issue resolution.\nParticipated in special projects and performed other duties as assigned.\n\nSelux corporation. \t\t\t\t\t\t\t\t\tHighland, NY\nBusiness Analyst\t\t\t\t\t\t\t\t\t(July 2015 – June 2016)\n\nAs part of this project, worked directly with the Project Manager, Configuration Specialist, Development, and the customer to gather and document all business and technical requirements.  Direct-to-consumer and business-to-business pricing strategies including the impact of gross margin of volume/Price/cost variables.\n\nRoles and Responsibilities as Business Analyst:\n\nGathered requirements and prepared business requirement documents (BRD).\nTranslated BRD into functional specifications and test plans. Closely coordinated with both business users and developers for arriving at a mutually acceptable solution.\nConducted JAD sessions to define the project and to reduce the time frame required to complete deliverables.\nPerformed requirement analysis including data analysis, risk analysis, impact analysis and gap analysis.\nInteracted with customers to develop an existing product.\nDeveloped and maintained all operational and technical flows using Visio and Power point.\nUsed MS Office Suite for creating use cases, workflows and sequence. Diagrams according to UML methodology thus defining the Data Process Models.\nDefined Use cases from requirements and helped convert them into software specifications.\nAided in workflow analysis and process design.\nAnalyzed business requirements from Black Box Testing perspective, business process and system architecture/design.\nMaintained Requirement Traceability Matrix (RTM) and requirement documents using Rational DOORS.\nPerformed Regression Testing and created test scenarios for User Acceptance Testing (UAT).\nMaintained the requirement documents and other project related documents using MS SharePoint.\nMaintained documents for change requests and implemented procedures for testing changes.\n\nAccenture Services Pvt. Ltd. \t\t\t\t\t\tBangalore, India\nBusiness Analyst – Finance\t\t\t\t\t                      (April 2010 – Mar 2012)\t\n\nRoles and Responsibilities as Business Analyst:\n\nAnalyzed clients systems and business processes\nSuccessfully implemented modules (Customer file, Accounting, Additional agreements for accounts, Deposits, Overdrafts, Values management, Reports and print forms, User rights) of Temenos T24 banking solution system for business banking.\nLed a distributed team of 3 analysts and 5 developers during Temenos T24 implementation project.\nActing as team leader, evaluated priorities of requirements, risks and associated costs, coordinated process of development and testing with stakeholders.\nHandled large amounts of data and built a tool to streamline the process of giving and changing user rights in Temenos T24 system.\nDesigned, agreed and executed User Acceptance Testing (UAT) for customized modules.\nSupported the integration and migration terms during data mapping and roll-out stage for 1 branch.\nWorked as a member of L2/L3 support teams for enhancement activities and incident management for 7 branches.\nEstablished a Business Analysis methodology around the Rational Unified Process.\nResearched the various steps in the lifecycle and then constructed the system in a way that the high risk customers would be easily identified and monitored.\nStreamlined clerical work processes and mapped then into the new system.\nDeveloped project plans and managed project scope.\nAssisted in building a Business Analysis Process Model using Rational Rose and Visio.\nPerformed extensive Requirement analysis and developed use cases and workflows.\nDeveloped requirement reports for day to day servicing needs using Rational SODA.\nDesigned and developed Use Cases, Activity Diagrams and Sequence Diagrams.\nPlayed a key role in the planning, User Accepted Testing, and Implementation of system enhancements and conversions\n\nMicro Village Communications. \t\t\t\t\tBangalore, India\nJunior Business Analyst\t\t\t\t\t\t\t\t(Sep 2008– Mar 2010)\n\nRoles and Responsibilities as Business Analyst:\n\nAnalyzed operating results, explanation of variances, trend and year to date reporting.\nPrepared revenue accrual and reversing general ledger journal entries.\nPrepared and managed annual budget, quarterly outlooks and monthly ad-hoc financial reporting.\nAnalyzed operating results, explanation of variances, trend and year to date reporting.\nPrepared revenue accrual and reversing general ledger journal entries.\nConducted walkthroughs with the different department heads to have a deeper understanding of the requirements.\nAnalyzed and documented the business requirements and generated reports for the Manager.\nCreated the software development plan.\nDeveloped flow diagrams for Business process of the company using.\nUse Case Modeling using Rational Rose for preparing Functional Requirements documents\nFunctioned as the primary liaison between the business, operations, and technical groups throughout the project cycle.\n\nEDUCATION\nMaster of Science: Finance\t\t\t\t\t\t\t\t           \tMay 2015\nManhattan Ville College - Purchase, NY\n\nMaster of Business Administration\t\t\t\t\t\t           \t\tJuly 2008\nJawaharlal Nehru Technological University - Hyderabad, India\n\nBachelor of Commerce\t\t\t\t\t\t\t\t             \t  \tApril 2005\nSri Krishnadevaraya University - Anantapur, India\n\n\n\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "data analysis",
        "oracle",
        "problem solving",
        "scrum",
        "sql"
    ]
}