{
    "id": "resume_bf0a0220-a911-4b25-ac35-a95fde319be2",
    "metadata": {
        "filename": "Brahma-Resume (BA).docx",
        "processed_date": "2025-09-24T08:45:40.165688+00:00"
    },
    "raw_text": "RESUME\n\n                                                                 Name: Brahma Prathi\n                    Ph No: 916-282-9259\nEmail ID: sam@vishconsultingservices.com\n\nBusiness System Analyst\n\nSummary: 8+ years of experience, discipline and highly-motivated Business System Analyst, Data analyst and Quality Analyst with healthcare domain who has worked on a wide range of projects.  An accomplished and fluent communicator with strong investigation, problem-solving and decision-making skills, combined with a pragmatic approach and sound business acumen. Highly accomplished in fields such as IT knowledge specific to Healthcare and have complete knowledge of all phases of the software development life cycle (SDLC) gained over working on various projects for different clients. I prepare, analyze, and gather business requirements, business processes, mapping and the development of interactive prototypes.\nProfessional Skills:\nStrong knowledge of HIPAA standards 4010 & 5010, ICD-9, ICD-10, EDI, HL7, HIX (Health Insurance Exchange), Health Care Reform.\nDevelop different EDI healthcare transactions like 837 for submitting claims, 835 for payments, 834 for benefit enrollment, 270,271 for health care benefits and eligibility, 276, 277 for claims status and 278 for transmitting health care service information.\nProficiency in the child welfare and case management business area, policies and domain knowledge in child welfare programs\nExperienced on Claims, Payments, Medicaid, Medicare, Provider, Portal, Billing, and Benefits.\nExtensive experience in performing GAP analysis, SWOT analysis, Cost benefit analysis, Risk analysis.\nHands on experience in analyzing and documenting Business Requirements Documents (BRD), Functional Requirements Documents, Use Cases and Requirements Traceability Matrix (RTM).\nBroad knowledge on Waterfall, RUP and Agile methodologies.\nIncomparable analytical skills in understanding the business process, understanding the functional requirements and translating them to system requirement specifications (SRS).\nInformation and understanding in conducting Joint Application Development (JAD) and Rapid Application Development (RAD) sessions. Conducted Requirement Gathering Sessions and interviewed Subject Matter Experts, gathered detailed functionality aspects of business process and updated the information to the requirements in an easily comprehensible format.\nBroad experience in creating business process flow diagrams, UML (Unified Modeling Language) tools to create Activity, Sequence and Collaboration diagrams.\nRobust experience in writing SQL queries for Data Analysis and QA report testing.\nBusiness Analysis, Supporting Strategy management, Client relations, Business modeling, CRM & Workflow, Test planning MS Office, MS Project, MS Visio, MS Excel.\nDevelop workflows that demonstrate current and proposed business requirements.\nKnowledge and expertise in system design and development required for business process.\nAptitude to construct process models including data dictionaries and volume estimates.\nExperienced in creating Data models, Data designs, data Integration and writing complex SQL queries.\nUnderstanding service objectives and capturing business requirements through active listening & questioning techniques.\nKeeping abreast of new legislation, company strategy and policy and being able to identify its impact on business projects.\nExperience in creating User Manuals and providing training to users.\nInventive and Aggressive person capable of forming and maintaining positive and productive team environments with integrative thinking skills.\nExceptional Problem Solving and Sound Decision Making capabilities, along with the ability to resolve difficult situations.\nCapable to prepare written proposals, requirements specifications, invitations to tender and solution specifications.\nAble to identify business & systems process improvements from Big Picture to detail level.\n\nCERTIFICATION AND TECHNICAL SKILLS\n\nLanguages:\t\n                                  SQL, PL\\SQL, HiveQL, SAS, R, XML, Java, Python, .Net\nTools & Environments: \n                                        MS Office, MS Visio, SQL Server SSIS, SSRS, Oracle Developer, Tableau, QlikView, Power BI, SAS EM, ERwin Data Modeler, WebI, SAP Business objects, UDT, Excel, Rational Rose, MS Visio, Visual Paradigm, JIRA, Confluence, MS Visual Studio\nCertifications:       \n                                        SAS Certified Data Mining and Business Intelligence professional, Google Analytics and AdWords Certified Professional, Certified Microsoft Technology Associate (MTA) in .NET, Advance communicator Silver and Advance Leader Bronze by Toastmasters International\n\nWork Experience:\nDST Health Solutions, Birmingham, AL\t\t                                                    July 2016 -Present\nSr. Business System Analyst\n\nProject Description: The project was on create claim management system which has benefit module for all Medicare part D and Medicaid expansion plans for states. The project was also utilizing analytics for optimization of processes and benefits.\n\nResponsibilities: \nGathered requirement through workshops and JAD sessions. \nDeveloped documents like BRD, FRD, Data specification document, technical specification documents, file transfer document, Data mapping document etc.\nParticipated in analysis workshops for ICD 9 Procedure and Diagnosis Codes in accordance with ICD 10 CM and ICD 10 PCS Conversion Compliances.\nDeveloped Use case diagrams, activity diagram and system design diagrams.\nValidated CPT, HCPC, ICD  9 code sets from Data Flat files to support configured benefit plan building.\nManaged global administration and support of the Documented based Regulatory Electronic Document Information System (EDMS).\nFacilitated Electronic Data Interchange (EDI) and storage in the ICD-10. \nWorked on HIPAA Transaction Sets 837P and 837I Standards as per the test scenarios.\nCreated Test Conditions from business requirement document and functional requirement document.\nProcessed Medicaid claims and worked on X12 format of EDI 837 and EDI 835 for Medicaid claims.\nAccessed Diagnosis Master File and Crosswalk Mapping file to use ICD Diagnosis and Surgical Procedure Codes.\nPerformed GAP Analysis to make sure that all requirements were covered by test cases.\nPrepared and submitted weekly test status reports to QA Lead.\nDeveloped SQL scripts for mining medical claim cases which helped in making faster decisions for over 400 healthcare-835, EDI cases\nConducted JAD sessions with the stakeholders to solve Amisys Advance claims and presented solutions using structured SDLC approach\nDesigned data flow and mined data for HIPAA/ICD/EDI claim analysis that helped expedite the process of Medicaid claim processing\nPerformed GAP and risk analysis on workflow and business rule models to create project specific action plans for HIPAA implementation\nCreated PL/SQL procedures and performed data stage transformations, benefiting data flow of over 2000 claims and 5 functional areas\nCollected data from EDI, HIPAA, 837,835 CRM transactions which helped in smooth functioning of Medicare and Medicaid entities\nWorked on EDI 834 to validate new enrollment and dismiss the enrollment.\nAccepted and validated messages in EDI 999 form like accepted, rejected, and accepted with error.\nCoordinated System and Regression testing schedules and completed the same. \nEnsured the functionality meets business requirements as defined in test results logged in RQM.\nDeveloped Test Cases to test the functionality of the system based on the test conditions.\nExtensively used Rational Quality Manager to monitor the progress of assignment of testing activities and Reported executed results.\nLogged the defects in Clear Quest tool, assigned the right severity level and managed the defects through it.\nAnalyzed several defects related to Edits & Audits functional area along with the help of a SME.\nConducted KT sessions for Member, Provider and Service Authorization.\nEnvironment: MS Office, MS Visio, Rational ClearQuest, Windows 7, Citrix, PLSQL, JIRA, CRM, Oracle10g\n\nTexas State DHHS, Austin, TX                                                                                       Jan 2013 to June2016\nSr. Business System Analyst/Data Analyst\n\nProject Description: The project was about to implemented new business processes in MMIS and integrates MMIS with Integrated Eligibility System.\n\nResponsibilities:\nConducted user interviews, gathered requirements, analyzed and documented business requirements in BRD \nBalanced competing project constraints such as scope, quality, schedule, budget, resources, and risks.\nInvolved in Release, sprint planning and making work ready for releases and sprints.\nCreated strategy for risk detection, risk management, Risk Mitigation and dependencies.\nPerformed user storytelling and grooming using CA Rally.\nWorked with contract manager to develop and modify project plans on routine basis and jointly provided weekly high-level briefings on status of individual projects to senior State IT management and to review IV&V outcomes on a periodic basis.\nConducted JAD sessions between multiple cross functional team to resolve problem and requirements pass on.\nCreated process flow of case management for healthcare Assistance Eligible member in IBM Curam.\nCreated process flow of case management for TANF  Eligible member\nCurrent areas of focus include IV&V initiatives, program support initiatives, and human services cost allocation.\nMaintained all professional documents on SharePoint.\nResponsible for maintaining share-point directories and document template for my project using share-point.\nWorked on Medicaid Managed care programs, encounter claims and Medicaid eligibility program.\nGathered and managed XML elements for portals.\nDeveloped Technical Design Document and helped Architect in developing System architecture document.\nFiltered applicant using different business cases to create a separate flow to route them for better case management services.\nDeveloped functional specifications and system design specifications consistent with findings of Independent Validation and Verification (IV&V) audit based on knowledge of existing system specifications.\nCreated Swim lane diagram, process flow diagram, Activity diagrams, use cases diagram using MS Visio.\nWorked on HIPAA EDI 837, EDI 835, CPT and ICD10 codes and state eligibility policies.\nWorked on creating project end to end process flow using BPMN 2.0 in JBPM tool and Visio.\nPrioritize user stories for each release and sprint as product owner.\nAssign task to other BA and estimated their work effort.\nAs a part of IV&V team, conducted assessment to cooperatively facilitate evaluation of the sub-components and services necessary for a complete solution to meet business.\nTrained other Team members so they can perform in expected format.\nResearch to gather business requirements from valid sources by myself and convert them in Business, functional and non functional requirements.\nSupported in architecture, High level UML diagrams and prototype of proposed solution.\nTest rules service requests and response using REST and SOAP.\nCreated HL Design and low level design Medicaid eligibility.\n\nEnvironment: MS Office, Quality Center, SQL Server, Facets, MS Project, Server, MS Visio, Unix, SQL, HTML, Java, XML, Rational ClearQuest, Windows 7, AWS, MMIS.\n\nAmerican Family Insurance, Madison, WI\t\t\t\t\t\t     Jan 2012 to Jan 2013\nSr. Business System Analyst\nProject Description: To create a web based application which would automate the claims process and reduce costs. Application was an Electronics Claims Processing (ECP) system designed to accept the electronic claims coming from the various providers (doctors and hospitals) and process them. The project involved HIPAA 4010 to HIPAA5010 conversion.\n\nResponsibilities:\nImplemented RUP methodology for iterative and incremental development of the system.\nInvolved in the creation of the Mockups and Use Cases for MACD quotes and Orders using MS Visio.\nCoordinated with the stakeholders and project key personnel to gather functional and non-functional requirements during JAD sessions.\nRecorded requirements in the Requirement Traceability Matrix (RTM) defining each technical requirement in detail from areas like: main hardware, application software, networks, servers, internet and desktop configuration.\nPlanned RUP iterations and documented the artifacts throughout the various phases of the development process.\nPropose strategies to implement HIPAA 4010 to HIPAA 5010 changes in the System.\nDeveloped an implementation guide for Partners for HIPAA 5010EDI X12 transactions such as 837 (medical claims), 835 (medical claim payments), 270 (eligibility inquiry), 271 (eligibility response), 276 (claim status), 277 (claim status response), 820 (enrollment), and 834 (premium payments).\nStudied the existing business process and created AS-IS workflow to illustrate the existing system.\nPrepared Logical Process and Data Models that contained set of diagrams and supporting documents containing the essential business elements, detailed definitions, and descriptions of the relationships between the data elements to analyze and document Business Data Requirements. \nCompiled the Vision Document and composed detailed Specification Documents in Rational RequisitePro.\nCreated UML class diagrams, use case diagrams and sequence diagrams to view the system from different perspectives. \nIncorporated stakeholder feedback throughout project lifecycle to ensure project quality and customer satisfaction.  \nCreated Technical documentation for the project using tools like Visio, Word, etc. \nUsed MS Project for managing schedules, resources and collaboration.\nProduced complete data mappings and data conversion documents needed for the Claims application.\nPerformed Functional and GUI Testing to ensure that the user acceptance criteria are met.\nCo-coordinated the UAT with the SME’s to make sure that all the Business Requirements are addressed in the application.\nFormed detailed UAT and QA test plans, managed system testing and preserving testing documentation.\nEnvironment: MS Office, MS Project, MS Visio, SQL, Oracle, Test Director, Rational Unified Process (RUP), Rational Suite (RequisitePro, ClearQuest),Business Objects, Windows XP.\n\nApollo Hospital, Delhi, India \t\t\t\t\t\t                        Jan 2009 to Dec 2011\nBusiness Analyst\n\nProject Description: To develop Customer Billing and Management System\n\nResponsibilities:\nWriting requirement specifications and functional specifications participation in requirement session with clients and communicate to stakeholders assisted with Sr. Manager\nPerform User Acceptance Testing of developed software of Revenue Cycle Management. \nIdentify source of requirements and develop priority matrix.\nGather requirements, Elicitation & write functional design specification with minimal supervision.\nWork with both internal and external stakeholders across locations.\nInterviews, surveys and analysis of historical data. Organize brainstorming, facts-finding and structured walk through sessions.\nModeled data into RDMS structure that helped in reporting and maintaining over 200 vendor and client data using Oracle\nEnhanced security of consumer data by re-engineering the data warehouse model to include customer specific parameters\nManaged billing systems and collaborated with customer service teams which led to 6% increase in positive customer feedback\nResearch problems and share results and understanding with the test team with domain and functional knowledge\nTest the application and Interact and liaise with the technology team to resolve functional & technical queries as a good skilled problem solver\nServe as a conduit for effective communication between team members in India and team members in North America, Works well with all levels of staff with strong presentation skills\nReview user documentation of projects and participate in test plan development with exceptional organizational skills\nEnvironment: Agile,MS Visio, SQL Server, MS Office Suite, HP Quality Center\n\t\n",
    "extracted_skills": [
        "agile",
        "aws",
        "collaboration",
        "communication",
        "confluence",
        "data analysis",
        "html",
        "java",
        "jira",
        "oracle",
        "power bi",
        "problem solving",
        "python",
        "r",
        "sql",
        "tableau"
    ]
}