{
    "id": "resume_a0cf535d-e4ee-4576-bba3-0b7d6e3018e3",
    "metadata": {
        "filename": "CHETAN_Sr Java Developer.docx",
        "processed_date": "2025-09-24T08:45:40.463133+00:00"
    },
    "raw_text": "                                                                                      CHETAN BABU \nMobile: 405-896-0512\nEmail: booram.chai@gmail.com\n\nProfessional Summary:\nJava Developer with around 8 years of professional experience in analysis, design, development and testing of web and distributed multi-tier applications using Java and J2EE technologies.  \nWell versed with complete Software Life Cycle Development (SDLC) process which includes Analysis, Designing, Developing, Testing, Implementing and Documenting the entire life cycle using various methodologies like Waterfall, Agile, Scrum, Test Driven development.\nExpertise in using HTML, DHTML, CSS, Java Script and XML in designing web pages.\nExtensive experience in AngularJS for application implementation, proficient in creating modules, controllers, services and AJAX calls.\nTest-driven development-TDD with JUNIT. Proficient in integration testing of web applications and remote systems.\nCreated continuous delivery pipeline for CDT Directory to run the war, Ami and deploy jobs in Jenkins brew master instance, which reduces the time for the deployment of Microservices.\nExpertise in developing data models using Hibernate Object relational mapping (ORM) frame work and used Hibernate Annotations to reduce time at the configuration level.\nExperienced in implementation of Web services based on Service Oriented Architecture (SOA) using SOAP, JAX-WS, WSDL using Apache AXIS and Cloud technologies like Amazon Web Services (AWS).\nExperience in applying best-practice design patterns and strategies to enterprise applications to reduce tight coupling, maximize performance, and reduce maintenance/extensibility risks.\nImplemented microservices using Spring Boot, spring based microservices, and enabled discovery using eureka server.\nExperience in working with various Web and Application servers including Apache Tomcat, IBM Web Sphere, JBoss and Web logic.\nKnowledge on different databases like Oracle, My SQL, Ms-Access, SQL Servers and writing PL/SQL packages, procedures, Functions, triggers using SQL Plus.\nWorked on various operating systems like Solaris, Linux. \nKnowledge in migration of systems, upgraded many projects to higher java versions as well as migrating applications from application servers.\nCreation and managing Data Source, Database Connection Pools, Virtual Hosts, etc.\nFollow product architecture guidelines to deliver best product performance and maintainability.\nCode review and suggest improvements for better performance and standard coding practice.\nInvolved in the development of software architecture documentation like Technical Design Document.\nDesigned Architectural diagrams based up on the client requirements for their application hosting in the AWS Cloud Environments.\nParticipated in research of new technologies or tools as necessary to enhance or develop products.\n\nTechnical Skills:\n\nPROFESSIONAL EXPERIENCE\nClient:  AmerisourceBergen, Chesterbrook, PA    \t                                                                                   Mar 2017 – Present\n Sr. Java/UI Developer\n\nResponsibilities:\nInvolved in Requirements gathering, Analysis, Design, Development and Testing of application using AGILE methodology (SCRUM).\nUsed spring framework's JMS support for writing to JMS Queue, Hibernate Dao Support for interfacing with the database and integrated spring with JSF.\nImplemented JMS listeners to connect to the Tibco JMS queues using ActiveMQ for producing and consuming JMS messages. \nDesigned the frontend using HTML, CSS, Bootstrap, Java script, and Ajax controls.\nDeveloped GUI based application with Java Applets, Awt, Swing and JavaFX.\nSuccessfully implemented Auto Complete/Auto Suggest functionality using AJAX, JQuery, DHTML, Web Service call and JSON.  \nDeveloped a fully functional prototype application using JavaScript (JQuery, Ext.js, Node.js and Backbone JS) and Bootstrap, connecting to a Restful server on a different domain.\nUsed Spring ORM Support for Hibernate to manage efficiently Hibernate Resources and consistent exception Hierarchy.\nWrote AngularJS controllers, views and services and validating forms using AngularJS.\nCreated Real-time Reporting systems and dashboards using Adobe Flex, xml, MySQL.\nWorked on mapping the database schema, writing Hibernate classes, gathering business requirements to build the page logic, and implementing to match the mock-up. Maintained and updated the Jasper reports.\nDesigned and developed Micro services business components using Spring Boot.  Consumed REST based Micro services with Rest template based on RESTful APIs.\nExperience in Spring Cache and other new Spring features into the system by configuring Spring Annotation in Spring MVC and back-end services.\nImplemented Authentication and Authorization using Spring Security.\nDeveloped PL/SQL triggers and master tables for automatic creation of primary keys.\nCreated PL/SQL stored procedures, function sand packages for moving the data from staging area to data mart.\nImplemented Single sign-on(SSO) functionality.\nCustomized Jasper Reports and SQL procedures according to the client requirements.\nInvolved in Design, development and testing of web application and integration using Object Oriented technologies such as Core Java, J2EE, Struts, JSP, JDBC, Spring Framework, Hibernate, Java Beans, Web Services (REST/SOAP), XML, XSLT, XSL and Ant.\nBuild the Security infrastructure for WMQ using OAM and Tuned up the performance of the MQ and the applications.\nDeployed bundles which is an OSGI environment, and modified feature files for deployment and Managed dependencies in Maven in Eclipse.\nUsed GIT as a version-controlling tool for managing the module developments.\nInvolved in creating unit testing of various layers using Junit, JMock.\nFollowed Agile Scrum methodology that included iterative application development, weekly Sprints and stand up meetings.  \nUsed Multithreading and Collections Framework including List, Map etc.\nUsed Spring-JDBC configuration to manage some transactions across multiple databases. \nUsed agile tools like Rally and JIRA for project management and tracking.\nUsed Log4J to trace the flow of the application\nUsed Maven and Jenkins for building the applications EAR for various environments. \nEnvironment: JDK 7, Spring-JDBC, spring-ws-core, SWING, AWT, and Wsdl4j 1.6.1, SOAP, JMS 1.1 Open Source Frameworks: Spring (IOC, MVC, ORM, Security), Micro services, Hibernate, RESTFUL WS with Jersey, Tibco, Adobe flex. Maven, Jenkins, HTML, CSS, Bootstrap, JQuery, Angular JS, Ext JS, Node.js, Backbone.js, and Jasper reports, Log4J and JUnit 4.4, jMock. IDE and Tools: Eclipse 3.4, OSGi, SQL Navigator Data Bases: Oracle10g, PL/SQL, MySQLDb2, Rally, JIRA, Version Control / QA tool: Subversion, GIT, Application Server: JBOSS, IBM WebSphere MQ, WAS.\n\nClient: Carefusion, Sandiego, CA                                        \t\t                                                                   Jan. 2016 – Feb. 2017\nJava Developer    \nResponsibilities:\nPlanning, analysis, design and implementation of different modules using Agile (Scrum) Methodology.\nDeveloped the application using JSP for the presentation layer along with JavaScript for the client-side validations.\nUsed Spring framework for the server-side logic implementation.\nConfigured different layer (presentation layer, server layer, persistence layer) of application using Spring IOC and maintained the Spring Application Framework's IOC container.\nUsing Spring IOC (Dependency Injection) developed Java beans with getter and setter properties to be configured by Spring.\nUsed Spring framework's MVC framework to better control the presentation, business and navigational aspects of the applications.\nConfigured and implemented Spring Application Context to instantiate all bean classes in Spring MVC application framework.\nEffective use of hibernate (ORM tool) in the business layer in communicating with the Spring DAO and also developed mapping files and POJO java classes using ORM tool.\nModified existing and created new Hibernate objects-based Queries for data storage, retrieval, tuning and mapping.\nUsed Hibernate 3.0 object relational data mapping framework to persist and retrieve the data from database.\nImplementation of new web services using SOAP and Apache-axis to provide HRMS services for the external systems.\nExperience in running web scale services on Amazon Web Services (AWS).\nUsed microservices that uses spring data to implement a JPA and spring REST to provide a RESTful interface to account information. \nDeveloped Database Procedures for updating, Inserting, and deleting table for a complete logical Unit of Work (LUW) using PL/SQL under Oracle Database Server.\nPackaged and deployed the application in JBOSS Application server in different environments like Development, testing etc.\nInvolved in Daily Scrum meetings, Sprint planning and estimation of the tasks for the user stories, participated in retrospective and presenting Demo at end of the sprint.\nResponsible for bug fix code check-in and integration of the code with other components.\nUsed CVS as version control system.\nEnvironment: Core Java, J2EE (JSP/Servlet, JDBC), HTML, CSS, JavaScript, JQuery, Ajax, Spring, Hibernate 3.0, Web Services, microservices, AWS, MVC design patterns, UML, XML, JBOSS Server, JMS, JNDI, Maven, Java beans, RMI, Junit, Toad with Oracle, CVS, My Eclipse IDE, UNIX.\nClient: Holmes Murphy, Des Moines, IA                        \t                                                                            Feb. 2014 – Nov. 2015\nJava Developer\n\nResponsibilities:\nInvolved in Design, Development, Testing and Integration of the application.\nImplementing business logic and data base connectivity.\nClient side installation and configuration of project.\nDeveloped using simple Struts Validation for validation of user input as per the business logic and initial data loading.\nGUI is designed using HTML 5, JQuery, Bootstrap, CSS and JSP for interacting with the server.\nImplemented application using Swing, AWT, JFC for User Interface.\nDeveloped User Interface using JSP, JavaScript, HTML, and CSS. \nDesigned core interfaces and modular design with OSGi and Declarative Services\nWriting database queries on Oracle 9i.\nWriting stored procedures, Packages, Views, Cursors, Functions and triggers using SQL in the back end.\nUsed Hibernate for Object Relational Mapping (ORM) and data persistence.\nWrote SQL commands and Stored Procedures to retrieve data from Oracle database.\nDesigned and developed Java message components to send/receive and publish/subscribe WMQ messages.\nDeveloped the application using Singleton, Business Delegate and Data Transfer Object design patterns in the project.\nCreated and implemented Oracle Stored Procedures, Functions, Triggers and complex queries using SQL.\nUsed multithreaded environment to run the processes asynchronously using different future calls to access the data.\nAbility to quickly adjust priorities and take on projects with limited specifications.  Effective team player with excellent logical and analytical abilities.\nExcellent written and verbal communication skills, inter-personal skills and self-learning attitude.\nEnvironment: Java, JSP, Struts 1.3.8, CMS, OSGi, SOAP Web services, SOA, JavaScript, CSS, Swing, AWT, JFC, XML, JAXB XHTML, XSLT, JMS, JSP, Ajax, Hibernate 2.1, SQL, EJB 2.0, 2.1, Log4j, Oracle 9i, Web Sphere 6.1, WMQ, Ant, RAD 7.0, Eclipse 3.2, UNIX.\n\nClient: Green Co Technologies                         \t                                                                                             Aug. 2012 – Jan. 2014\nJava Developer\n\t\t\t   \nResponsibilities: \nDeveloped Use Case Diagrams, Object Diagrams and Class Diagrams in UML using Rational Rose.\nInvolved in writing exception and validation classes using core Java.\nImplemented Multithreading to achieve consistent concurrency in the application\nInvolved in the coding of servlets programs. \nDeveloped user interface using JSP, HTML, CSS and JavaScript.\nWorked on JDBC Connectivity’s for each JSP screen.\nDesigned and coded the pages using JAVA.\nCreated numerous simple to complex queries involving joins, Co-related sub queries, Dynamic SQL queries etc. and used them for creating various packages. \nExperienced with NOSQL Databases MongoDB and Cassandra.\nPerforming DBA functions, installing, configuring and supporting database systems.\nJUnit for testing the application, rectified performance bottlenecks and eliminated critical bugs.\nUsed Eclipse IDE tool to develop the application.\nEnvironment: Java, Servlets, JSP, JSTL, HTML, JavaScript, JUnit, JDBC, Oracle 8i, Tomcat, GIT, Eclipse,Log4j,Sql.\n\nSB technologies                            \t                                                                                                                          Oct. 2010 – July. 2012\nJava Developer\n\nResponsibilities:\nDeveloped the view components using JSP, HTML, Struts Logic tags and Struts tag libraries. \n Involved in designing and implementation of Session Facade, Business Delegate, Service Locator patterns to delegate request to appropriate resources. \nInvolved in developing SQL queries, stored procedures, and functions.\nCreation of database objects like tables, views using oracle tools like Toad, and SQL* plus.\n Involved in writing Stored Procedure in using PL/SQL.\nDesigned and coded the pages using JAVA and HTML.\nAssisted in database design in MYSQL, schema planning.\nUsed GIT for controlling the different version of code.\nUsed JUnit for testing the application, rectified performance bottlenecks and eliminated critical bugs.\nUnit testing and integration testing of owned use cases and involved in Functional Testing.\nUsed Apache Tomcat as application server and Log4j for application logging and debugging.\nEnvironment: Java, Servlets, JSP, JSTL, HTML, JavaScript, JUnit, JDBC, Oracle 8i, Tomcat, GIT, Eclipse, Log4j.\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "communication",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}