{
    "id": "resume_dd990dda-f6fc-4274-8882-6efac0da4ed2",
    "metadata": {
        "filename": "Dhanalaxmi -BA.docx",
        "processed_date": "2025-09-24T08:45:40.830007+00:00"
    },
    "raw_text": "Dhanalaxmi Sangole\nPh No: 916-282-9259\nEmail ID: sam@vishconsultingservices.com\n\nSenior Business Analyst\n\nProfessional Summary: \nExperienced as a Sr. Business Analyst for 7+ years with proficiency in Business Process Engineering and Software Development Life Cycle including analysis, design, testing and implementation of software applications. \nHighly motivated, self-starter, able to work independently and collaboratively within a diverse technical team.\nExcellent team player work in conjunction with testing, development and other teams in validation and testing complex scenarios and projects and in the maintenance of Quality Standards in Projects.\nExperienced in interacting with business users to identify their needs, gathering requirements and authoring Business Requirement Document (BRD), General system Design (GSD), Functional Requirement Document (FRD) and Software Requirement Specification (SRS) across the deliverables of a project.\nIn-Depth Knowledge in facilitating Joint Application Development (JAD), Rapid Application Development (RAD) and Joint Requirement Planning (JRP) sessions, interviews, workshops and requirement elicitation sessions with end-users, clients, stakeholders and development team.\nStrong Knowledge with Iterative approach for Software Development as per Rational Unified Process (RUP) and Agile approach. Involved in inception, elaboration, construction & transition phases using rational tools like Requisite Pro, ClearCase and ClearQuest during various phases of RUP.\nExperienced in Business Analysis, SWOT Analysis, Gap Analysis, Risk Analysis, Disaster Recovery Planning, Testing and Project Planning.\nExtensive knowledge of Medicaid (MMIS), Medicare, Procedural and Diagnostic codes and Claims Process.\nExpertise in EDI and HIPAA Testing Privacy with multiple transactions exposure such as Inbound Claims 837-Institutional, 837-Professional, 837-Dental, 835-Claim Payment/Remittance Advise, 270/271-Eligibility Benefit Inquiry/Response, 276/277-Claim Status Inquiry/Response, EDI 834-Enrollment and 820-Payment order and remittance advice. \nExperience in Conversion of HIPAA X12 4010 codes to X12 5010 codes and ICD 9 codes to ICD 10 codes.\nGathered requirements for ICD 10 Codes pertaining to Other Payer Liability (OPL), Federal Employee Program (FEP), Enterprise Code Management system (ECM), Claims Processing System (Diamond), Maintenance Process.\nProficient in creating Sequence Diagrams, Collaboration diagrams, Activity Diagrams, Class Diagrams using Rational tools and Microsoft Visio.\nExperienced in handling Change Management.\nExperienced in analyzing and documenting business requirements and system functional specifications including Use Cases.\nExperienced in writing Test Plans and executing Test Cases.\nExperience with healthcare reform (HCR) and healthcare payer systems.\nProficient in Developing and executing Test Plans, Test Scripts, performing functional, usability testing and ensuring that the software meets the system Requirement.\n\n\n\nProfessional Experiences:\n\nWisconsin Medicaid (HHS), Madison, WI\nApr 2014 – Present \nRole: Sr. Business Analyst\n\nDescription: This project was to implement IV&V on MMIS and Medicaid Eligibility System.\n\nResponsibilities:\n\nParticipated in Business Modeling by understanding the needs of the business, and also documenting Business Use Cases as well as System Use Cases\nDevelop the supporting plans such as scope, cost, risk, schedule, quality, resource, security deliverables, procurement and change management plans.\nFacilitated Joint Application Development (JAD) sessions with the Management, Mainframe and HIPAA team to make sure everyone are in synchronous with the business requirement processes.\nCreated Requirement validation and Verification Plan.\nMapped all functional requirement with Business Requirement and all user stories with Functional requirement so it gets easy to do IV & V.\nInvolved in HIPAA 5010 gap analysis of ANSI X12 4010.\nDeveloped plan for data feed and data mapping for integration between various systems including XML, to follow ICD 10 code set and ANSI X12 5010 formats.\nDevelop Project charter and got Approval.\nProduced Gap Analysis documents for HIPAA 5010 and ICD-10.\nPrepared UAT Materials, UAT Test Cases to include various steps involved for UAT and to have proper coverage of requirements.\nExtensively gathered business requirements for ICD -10 Groupings/classes pertaining to the maintenance process, ICD -10 Business rules remediation process, Other Payer Liability (OPL), Claims Processing system (Diamond).\nGathered High Level Deliverables  for ICD -10 Remediation of Configuration Rules to comply with ICD mandate , to regroup with sequential ICD- 10 Codes\nGathered detailed requirements OPL tables to convert, capture and/or map the current ICD 9 diagnosis and procedure codes to the new ICD -10 diagnosis and procedure codes.\nDefine project goals, objectives and success criteria.\nIdentified and document Project constraints and assumption.\nUsed MS Visio to create Use Cases and Sequence Diagrams.\nAccomplished experience through whole SDLC from requirement analysis till deployment.\nAssisted development team to translate requirements into technical specifications.\nCreated and Maintained the Requirement Traceability Matrix (RTM).\nInitiated Test Plans, developed and executed test cases and scenarios, worked with users to develop specific acceptance criteria and prepare test exhibits.\nConducted User Acceptance Testing (UAT) sessions with business users and prepared document for enhancements and bug fixes.\n\nEnvironment: HP Quality Center 10.0, Caliber RM, SAP, MS Office, Windows XP, Windows Vista, MS Visio, HP SharePoint, MS Project, MS Visio, SQL, SOA Infra, XML, SpecBuilder, MMIS, Mainframe.\n\n\nBlue Cross and Blue Shield, Jacksonville, FL\nFeb 2013-Mar 2014 \nRole: Sr. Regulatory Analyst\n\nDescription: The project involved TriZetto heading the IT solution for Blue plans. Project was involved working on the design and configuration changes as per the PPACA (Patient protection and Affordable Care Act) in the current healthcare plans. As a Business Analyst I partnered closely with SME's and legal teams to understand the technology and business parameters.\n\nResponsibilities:\n\nResponsible for gathering and documenting Legislative, Business, Functional requirements for all the provisions and their impact on the existing products and systems.\nResponsible for integrating with Facets. Designing test scripts for testing of Claims in Development, Integration and production environment.    \nTested and validated claims processed by Facets.\nParticipated in the CORE (Committee on Operating Rules for Information Exchange) compliance process for the company.\nActively involved through the successful Implementation phase of HIPAA 5010 Project.\nInvolved in HIPAA EDI transactions such as 835, 837 (P, D, I) 276, 277, 278.\nInvolved in up-gradation of HIPAA X12 4010 transaction to HIPAA X12 5010 and ICD 9-CM (Clinical modification) to ICD-10-CM/PCS (Clinical modification/procedure coding system) simultaneously\nProduced Gap Analysis documents for HIPAA 5010 and ICD-10.\nResponsible for creating test scenarios, scripting test cases using testing tool and defect management for Policy Management Systems, Payables/Receivables and Claims processing.\nWorked on the PPACA for various mandates such as Grandfather Rule, Rescissions, D-26, Pre Ex-19, Preventive Care, Operating Rules, and Early Retirees Fund etc.\nWrote test cases and test scripts for the User Acceptance Testing.\nPerformed Requirement Analysis and developed Use Cases and Activity Diagrams.\nTraced High Level Requirements (HLR) to Detailed Level Requirements (DLR) using MKS Integrity.\nConducted meetings with SME's to understand current business process and performed Gap Analysis to meet future business needs.\nCreated and managed project templates, use case project templates, requirement types and traceability relationships in MKS Integrity.\nDeveloped Systems Specifications document to define the impact of the new requirements on the existing system.\nDeveloped and managed creation of product documentation to communicate features, benefits, positioning and impacts to different audiences and ensured that documentation deliverables from various groups are produced as needed.\nCreated Business Requirement Document (BRD), Functional Requirement Specification (FRS) document, User Requirement Specification (URS) and Change Request (CR) document for system application development.\n\nEnvironment: MS Office, Rational Quality Manager, SQL Server, MS Project, MS Visio, Unix, j2ee, Java, XML, Mainframe and Rational ClearQuest, ClearCase, Windows XP.\n\n\nHealth Integration, Tampa, FL \t\t\t\t\t                                          Apr 2011 – Jan 2013\nRole: Sr. Business Analyst\t\n\t\t\t\t\t \t\nDescription: This project mainly deals with the large web based applications used in the clinical settings.\n\nResponsibilities: \n\nDeveloped Functional Requirement Scenarios and Use Cases based on business needs.\nInvolved in gathering Data Mapping Requirements from Technical Team. \nWorked with Business user to define Functional Requirements and Business Process Flows. \nDeveloped Business Requirement Document (BRD) and Use Case Document (UCD) using Microsoft Office.\nWorked with data migration and file mapping for various EDI transactions.\nEnhanced the Provider/Patient verification criteria using additional parameters based on the information retrieved from the EDI 837 I/P transaction files.\nTranslated the EDI X12 data into XML format for initial transformation/migration.\nReloaded multiple business rules from the Legacy System into the new system.\nWorked on various Business and technical documents including the Requirements and Specifications.\nWorked on Child Support Obligations and benefits and prepared process flows and data flow diagrams.\nCoordinated with the developer’s team to make sure the systems are running efficiently.\nPrepared reports, and submitted it to higher authority.\nActively participated in Change Board Meeting for any changes in the business requirements. \nUpdated BRD based on Change Request and manage Change Request Document using Microsoft Office.\nUsed Quality Center to import all Defined Requirements from Microsoft Word. \nWorked with Quality Analyst to ensure the validation of the system. \nDocumented all the development work submitted to the client in a report format.\n\nEnvironment:- MS Project, SQL, Rational Unified Process (RUP), Rational Requisite Pro, Rational Rose, Clear Quest, Microsoft Visio, Windows XP/Vista/Windows 7, Mercury Test-Director, MS  Visio, Business Objects.\n\nKaiser Permanente, Sacramento, CA                        \t\t\t\t                                  Jan 2010 – Mar 2011\nRole: Sr. Business Analyst\n\t\t\t\t\t \t\t\t\nDescription: This project involved the implementation of a web based portal for billing departments, claims submission and other major enhancements to claims system.  \n\nResponsibilities:\n\nDeveloped Use Cases, workflow, screen mock-ups, and conversion requirements. \nConducted risk engineering to derive and execute action plans on time. \nResponsible for conducting daily stand up meeting in the absence of team lead in SCRUM environment. \nResponsible for attending Monthly Scrum planning meeting to define priorities from the product backlog. \nWorked on HIPAA 4010s EDI 835 and EDI 837.\nInterfaced with SMEs to prepare Functional Requirement documents for ongoing projects. \nPrioritized business and systems problems; analyzed and conducted impact analysis for new enhancement. \nPrepared business process models; used Visio to create Use Case diagrams. \nConducted various JAD sessions for requirement clarification, feasibility study and change request.\nResponsible for managing change request document and communicating actively with the Team. \nUsed IBM Requisite Pro to enter Functional Requirement, Use Cases and create SoDA reports. \nActively participated in Design Phase with technical team for requirement clarifications.\nActively participated in QA Phase with QA team for requirement clarifications.\n\nEnvironment: Windows 2007, Microsoft Visio, UML, IBM Rational RequisitePro, Rational SoDA, JIRA, Quality Center, Agile, SQL server, SQL developer.\n\nEDUCATION\nBachelor of Computer Engineering, Dnyaneshwar University, Pune, India.\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "java",
        "jira",
        "scrum",
        "sql"
    ]
}