{
    "id": "resume_6e43c14f-03ee-45ac-88fc-29a21ba8da5e",
    "metadata": {
        "filename": "Drakshajavauidev.docx",
        "processed_date": "2025-09-24T08:45:40.893460+00:00"
    },
    "raw_text": "                                                                                          Drakshayani.S\t\n           drakshajavauidev93@gmail.com\n                                                                                                                                                        Mobile: +1 (510) 309 8480\n\n\n8 plus years of IT experience in all phases of Software Development Life Cycle (SDLC) such as Planning, Analysis, Design, Implementation, Testing and Maintenance of Web Based, Client-Server and N-tier Architectures in domains like Healthcare, Insurance etc.\nSUMMARY:\nExtensive experience of designing and developing software applications with the JDK1.6/1.5/1.4/1.3, J2EE1.4/1.1, EJB, Annotations, Java, JSP,CRM, Servlets, Java Beans, JNDI, AJAX, JMS, ORM, JNDI, Web services, JDBC, JAXP, RMI, XML, JavaScript (AngularJS and Bootstrap), jQuery, CSS, AWS, Web Services, SOAP.\nExperienced in a fast paced Agile Development Environment including Test-Driven Development (TDD) and Scrum.\nProficient in Java/J2EE Design Patterns including singleton, Factory, Model View Controller (MVC), Data Access Object (DAO), and Business Delegate. Well versed with core Java concepts like collections, multithreading, serialization, Java beans.\nResponsible for designing Presentation Tier (web pages) using the concepts such as Themes, Skins, HTML, XML, CSS, Java Script and jQuery using AJAX.\nExtensive experience in developing JEE based Web Services to expose useful functionality to web users through SOAP, describing them using WSDL, registering them using UDDI for easy availability to potential users and consuming using Axis2 and JAX-WS\nGood Working experience in using different modules like Spring Core Container Module, Spring Application Context Module, Spring MVC Framework with STS module, Spring AOP Module, Spring ORM Moduleetc. in Spring Framework.\nStrong Programming Skills in designing and implementation of multi-tier applications using Java, J2EE, JDBC, JSP, JSTL, HTML, JSF, Struts, JavaScript, Servlets, JavaBeans, CSS, EJB, XSLT, JAXB.\nStrong with REST Web services architecture and using it with Spring MVC and different response formats\nStrong Object Oriented Analysis and Design (OOAD), ERD documentation, UML artifacts modeling with Rational Rose and Enterprise Architect. Applied the requirements engineering, analysis, and design disciplines of the RUP to J2EE projects.\nExperienced in implementing Organization DevOps strategy in various operating environments of Linux and windows servers along with cloud strategies of Amazon Web Services.\nExperience in writing numerous test cases using JUnit framework with JPROB integration\nWorked on IDE’s such as Eclipse/My Eclipse, WSAD/RAD and JBuilder for developing, deploying and debugging the applications.\nGood working knowledge of persisting java objects using Hibernate that simplify data storage and retrieval to the underlying database.\nImplemented various levels of application and services using Spring-Framework (2. 3), EJB3, Struts2 and ORM tools like Hibernate 3.0 for fast pace and efficient code generation.\nWorked on various XML technologies i.e., writing DTD, Schema, Namespaces, XSL, Xpath, Xlink, XQuery, XHTML and SAX, DOM, JDOM parsers.\nExperience in designing and implementing various levels of applications and services using Main Framework.\nExperience in Customer Relationship Management (CRM).\nExperience in Scripting languages like Angular JS , React JS and Node JS.\nExperience working with databases such as MongoDBOracle 8.x/9i/10g, MS-SQL Server 2008/2005MySQL and using PL/SQL to write stored procedures, functions and triggers for different Data Models.\nExperience in database related work primarily creating complex stored procedures, Views, Triggers, Functions, using PL/SQL.\nExperience in Configuration Management, setting up company Version policies, build schedule using Clear Case, SVN, CVS and Git.\nExpertise working on Application servers and Web servers like WebLogic 8.x/9.x/10.x, Apache Tomcat 5.x/6.x/7.x. \nExcellent written and verbal communication skills, presentation and problem solving skills.\nStrong communication & relationship management skills, enthusiastic & self-driven, with a high degree of commitment.\n\n\nTechnical Skills:\nWeb Technologies                                   : J2EE, XML1.0/1.1, XSLT, EJB1.1/1.2, JSP1.1/1.2, Servlets 2.0/2.3/2.4/2.5,\n\tJava (JDK 1.1/1.2/1.3/1.4/1.5/1.6), JMS, JNDI, JavaScript, HTML,\n Java Server Faces (JSF), Hibernate, Spring, JDBC 3.0, SQL, Angular JS, React JS, Node JS.\nApplication Server\t\t\t: WebLogic 8.x/9.x/10. x. JBOSS 3.x/4.0, IBM Web Sphere 4.0/5.x/6.x.\n   Web Server                                   \t: Java Web Server 2.0, Apache Web Server, ANT, Tomcat 6.0, Glassfish\nLanguages\t\t\t               : JAVA, C, C++, Shell scripting, UML.\nDatabases\t\t\t\t: Oracle 8.x/9i/10g Enterprise Edition, MS-SQL Server 2008/2005, DB2.\nTools                                                                : Rational Rose 2000, JBuilder 3.5/5.0, Visual Cafe 4.0, Visual Age Java 3.5, eclipse 3.X,MS-Office, Front Page, Ultra Edit-32, Clear Case, iReport -1.2.5,Jasper Assistants, Apache Spark, LiveLink, eMatrix, Ant, WinCVS 1.2, TOAD 5.0/8.0, Erwin, XML SPY, Code Check, Jtest, Jprobe suite 5.1 (Memory Debugger, profiler),Squirrel SQL Client, Maven 1.1 /2.0, My Eclipse 5.1,Net Beans. \nOperating Systems\t\t\t: UNIX (Sun Solaris 2.6/2.8), Unix-HP, Linux 3.1, UNIX Scripting, Windows NT \t\t\t\t\t4.0, Windows.\nVersion Control Tools\t\t: CVS, SVN, Clear Case, Git.\nEDUCATION:\n\nBachelor’s Degree in Electronics & Communication\t\n\nPROFESSIONAL EXPERIENCE:\n\nValspar, Mineapolis, MN\tSept 2016 to Tilldate\nRole: Sr.JAVA UI developer\nProject: Valspar\n\nDescription:The Valspar Corporation is an American international manufacturer of paint and coatings. The backend of valspar website was developed in Java using J2EE with Spring MVC framework. The module for shopping cart was developed using the technology. The agricultural products selection, catalog maintenance of products and order processing in the portal were the responsibilities. Have exposure to B2B business in the environment.\n\nResponsibilities: \nDesigned the application using Agile Methodology\nFollowed Agile Scrum methodology that included iterative application development, weekly Sprints and stand up meetings. \nDeveloped Front endusing Angular JS.\nDeveloped CIPHER Encryption, DECRYPTION algorithm using AES/DES.\nDeveloped the enterprise application by integrating JSF/Spring/Hibernate Frameworks. \nHeavily used the Dependency Injection feature provided by spring framework for bean wiring. \nUsed Spring framework's JMS support for writing to JMS Queue, Hibernate Dao Support for interfacing with the database and integrated spring with JSF. \nAdded interactivity to the UI pages using JavaScript. \nDeveloped Contract first Web Services using Spring-WS to communicate with Database Tables. \nProvided a new Web Service and Client using Spring-WS to get the alternate contractor details. \nWorked on Restful web services which enforced a stateless client server and support JSON (few changes from SOAP to RESTFUL Technology) Involved in detailed analysis based on the requirement documents.\nWrote AngularJS controllers, views, and services\nUsed Java Messaging Services (JMS) for reliable and asynchronous exchange of important information. \nExtensively worked using AWS services along with wide and in depth understanding of each one of them.\nParticipating development of FIX messages processing engine.\nImplemented JMS listeners to connect to the Tibco JMS queues for producing and consuming JMS messages. \nUsed Spring-JDBC configuration to manage some transactions across multiple databases. \nDesigned and developed the service business process and data access to Oracle database and back-end layers with JAXB, JMS and XML. \nUsed Maven for building the applications EAR for various environments. \nDesigned, developed JSP, Servlets and deployed them on JBOSS Application Server.\nUsed Spring ORM Support for Hibernate to manage efficiently Hibernate Resources and consistent exception Hierarchy.\nUsed HTTP for coordinating Internet engineering task force\nDesigned and created Hibernate persistence classes using Hibernate API.\nWrote Stored Procedures/Triggers/Functions using SQL and PLSQLNavigator to perform operations on Oracle 10g database. \nParticipating development of FIX messages processing engine.\nUsed JUNIT extensively and defined various Test Suites and Test Cases. \nUsed Log4J to trace the flow of the application. \nDeployed application on BEA WebLogic Application Server 9.2 to get efficient performance. \nUsed Subversion for version control across common source code used by developers. \n\nEnvironment: JDK 1.6, JSF 1.2, JBoss, Spring-Jdbc 2.5, Spring-ws-core 1.5, Wsdl4j, SOAP, JMS, Spring 2.5, fix, Hibernate 3, Maven 2, Log4J and JUnit 4.4, Eclipse, Angular JS, Oracle10g, Subversion, AWS, tortoise SVN, Mercury Quality center, BEA WebLogic Application Server 9.2.\n\nOptum, Sanjose, CAMay 2014 to July 2016\nRole: Sr.Java UI Developer \nProject: Medical\nDescription:\nOptum is powering modern health care to create a healthier world, the innovation arm of Optum and UnitedHealth Group this is a cross-functional department across OptumInsight, OptumRx, and OptumHealth, Health Data Analytics, Pharmacy Benefit Manager, Healthcare delivery services and support including OptumCare, home to the organizations acquired staff model and IPA model physician groups, and ancillary services (Behavioral Health and Substance Abuse, Dental, Vision, Transplant Management).\n\nResponsibilities: \nDesigned and developed UI screens with Struts to provide interactive screens to display data.\nActively involved in Agile Methodology which includes weekly Sprints and stand up meetings. \n  Used Maven for building the applications EAR for various environments. \n  Designed and created Hibernate persistence classes using Hibernate API.\n  Wrote Stored Procedures/Triggers/Functions using SQL Navigator to perform operations on Oracle 10g database. \n  Deployed application on Glassfish Server 3.1.2 to get efficient performance. \n  Used Subversion for version control across common source code used by developers.\nInvolved in the development of presentation layer and GUI responsive development using JSP, HTML5, and CSS/CSS3, Node JS.\nUsed Dependency Injection feature of Spring MVC framework and O/R mapping tool Hibernate for rapid development and ease of maintenance.\nDeveloped and implemented the MVC Architectural Pattern using Struts Framework including JSP, Servlets, EJB,      Form Bean and Action classes.\nDeveloped the DAO layer for the application using Spring Hibernate Template support.\nUsed JSP Tag Libraries (JSTL) to implement the logic inside the JSPs.\nUsed the JSF / Rich faces for developing the webpages.\nUsed Spring MVC and Web Flow to bind web parameters to business logic.\nUsed plain JavaScript and JQuery, JavaScript Library to do the client side validations.\nDeveloped Web Services using REST, SOAP, WSDL and XML.\nUsed AJAX to get the data from the server asynchronously by using JSON object.\nWorked on Oracle10g database for storing and retrieving the application data.\nInvolved in configuring JMS and JNDI in rational application developer.\nPerformed building and deployment of EAR, WAR, JAR files on test, stage systems in Glassfish Application Server.\nUsed GIT as a version control system, an important component of Source Configuration Management (SCM).\n\nEnvironment: JDK 1.7, JSF2, JBoss, Spring-Jdbc 2.5, Spring-ws-core 1.5, Wsdl4j, SOAP, JMS, Spring 2.5, fix, Hibernate3,Maven2, Log4J and JUnit 4.4, NetBeans,JDBC,Oracle10g, Subversion, Git, Glassfish Server 3.1.2,Toad,AJAX.\n\nMohawk Industries Inc, Atlanta, GAJune 2013 to March 2014\nJava UI Developer\nProject: Flooring industry\n\nDescription: Mohawk Industries (NYSE: MHK) is an American flooring manufacturer based in Calhoun, Georgia, United States. Mohawk produces floor covering products for residential and commercial applications in North America and residential applications in Europe. The company manufacturing portfolio consists of soft flooring products (carpet and rugs), hard flooring products (ceramic tile, natural stone and hardwood flooring), laminate flooring, sheet vinyl and luxury vinyl tile.\n\nResponsibilities:\nAnalysed work by developers and suggested improvements and modifications.\nUsed MVC based STRUTS framework for Web tier development using Eclipse IDE.\nReviewed process requirements and formulated accurate estimates for implementation.\nDeveloped cloud computing applications through NoSQL, Hibernate and other platforms.\nCreated web pages using CSS, HTML, JAXB and worked on interfaces like JSON.\nDemonstrated expertise and advanced understanding of J2EE, Tomcat, HTML 5, Angular JS.\nDocumented and ensured safety and security of cloud computing applications.\nUsed complicated methodologies such as Agile for testing and implementation.\nWorked on codes within servers and evolved solutions for complex issues.\nBuilt XML based data exchanges; used DOM for parsing and XML creation out of Java code.\nCommunicate with the clients on modules, requirements and change requests for any queries on either side.\nPreparing low-level design documents like sequence diagrams, object reference document, program specifications and class diagrams based on the functional requirements document.\nEnvironments setup for Dev, QA and production for newly develop module\nIntegrate web component with different queue based messaging services.\nPerform peer -- document reviews and code reviews.\nResponsible for QA/production release\nPrepared Unit test cases.\nUsed TOAD for PL/SQL query, stored procedures and functions in Oracle as database.\n\n\nInek Technologies, Hyderabad, IndiaJan 2012 to April 2013\nJava UI Developer\nProject: Supply Chain Finance\n\nDescription: The Project Supply Chain Finance is developed to provide a web-based front-end for document (Baseline and Dataset); creation and exchange; between trading partners via SWIFT Net TSU.  TSU which is a collaborative workflow engine designed for the banking community, to provide competitive Supply Chain services to their customers will provide an engine for data matching and workflow. The matching engine will match data derived from corporate documents and the workflow engine will provide a tracking mechanism. The added functionalities in the project are Business form creation and conversion, Transaction status and message status management, Incoming and outgoing message management, E-Mail alert generation.\n\nResponsibilities:\nInvolved in various Software Development Life Cycle (SDLC) phases of the project which was modeled using Rational Unified Process (RUP).\nGenerated Use Case Diagrams, Class Diagrams, and Sequence Diagrams using Rational Rose.\nWorked on the UI for the Provisioning feature using Jakarta Struts Framework which is based on Model View Controller design pattern.\nUsed the Struts Validation for validation of user input in the MVC Layer\nImplemented the template-based categorization of presentation content using Struts-Tiles. MVC implementation using Struts framework.\nImplemented workflow system in a SOA environment, through web services built using Axis2 for SOAP over HTTP and SMTP. Configuration and deployments of AXIS2 components on web sphere application server at class loader level, and used the same to build and consume the web services (both synchronous and asynchronous). \nDeveloped CWS and PWS web services (JAX-WS, REST, JAX-RPC) like CRUD operations of User, Enterprise, Transaction Status, Authorization Service end to end, using different JAX-WS standards with clear understanding on WSDL (type, message, port Type, bindings, and service).\nExtensively used Hibernate in data access layer to access and update information in the database.\nUsed Spring MVC developed with STS Framework for Dependency Injection and integrated it with the Struts Framework and Hibernate.\nUsed Web services – WSDL and SOAP for getting credit card information from third party.     \nUsed JMS API for asynchronous communication by putting the messages in the Message queue with Active MQ Series\nImplemented the EJB 3 Session beans for business logic an MDB’s for the Messaging Service\nImplemented various design patterns in the project such as Business Delegate, Session Façade, Data Transfer Object, Data Access Object, Service Locator and Singleton. \nDesigned various tables required for the project in SQL server database and used Stored Procedures and Triggers in the application. \nWrite new plug-in classes accessed by action classes. Apply the test first methodology on the same using JUNIT4\nPerformed unit testing using Junit framework and used Struts Test Cases for testing Action Classes.\nUsed Ant scripts to build and deployed on WebSphere Application Server. \nMonitored the error logs using Log4j and fixed the problems.\n\nEnvironment: JDK 1.5, Servlets, EJB, XML, SOAP Web Services, JQuery, JMS, Struts 2.1, Hibernate 3.0, Spring 2.5, SQL, Web Service(JAX-WS), HTML, JSF 2.0, AJAX, JavaScript, CSS, SVN, SQL Server, Adobe Dreamweaver CS5, ANT 1.7, IBM Web Sphere Application Server 6.1, TCPMon, Soap UI, Visio, Rational Rose, Log4j.\n\nAviva Life Insurance, Bangalore India \t                                                                      Oct 2009 to Dec 2011\nJava UI Developer\n\nDescription: The Aviva Life Insurance India is widely recognized Insurance provider. It markets best healthcare products with quality business. Worked on wide range of health insurance plans and developed application based on J2EE along Java, JSP and MVCon the technology. Groups and individuals can choose from a variety programs. The project is to design their website with the information of various health plans listed under different plans and also create login for each individual8\n\nResponsibilities:\nActively involved in SCRUM’s and Sprints of Agile Methodology.\nCreated detailed design documents (UML diagrams like Use case, Class, Sequence, and Component diagrams) using Rational Rose.\nInvolved in design activities that is HLD (High Level Design) and LLD (Low Level Design).  \nDesigned and developed front end using JSP, JSTL, EL, and other custom tag libraries.\nExpertise in Web Page development using XML, XSLT.  \nInvolved in Web Page development using YUI Library.\nInvolved in injecting dependencies into code using concepts like IOC of Spring Framework \nDesigned asynchronous messaging using Java Message Service (JMS) to exchange of critical business data and events among J2EE components and legacy system.\nExpose and Consume RESTweb services to get the data from different contracts from different clients and also expose the warehouse inventory details for consumer tracking\nUsed Spring MVC in the Web Layer\nInvolved in configuring and deploying the application using WebSphere.\nInvolved in integrating the business layer with DAO layer using Hibernate ORM.\nTransaction Management using the Hibernate configurations\nResponsible for development of configuration, mapping and Java beans for Persistent layer (Object and Relational Mapping) of Hibernate. \nInvolved in Writing and reviewing unit test cases using JUnit.\nUsed CVS as version control system to check in and checkout the data.\nWrite and modify database stored procedures, triggers, functions, and PL/SQL Scripts.\nCreated Forms and Reports using Oracle.\nInvolved in writing shell scripts for deploying application on UNIX.\nInvolved in build management and build resolution activities of e-commerce project.\nInvolved in Smoke Testing, Testing, bug fixing and documentation of the system\n\nEnvironment: JDK 1.5, Spring framework, Hibernate, Web services (REST), RAD, XML, XSLT, Expression Language(EL), JMS, WebSphere 6.1, MQSeries, Rational Rose, WindowsXP, ANT, JavaScript, HTML, JUnit, CVS, Log4J, YUI library, AJAX, CSS, Eclipse IDE, and DB2.\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "communication",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "oracle",
        "problem solving",
        "r",
        "react",
        "scrum",
        "spark",
        "sql",
        "swift"
    ]
}