{
    "id": "resume_60fa1804-03b5-41f8-aa14-7b241806bb21",
    "metadata": {
        "filename": "Francis Gomes Resume.docx",
        "processed_date": "2025-09-24T08:45:40.947632+00:00"
    },
    "raw_text": "Professional summary  \n16 + years of experience in Business Strategy Programs/ Project Finance management and process solution designs as Business System Analyst, PMO Consultant and Project Manager specializing in Strategic IT Project, Program/Portfolio Management spanning across Energy & Utilities practice and associated IT support space.\nDelivered analytical solutions, and execution for IT Program Management Operations services. \nAchievements \nContributed to SMART Manufacturing Program CPI savings of >$500K. (As PMO Manager, Shell US Program)\nReceived Feather in My Cap Award for Ownership, Proactive attitude & Contribution to Project. (As Project Manager, Shell Project)\nCustomer Centricity Award for creating consistent positive Customer experience. (As Project Manager, Shell Project)\nReceived Feather in My Cap for my contribution in getting WIPRO Presidents Award. (As PMO Lead, Shell Project)\nAwarded for improving the Teams Overall Customer Satisfaction Score across the floor (As Tech Team Lead, HP Project)\nCertifications\nITIL v3 Certified\nProfessional Scrum Master I Certified\nMicrosoft Certified Professional\nCareer Highlights & Competencies\nExtensive experience in Multi-million IT - Business Strategic programs for Oil and Gas Majors and PC Mfg. Cos.\n\nCore competencies highlighted below:\n\n\nCost Savings delivered:\nGenerated savings at high risk multi-million-dollar projects programs. \nMaintained overall Budget variance under control by inducing automated processes improving efficiency and effectiveness. \nEnabled transparency in accountability to drive work-stream performance.\nProfessional Traits:\nDemonstrates a penchant for proactive problem prognosis and generating alternatives.\nShows Inventiveness in analytical solution and solution delivery. \nProvides a meticulous and consistent adaptation of best methodologies.  \nEnergizes project/ program managers as a partner. \nBridges gaps between varied work-streams, augmenting Program Management standards.\nAnticipates potential project derailments by meeting stakeholders, and understanding client and business expectations.\nExperience Highlights\nMotiva Enterprises LLC. (www.motiva.com), Location: Houston, USA, Feb, 2016 – Dec, 2017                             \nRole: Finance PMO Consultant for a high priority $350 MM IT Business Strategy Transformation Program. \nSAP (SAP R/3) Finance System Management to track and manage Purchase Orders, WBSE and cost Center allocation and settlements.\nUse ARIBA to Track and Manage Purchase Order spend. \nQuery and generate ARIBA reports (Expense, Invoicing, Orders, Payments & Receiving)\nStandardize Requisition to pay process, Records Management process and Audit Readiness. \nManaged Program SharePoint Environment; Creating and Managing site governance plan, SharePoint Migration and platform implementation. \nMaintained Project Plans, Risk matrix and co-ordinate with Risk Owners and facilitate in update and mitigation.\nEstablished PMO (“Project Management office”) methodologies, best practices for continuous process improvement and lead initiatives to analyze and implement. \n\nShell Oil Company (www.shell.com), Location: Houston, USA, 2012 – 2016                              \nRole: PMO Manager for a $ 100 MM Global Initiative program to establish robust and standard work process helping Downstream Manufacturing sites across the globe improve reliability and economic performance. \n\nManaging and reporting IT & Business Finance, Program Schedule, Cost – Benefit and Delivery Compliance.  \nDelivery Compliance: Tracking integrated Program Plan, Change Requests, Risk and issues, Action, Decision, Benefits Logs and Contingency management.\nManage Resourcing & Contracts for Program: Coordinating with Sourcing/ HR for creating Project Agreements.\nAutomate processes - Improve efficiency:  Design / Develop and manage Analytical - PMO tools. \nProcess Standardization and tools implementation. Ensure Project Delivery Framework compliance / assurance and track project stage gate sign-offs. Apply LEAN methodology and provide continual Cost – Process improvement.\n\nShell Oil Company (www.shell.com), Location: India, 2010 – 2012                              \nRole: Project Manager for a Global Central Program Management Office Team serving diverse portfolio and Classes of Business.\nCustomer/ Stakeholder Management – Communicating – Coordinating with Global PMO Lead/ Managers across Classes of Business. Working with onshore stakeholders in designing, developing and implementing Business process standardization initiatives. \nManage communication between Wipro offshore and onshore PMO and Report/ discuss Monthly status of the PMO Support engagement through Monthly Service Review meetings.\n\nManage overall Project performance: Planning, Tracking and Managing deliverables, Resource utilization, Quality compliance and SLA adherence.\nPoint of Escalation for all the Classes of Business PMOs. Review service performance with the customer, identify areas for process improvement and implementation.\nRequirement gathering and business expansion prospect analysis. Coordinate and integrate change management activities.\n\nShell Oil Company (www.shell.com), Location: India, 2008 - 2010\nRole: Lead PMO Analyst\nAs a Lead PMO, successfully transitioned and stabilized new Retail IT PMO from Melbourne, Australia. Provided proactive analytical solutions and coordinated with stakeholders and assisted management on improvement of business processes in PMO Support project. \n\nRWE nPower Ltd. (www.npower.com), Location: United Kingdom, May – July 2008\nRole: Site Lead for Infrastructure Refresh Program/ Deployment Project across multiple locations in UK.\nDeployment Planning & Execution: Designed infrastructure configuration area, Handled deployment technical & administrative issues, Perform technical site audits. Incident, Change and Escalation Management.\n\nHewlett Packard Company (www.hp.com), Location: India, Jan 2006 – Apr 2008\nRole: Technical Lead & Analyst for Global Business Analytics Project. \nPlanning & designing Process Reengineering initiatives and streamlining Incident, Problem and Change Management. Enterprise level analysis of Hardware Surveys, Repeat Service, Open Cases, Tools Usage, Product Related Issues, and Unresolved Technical Issues for Global Vendors. Trend analysis of the operational metrics and providing feedback to the vendors for further improvement of the metrics. Exception Analysis and reporting, Quality Checking and Control. Identification of training requirements for the technical support technicians.\nIncident, Problem and Escalation Management. Technical Mentoring, Training Needs Identification, Training Associates on Hardware/OS/Networking Technologies. Managing Quality & process compliance, KPIs (Key Performance Indicators) and Service Level.\nTechnology Competencies\n\nSAP, R/3 Functions (Finance Management), ARIBA Spend management\nMS SharePoint 2016, Sharegate - SharePoint Migration Suite, Nintex Workflow/Forms, MS InfoPath 2010\nMS Project, HP- PPM (HP Project & Portfolio Management)\nITSM Tools, Maximo, Remedy\nDell Certified Hardware Technician, HP Certified Hardware Technician. Expertise in Hardware Diagnosis and Troubleshooting for Desktops & Notebooks\nMicrosoft OS (Windows 10, Windows 7, Vista, 2008 Server)\nKnowledge on Hardware, Software, Networking and Internet/ Cloud Technologies\nBusiness Competencies \n\nProject Management Principles & Agile/ Scrum Methodologies.\nExposure to ITIL Principles and Methodologies. \nExpertise in Statistical Data Interpretation and Computational Techniques. \nExposure to Quality Management Principles (Six Sigma, Failure Mode Effects Analysis etc.)\nEducation\nSCDL, Pune, India\nPost Graduate Diploma in Business Administration – Operations Management \nNIIT, Kolkata, India\n(DNIIT) Professional Diploma in Network Centered Computing\nSt. Xavier’s College, Kolkata, India\nEconomics\nReferences\n\n*Reference can be provided upon request.\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "mentoring",
        "project management",
        "r",
        "scrum"
    ]
}