{
    "id": "resume_798a829a-f53d-4531-a2f8-e238d17c1f73",
    "metadata": {
        "filename": "Haarika_BA.docx",
        "processed_date": "2025-09-24T08:45:41.203520+00:00"
    },
    "raw_text": "\n\nTechnology professional with 8 years of experience in the IT industry as a Business Analyst with extensive work experience and good in-depth knowledge in Healthcare, Telecom, Finance, Insurance and Pharmaceutical Industry. Possess a solid balance of technical experience and smart business assessment and translate them to functional and usability requirements throughout the Software Development Life Cycle (SDLC). Have strong Project Management skills. Ability to analyze and design business processes and requirements using established system process design and implementation methodologies applying business modeling and Unified Modeling Language (UML). Have hands on experience on eliciting Business requirements and creating BRDs and experience in RUP, Agile Scrum and Waterfall Methodologies. Possess excellent verbal and written communication skills that help communicate with stakeholders, end users, project managers and testing team and create professional documentation.\n \n\nExpert level knowledge of Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC).\nProficient in understanding the various phases including Requirements, analysis, design, development, testing and implementation of software applications.\nHighly experienced in implementing Waterfall, Agile Scrum methodology and Rational Unified Process (RUP).\nExperienced in UML, modeling Activity, Use case and Sequence diagrams using tools such as Rational Rose, Microsoft Visio.\nCompetent in conversing with the Business Users, Subject Matter Experts (SMEs) Developers and the QA Team.\nExpert in project plan development and analysis.Extensive experience working with MS Project.\nExperience in defect tracking for web based client/server applications. Proficient in prioritizing, implementing and managing product enhancements in Quality Center.\nConducted Joint Application Development (JAD) sessions and interacted with the stakeholders in order to elicit requirements and prioritize them thus acting as a liaison between the management, developers and the IT team.\nExpert documentation skills and comfortable with eliciting correct requirements from business users\nDocumenting key content deliverables (Requirements and Functional Design Docs, test scripts, UAT sessions and Acceptance Report, Training Materials).\nMultiple projects experience working with cross-functional teams across multiple time zones.\nExceptional ability to maintain and build client relationships, frequent meetings one on one with clients, able to comfortably converse with all facets in the client's organization.\nExperienced in appraisal of the AS-IS and TO-BE business processes (Gap analysis) and experienced in converting these requirements into technical specifications for preparing test plans.\nPerformed Data and workflow analysis with the help of Use Case diagrams, Collaboration Diagrams, Sequence Diagrams and Activity Diagrams in Rational Rose and MS Visio to clearly communicate requirements, architecture and designs.\nProviding traceability matrix across the project by linking business requirements, functional specifications and corresponding test cases.\nImplemented SQL scripts, stored procedures, triggers and indexes for various database operations.\nStrong knowledge of SQL and extraction/ transformation/ loading (ETL) process using SQL scripts.\nGood knowledge on ETL tool Informatica PowerCenter on Designer, repository Manager, Workflow Manager and Workflow Monitor.\nExperience with Quality Center, Rational Requisitepro and Selenium.\nExperience working with open source tools and technologies.\nStrong presentation skills and ability in presentations towards different functional areas of business.\nDemonstrated an exceptional ability to adapt to new developments in the world of technology and working environment. Ability to prioritize and schedule multiple tasks on a day-to-day basis.\nExcellent communication and leadership skills, self-motivated and a quick learner.\n \n \n \n\n\n\nPennsylvania Department of Health, Harrisburg, PA                                            April 2017 – Current\nSr. Business Analyst\nDescription: Pennsylvania is implementing an Electronic Death Registration System (EDRS) to report death events in Pennsylvania. EDRS is a web-based application that simplifies the data collection process and enhances communication between funeral directors, local registrars, coroners/medical examiners and certifying health care providers as they work together to register deaths online.\nResponsibilities:\n\nAttended reviews and walkthroughs to better understand the Requirement documents.\nAnalyzed FRS and BRDs to get a better understanding of the system on both functional and business perspectives.\nReviewed and analyzed business requirements document to derive the functional requirement document and systems requirements specification document.\nLiaise with Cross Functional Teams for gathering requirements\nAssisted in the release of project-related materials for internal and external stakeholders by creating reasonable plans\nInvolved in meetings and training in between the project phase to communicate the project phase progress to the stakeholders\nPerformed Risk analysis of the requirements to identify the key business risks areas for the project and prioritized the application development and testing as-is to-be process\nInvolved in Walkthroughs and meetings with the development team.\nAnticipated risks to the project success and escalates accordingly.\nTracked and maintained user requested enhancements and changes.\nAssisted in Project Impact and Process Control Plan documents.\nParticipated in calls with business users, developers and weekly status meetings.\nCreated Product Backlog, Sprint Backlog, managed User stories, epics and led daily stand-up meetings.\nParticipated in Release Planning, Sprint Kick off, Sprint review and daily scrum meetings.\nResponsible for Leading JAD sessions with Business, Stakeholders and other impacted project team including developers and architects.\nActively participated in creating the Training Plan documents for technical as well as workflow training for the appropriate users to enable production hand-off using MS - Word\nPrepared Reports (weekly) and maintained Weekly Project Tracker\nParticipated in User Acceptance Testing (UAT) and regression testing\nWorked with Development teams investigating and correcting software bugs and deficiencies based on testing results.\nEnvironment: HTML, XML, MS Access, ORACLE, MS Word, Excel, Quality Center, Sharepoint \n\n\nComcast, Philadelphia, PA\t                                                                   Jan 2015 - March 2017\nBusiness System Analyst\nDescription: Comcast is the second largest pay-tv company in the United States and the nation's third-largest home telephone service provider. Comcast has invested in Technology to build a sophisticated network that delivers the fastest Broadband speeds. Comcast is a producer of feature and television programs intended for theatrical exhibition and over-the-air and cable television broadcast. The Project Master Data Management includes Web-based software, hosted by Comcast, and a range of customer-focused services.\nResponsibilities:\n\nCollaborated with the business team to understand and determine the overall Business goals\nConducted JAD sessions and captured Procurement documents for Business Requirements\nWorked with IT and Business personnel for gathering, understanding and implementing requirements accordingly as-is to-be\nInterviewed SMEs and other staff personnel to understand and interpret Business needs, performed document analysis to understanding current state and determine future needs\nPrepared Business Requirement Documents and Functional/Non-functional/ Requirement Documents and Technical Requirement Documents\nResponsible for meetings with users and stakeholders to identify problems, resolve issues and improve the process to ensure a stable and accurate solution\nCreated, traced and maintained requirements in RTM (Requirements Traceability Matrix) through design, development and testing phases\nPerformed Gap Analysis and identified potential issues/gaps.\nWorked on Large Scale, Complex IT Project (e.g., Custom Applications Development and COTS Implementations)\nPrepared and contributed in creating Test plan and Test Strategy along with arranging and executing Test Cases for Manual Testing\nIdentified, analyzed, documented and communicated Defects and inconsistencies in software program content, functions, outputs, and online modules in HP Quality Center (QC)\nPerformed Functional Testing and Integration Testing on Web Services.\nCoordinated with QA Manager to develop Business scenario test Cases based on the Business Requirement Documents (BRD) and Technical Requirement Documents (TRD)\nWorked with development teams to identify, debug and retest system bugs and deficiencies, based on testing results & following the defined Bug Life Cycle (BLC) process\nEvaluated and verified test data systems through Quality Metrics created in HP Quality Center & Excel\nPerformed Functional, Integration, System Testing for the different types of customer transactions & processes.\nDeveloped Test Cases for User Acceptance Testing(UAT)\nUsed HP Quality Center (QC) for requirement management, planning, scheduling & running tests, also tracking & managing defects in the Defects module.\nEnsured business requirements are verifiable as identified and covered in testing cycles to ensure delivery of expected functionality.\nEnvironment: HTML, XML, JavaScript, Web Services – Axis 2.0, DB2, Windows XP, Unix, Selenium, Quality Center.\nUnion Bank, Los Angeles, CA                                                                                   May 2012- Dec 2014\nBusiness Analyst\nDescription: Union Bank is a full-service bank with offices across the United States. It provides a wide spectrum of corporate, commercial, retail banking, and wealth management solutions to meet the needs of customers. The bank also offers an extensive portfolio of value-added solutions for customers, including access to investment banking, personal and corporate trust, capital markets, global custody, transaction banking, and other services. The project was implemented as a Data Warehousing and BI initiative to process data for Customer Information, Credit Cards and the analyzed data was used for marketing, Credit Cards Processing, Billing, Payment.\nResponsibilities:\n\nGathered Business Requirements from the Subject Matter Experts (SMEs) and documented \nBusiness Requirements Document (BRD)\nUtilized data flow diagrams, user story/ use case diagrams and process flow diagrams to represent information provided by the Business Owners\nExperienced in facilitating and conducting Joint Application Design (JAD) and Joint Requirement Planning (JRP) sessions, interviews, workshops and requirement elicitation sessions with end-users, clients, stakeholders and development team.\nEffectively elaborated the current process and gave a clear picture of the proposed process for the projects in the organization. \nWorked with Development Team to resolve issues and clarify Business Requirements from the Business Owners\nMaintained the Traceability Matrix table to track the Business Requirements.\nLogged the defects using Quality Center and tracked the defects back to the test cases and the requirements \nKeen analyst with the ability to keep company risk low while building \nReview and prepare the procurement documents involving third party vendors\nPeriodically prepared requests to provide insides to internal stakeholders, financial advisory services, risk assessments and support\nReviewed Functional specification documents, design documents, requirements traceability matrix and involved in developing test plan document\nSupervise and guide testers in the team and monitor day-to-day test activities with business analyst team and onsite development teams and suggest necessary changes if required in relevant use\nWorked with the UAT and QA teams to conduct an assessment and determine how effective UAT and QA guidelines can help the company achieve timely completion of projects.\nValidated performance of the systems by running scripts and gather the response times. Prepared results of the performance tests\nPrepared reports on defects and conducted defect meetings with the development team\nLed the Change Control Process for changes submitted for the BRD once the document was submitted to IT department\nWorked aggressively towards timely completion of high priority tasks.\nEnvironment: Web Portal - Heads Down & PEPs, MS Access, ORACLE, MS Word, Excel, PowerPoint.\n\n\n\nHealth First, New York, NY                                                                                  July 2011 – April 2012\nBusiness Analyst\n\nDescription: .Healthfirst is a provider-sponsored health insurance company that serves more than 1.2 million members in downstate New York. Healthfirst offers top-quality Medicaid, Medicare Advantage, Child Health Plus, and Managed Long Term Care plans. Healthfirst Leaf Qualified Health Plans and the Healthfirst Essential Plan are offered on NY State of Health.The Health Insurance Portability and Accountability Act (HIPAA) require that all health insurance payers in the United States comply with the EDI standards for health care.Health First is a leading insurance organization that caters to the health insurance needs of the residents\n\nResponsibilities:\n\nGathered and documented requirements in Requisitepro those are critical to the business mission and using those requirements to design application software using a Use Case approach\nCreated EDI documents for EDI maps to generate requirement documents and Project Charter, and logical design documents for EDI transactions and code sets\nInteracted with the “Users” by interviewing them, by preparing questionnaire and getting feedback\nAttended Client Meetings Project Steering Committee Meetings and Project Management Committee Meetings\nPrepared BRD, Business Cases, and presentation to the clients, Business Re-engineering proposals\nAssisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI 837 Transaction, Code set and Identifier aspects of HIPAA\nManaged the team of consultants responsible for developing on-demand Medicaid Management System reports\nDesigned the online screens and reports for the Medicaid Online Electronic Claims Submission System\nAnalyzed business requirements for new system requests, system upgrades, and system replacements to ensure compatibility with IT security policies and HIPAA standards\nManaged the team of consultants responsible for developing on-demand Medicaid Management System reports\nDesigned the online screens and reports for the Medicaid Online Electronic Claims Submission System\nResponsible for creating test scenarios, scripting test cases using testing tool and defect management for Policy Management Systems, Payables/Receivables and Claims processing\nDeveloped Use Case diagrams, business flow diagrams, Activity/State diagrams and Sequence diagrams so that developers and other stakeholders can understand the business process by using UML\nWorked as an interface between the users and the different teams involved in the application development for the better understanding of the business and IT processes\nAnalyzed various corporate statistics with the help of financial modeling and forecasting to predict potential risks factors\nMaintained a requirements traceability matrix in order to keep the clients and all the teams up-to-date with the current progress of the project\nInvolved in the documentation and technical writing of the requirements in an elaborate way.\nConducted User-Acceptance Testing(UAT).\nEnvironment: Rational Unified Process (RUP), DB2, Rational Test Manager, Win Runner, HTML, XML\n\n\n\nHighmark, Camp Hill, PA                                                                             November 2010 - June 2011\nBusiness Analyst\nDescription: Highmark Inc. and its health insurance subsidiaries and affiliates collectively are among the ten largest health insurers in the United States and comprise the fourth-largest Blue Cross and Blue Shield-affiliated organization.This X12 Transaction Set contains the format and establishes the data contents of the Healthcare Claim Transaction Set (837) for use within the context of an Electronic Data Interchange (EDI) environment. This transaction set can be used to submit healthcare claim billing information, encounter information, or both, from providers of healthcare services to payers, either directly or via intermediary billers and claims clearinghouses\n\nResponsibilities:\n\nStudied the existing business system and pattern for efficiently making the changes.\nHeld meetings with the SME and developers to complete the given task on timely basis.\nStudied existing business application and processes, collected end user requirements, analyzed sources of revenue leakage and suggested the improvised business process model.\nFacilitated collection of Functional Requirements Specification (FRS) from system users and prepared of Business Requirement Documents (BRD) by using Rational Requisitepro along with applied MS-Visio for creating Use Case Models and Use Case Specification documents.\nInvolved in HIPAA assessment and HIPAA X12 EDI transaction (837, 834) mapping and identified changes that needed to be done to comply with HIPAA regulation and HL7 compliant\nProvided SDLC Methodology for developing EDI applications to completely automate payments posting for Medicare, Medicaid and commercial payers electronic payments files.\nWorked on Member Management, Eligibility and Claims\nDocumented, clarify, and communicate requests for change requests with the requestor and coordinate with the development and testing team.\nCreated and also assisted the team during Test case creations and reviewed it on individual functionality of what the application has to perform making sure it covers all the business rules. \nDeveloped use case diagrams, use case models and class diagrams based on UML methodology\nLogged the defects using Quality Center and tracked the defects back to the test cases and the requirements \nKeen analyst with the ability to keep company risk low while building \nConducted UAT in the final phase of software development process to check the functionality of the software\n\n\n\nRanves IT solutions Pvt Ltd, Hyd, India                                                    April 2009 - October 2010\nJr. Business Analyst\n\nDescription: Implemented a centralized database that collects and organizes and stores data from different operating systems to provide a single source of integrated and historical data for the purpose of end user reporting, analysis and decision support and to improve the client services by preventing errors, providing real-time data and updating records as transactions are completed for Billing and Payment purposes.\nActed as a liaison between the business users and technical teams to build applications based on the business requirements. \nAssisted BA in creating business use case scenarios, and documented system specifications with information obtained through subject matter experts, and stakeholders/steering committee meetings. \nCreated Functional Requirement Specifications following the Agile Methodology using MS Word/Visio. Worked with Source Analyzer, warehouse designer, Mapping Designer, Mapplets, and Reusable Transformations\nUsing Informatica Designer Designed Mappings, that populated the Data from Source to staging area to Sales & Marketing Data Mart \nWorked within software development methodologies to quickly achieve business process. \nWrote functional and non-functional specifications, and scenarios. \nDesigned and documented process flow of system functionality via diagrams, screen mockups, use case, work flows.  \nWorked with developers to map data to requirements. \nWorked with the Project Manager and BA to estimate best/worst case scenarios, tracked progress for weekly estimates of remaining work to do, conducted informal meetings as needed. \nCreated activity and sequence diagrams to provide direction to developers. \nConducted JAD sessions to communicate expectations, and managed issues. \nCreated test plans, identified and coordinated testers, performed user acceptance testing (UAT). \nPerformed defect tracking using QC, and ensured resolution of issues.\nBachelors in Engineering\t\t\t\t\t                              JNTU, India\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "html",
        "javascript",
        "leadership",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}