{
    "id": "resume_4270c08e-b69f-46e4-ab29-5873cc8e185d",
    "metadata": {
        "filename": "Harshitha Challa.docx",
        "processed_date": "2025-09-24T08:45:41.595116+00:00"
    },
    "raw_text": "\n\nName: Harshitha                                                                                                                          Email:harshithac511@gmail.com\nRole: Full Stack Java Developer                                                                                                Phone: 650-517-6475\n\n\nPROFESSIONAL SUMMARY\nOver 8 years of experience in Software Development Lifecycle (SDLC) core areas such as Analysis, Design, Implementation, Testing and Deployment of Object Oriented, Client-Server, Web-Based, Distributed and Enterprise Applications with Java/J2EE technologies.\nStrong experience in Software Development Methodology such as Agile (Scrum) Methodology, Iterative and Waterfall.\nExperience with both Core and Advanced Java concepts which include Java, Servlets, JSP, Java Script, JDBC, JSF, XML, EJB, Struts, Spring MVC, Ajax, jQuery, Hibernate, JDBC, and REST & SOAP Web Services.\nExperience in designing professional UI web applications using front-end technologies like HTML/HTML5,  CSS/CSS3, JavaScript, XML, DHTML, XHTML, JQuery, AJAX, JSON, Angular JS, Angular 2, Backbone JS, React JS and Bootstrap.\nDesigned and developed the monitoring system used for AWS Elastic Environments, including monitoring individual instance health, overall environment health, and managing individual component failure cases e.g. missing ELB, misconfigured Auto Scaling Group, misconfigured EC2 Security Group, etc.\nExperience in using and implementing various design patterns such as Singleton,MVC, Bridge, Abstract Factory, Decorator, DATA Access Object, Data Transfer Object and Iterator etc. \nExperience in building web applications using SPRING framework features like MVC (Model View Controller), AOP (Aspect Oriented Programming), DAO (Data Access Object), Spring Boot, Spring Security, Spring Batch.\nProficient with software build process and writing Maven and ANT Build Scripts for automated build and deployment process.\nExperience with Build tools like, ANT, MAVEN, GRADLE.\nExtensive experience of working with RDBMS like Oracle 11g/12 c, MySQL, SQL Server, Mongo DB and developing Stored Procedures, Triggers, Views, Functions and SQL Queries.\nStrong experience with Mongoose, used to access MongoDB on the server.\nExperience of working with RAD, WSAD 5.0, Spring Tool Suite, JDeveloper, Eclipse, NetBeans.\nExperience in designing UML diagrams using Rational Rose and Microsoft Visio.\nExperience in the use of Defect Tracking & Version Management Tools such as SVN, CVS, GIT.\nExperience with unit testing the applications using Junit and JMeter.\nWorked on continuous integration and continuous deployment using Jenkins/Hudson.\nExperience in Spring Security Framework for User access Management and involved LDAP configuration for authentication,authorization.\nExperienced in Distributed Transaction Management system with Spring JTA Based on Atomikos.\nExperience in configuring and deploying the applications on Tomcat, WebSphere, WebLogic and JBoss Servers.\nResponsible for Offshore & technical support and maintenance of its daily batch jobs, implemented spring batch for 1milliontransaction.\nA resourceful team player with good inter-personal skills, effective problem - solving and decision-making skills, looking for a satisfying career in a fair working environment with opportunities for growth.\n\n\n\n\nTECHNICAL SKILLS \n\nPROFESSIONAL EXPERIENCE \n\nClient: Wells Fargo, Charlotte, NC \nRole: Java Full stack Developer\nDuration: Aug’16–till  Date\n\nResponsibilities:\nInvolved in analysis, design, and developing middleware using Servlets, Java Beans, Hibernate, springs and doin enhancements and issues resolutions. \nExtensive uses of Angular JS directives to get JSON data using AJAX from RESTful API and modify DOM.\nDesigned the presentation layer GUI using JavaScript, JSP, HTML, CSS, Angular.JS, Customs tags and developed Client-Side validations.\nDeveloped Single page application and structured the JavaScript code using AngularJS.\nDesigned UI pages using JSP, HTML, Angular JS, Node JS, Java Script, CSS, AJAX, JQUERY, JSP, JSON and Tag libraries.\nFollowed Single Page Application (SPA) Pattern and used AngularJS MVC to build a cross-browser complaint application.\nDeveloped the DAO layer for the application using spring, Hibernate and developed various logics and reports using HQL and Hibernate criteria.\nUsed Hibernate as ORM to map Java classes to data base tables.\nImplemented Spring MVC architecture and increased modularity by allowing the separation of crosscutting concerns using Spring Boot.\nLeveraged AWS cloud services such as EC2; auto-scaling; and VPC (Virtual Private Cloud) to build secure,highly scalable and flexible systems.\nAWS is used to coordinate and manage the delivery of messages to the subscribers. Client side validations andserver side validations are done according to the business needs.\nInvolved with Spring IOC concepts to integrate Hibernate DAO.\nInvolved in writing Spring Configuration XML, file that contains declarations and business classes are wired-up to the frontend managed beans using Spring IOC pattern.\nDeveloped Web Services for data transfer using Restful WebServices.\nExtensively used Core Spring Framework for Dependency Injections of components and Spring JDBC for managing all the database communication and exception handling.\nInvolved in developing and exposing web services and also consumption of Web Services like Restful Web services.\nDeveloped the REST based Micro services using spring data and spring boot with JPA. Refactored Micro service to make it RESTful, thread safe and more configurable. \nInvolved in performing Unit and Integration testing (JUnit). Strictly followed Test Driven Development (TDD). Approach environment using agile methodologies.\nCreating and Exposing RESTful Web Services using RAD editor and used Maven build for the deployment.\nDeveloped REST services to talk with adapter classes and exposed them to the angular JS front-end.\nWorked on Restful web services which enforced a stateless client server and support JSON few changes from SOAP to RESTFUL Technology.\nDeveloped data objects to communicate with databases using JPA, Hibernate and JDBC frameworks.\nMiddleware Services Layer is implemented using EJB (Enterprise Java Beans-stateless).\nWrote Java Scripts validations to validate the fields of the Registration Screen and login screen.\nUsed JIRA for bug tracking, issue tracking and project management.\nInvolved in writing the batch jobs, UNIX scripts to load/manipulate the data.\nCreated SQL queries, NO/SQL, Stored Procedures, Functions for database layer by studying the required business objects and validating them with Stored Procedures using PostgreSQL. Also used JPA with hibernate provider.\nUsed GIT to implement version control.\nUsed log4j for tracking errors and debugging the code.\n\nEnvironment: Java 1.8, Java Scripts, HTML, STRUTS, JUNIT, Servlets, JDBC, JQUERY, JSON, AJAX, DOM, Jenkins, HQL, Spring Boot,JIRA, Hibernate, DB2, JPA, Eclipse, EJB, JMS, Knockout.js, log4j, NO/SQL Micro services.\n\nClient: Randmcnally, chicago,IL\nRole: Full Stack Java Developer\nDuration: Jan’15 to July ‘16\n. \nResponsibilities: \nInvolved in Daily Scrum (Agile) meetings, Sprint planning and estimation of the tasks for the user stories, participated in retrospective and presenting Demo at end of the sprint. \nDesigned the complete website using HTML5, CSS3, jQuery, AJAX, JSON, Bootstrap, JavaScript. \nDeveloped single page applications (SPAs) using Angular JS to improve page performance. Used Angular JS to create reusable components like custom directives, filters for data manipulations and to display data in company standard format in UI. Experience in writing swagger documentation for Node JS services. \nUsed Angular JS to create reusable components like custom directives, filters for data manipulations and to display data in company standard format in UI. \nAdded dynamic functionality to the application by implementing Node JS. \nWrote internal and external API services using Node JS modules. \nDeveloped internal coding using J2EE technologies based on the MVC Architecture. \nImplemented RESTful Web services to retrieve data from client side and made REST API calls from Angular JS and parsed the data to project to client and handled the security and Authorization using Spring Security and OAuth. \nDeveloped Business objects using POJOs and data access layer using Hibernate framework \nDesigned and developed business components using Spring Boot, Spring Dependency Injection (Core), Spring AOP Spring Annotations. \nUsed Spring Data Framework to use the features of Spring JDBC and Spring ORM classes like JDBC Template and Hibernate Template to perform the database operations by connecting to Data sources available. \nBatch processing and partitioning using Spring-Batch. \nDeveloped REST architecture based web services to facilitate communication between client- server. \nInvolved in the implementation of the RESTful web services using the Spring Boot and to perform CRUD operation from the database, published the REST services. parsed the data to project to client and handled the security and Authorization using Spring Security. Spring security OAuth, can be used for authentication and authorization purposes in application. \nImplemented RESTful and SOAP based web administrations utilizing for JAX-RS and JAX-WS individually. \nStrategic and practical implementation of cloud-specific AWS technologies including Elastic Compute Cloud(EC2), Simple Storage Services (S3), Cloud Formation, Elastic Beanstalk, Virtual Private Cloud(VPC), RDS and Cloud Watch. \nHands-on experience in developing AWS cloud formation templates and setting up Auto scaling for EC2 instances and involved in the automated provisioning of AWS cloud environment using Jenkins. \nAware of troubleshooting issues on AWS and other developer IDE and Cloud environments. \nDesign, develop, test of SOA services using SOA/RESTful Web Service. Involved in the deployment of REST based Web-Service End-Points. \nConfigured and build Asynchronous communication with JMS services with MQ services.\nUsed Maven building tool for creating EAR file to be deployed in application servers. \nUsed JIRA ticketing system to keep track of issues and tasks on individuals. \nVersion controls like GIT Used for source code version controlling.\nWorked on No SQL databases like Cassandra.\nUsed Cassandra as data storage and utilized aspects like replica sets and clever document design to make service extensible scale and feature wise. \n\nEnvironment: Java 1.6/1.7, HTML5, CSS3, jQuery, Ajax, Angular JS, Bootstrap, JSON, J2EE, Spring MVC, Spring Security, Spring Boot, Spring Data, Spring Batch, JSP, Hibernate, Web services, RESTful, Stored Procedures, RAD, WebLogic, Agile/Scrum Methodology, AWS, Maven, Pivotal Cloud, Git, Thyme leaf, DynamoDB, Life ray, JIRA, Junit, Linux, Log4J, TDD, Cassandra, Groovy, Node JS, Oracle, Splunk, My SQL.\n\nClient:\tUSAA- San Antonio, TX\t\nRole: Java/J2EE Developer\t\nDuration:May’13-Dec’14\n\nResponsibilities:\nInvolved in the loan details Presentation module. \nInvolved in designing of the BOA Loan Assist entry framework using J2EE guidelines and different J2EE design patterns with JSP, Controller Servlets and EJB in picture. \nInvolved in the implementation of the Service Locator, Business Delegate and the Session Façade design pattern for the enterprises level functionality. \nUsed JavaScript, for the client end data validations.\nInvolved in JUnit testing and used JProbe to quickly pinpoint and repair the root cause of application code performance and stability problems that obstruct component and integration integrity.\nDeveloped the Stateless Session bean for processing the business logic. \nDeveloped numerous Transfer objects using the DTO design pattern for inter-tier communication. \nImplemented Struts framework (Action and Controller classes) for dispatching request to appropriate class. \nUsed Struts Validation framework for validation of user input as per the business logic and initial data loading. \nUsed JSF for automatic synchronize UI components.\nLogging, Exception handling and validations to IOMS and IOMS Payoff application using AOP module of Spring.\nUsed JSF for navigation handling and duplicate button press problem.\nWritten SQL, PL/SQL queries. And used DB2 stored procedure, functions, triggers, cursors, objects, sequences etc.\nUsed Crystal Report tools to generate data sources. \nApplication development using N-tiered client/server development. \nImplemented Rational Unified Process (RUP) for software development process \nDevelop Message Driven Beans (MDB) & involved in building and accessing a web Services using SOAP over JMS. \nDeveloping a mechanism for sending and receiving SOAP messages over JMS by MQ Series Engine \nDeveloped Web Services using Apache AXIS2 tool Framework. \nGenerated WSDL files using AXIS2 tool. \nImplemented Web Services using SOAP protocol, UDDI, WSDL and Service oriented Architecture (SOA) Concept.\nWritten JUnit test cases for Business Objects, and prepared code documentation for future reference and upgrades. \nWritten build xml file for ANT scripting. \nUsed IBM Rational Clear Case(software configuration management (SCM)) for version control, workspace management, parallel development support and build auditing to improve productivity \nDeployed applications using Web Logic Application Server \nImplemented open source log4j logging framework in whole application. \nUsed CVS as a version controlling tool for managing the module developments.\n\nEnvironment: JAVA 1.6, J2EE, Servlets 2.4, EJB 2.0, JDBC 2.0, JAXB, Struts 2.0, JSF components, DAO, HTML, Java Script, XML, CSS, Ajax, Web Sphere Application server, LDAP, Oracle 10g, Log4J, Eclipse 3.1, CVS, DOJO, Ant 1.5, SOA, SOAP, DB2, PL/SQL, SQL, Web Services-WSDL, SOAP, UDDI, SOAP UI, JAX_RS, JERSEY, Windows XP.\n\nClient: Symphony Teleca, INDIA\nRole: Java Developer\nDuration: March’11-April’13\n\nResponsibilities:\nParticipated in system design, planning, estimation and implementation.\nInvolved in developing Use case diagrams, Class diagrams, Sequence diagrams and process flow diagrams forthe modules using UML and Rational Rose.\nDeveloped the presentation layer using JSP, AJAX, HTML, XHTML, CSS and client validations using JavaScript.\nDeveloped and implemented the MVC Architectural Pattern using Spring Framework.\nEffective usage of J2EE Design Patterns namely Session Facade, Factory Method, Command and Singleton to\ndevelop various base framework components in the application.\nModified Account View functionality to enable display of blocked accounts details that have tags. This\ninvolved modifying beans, JSP changes and middle tier enhancements.\nDeveloped various EJBs (session and entity beans) for handling business logic.\nCode implementation using java &amp; groovy, re-factoring &amp; peer review\nDeveloped Session Beans and DAO classes for Accounts and other Modules.\nExtensively used Spring JDBC in data access layer to access and update information in the database.\nWorked on generating the web services classes by using WSDL, UDDI and SOAP.\nConsumed Web Services using WSDL, SOAP and UDDI from third party for authorizing payments to/from\ncustomers.\nUsed JAXB API to bind XML Schema to java classes.\nInvolved in Units integration using JUnit, bug fixing, and User acceptance testing with test cases.\nUsed CVS for version control and Maven as a build tool.\nUsed Log4j for logging errors, messages and performance logs.\nUsed JBoss Application Server to deploy application.\n\nEnvironment: Java 1.4, JSP, Servlets, Struts frame work, Tag libraries, Java Script, CSS, AJAX, JDBC, JNDI, Oracle 8i, Java\nbeans, Struts Validation framework, Windows/UNIX, Ant, JUNIT, SVN, QC, Edit Plus, Web Logic application server, SQL\n\nClient: Dream Soft IT Solutions, India.                                                                                                                                                   \nRole: Software Developer\nDuration: Jan’10-Feb’11\n\nResponsibilities:\nDesigned and implemented Java Classes, Interfaces, Model design, and interface layer design with other team members.\nDeveloped JSP’s and Servlets to dynamically generate HTML and display the data to the client side. Extensively used JSP tag libraries.\nInvolved in writing services to write core logic for business processes. \nInvolved in writing database queries, stored procedures, functions etc. \nUsed Java J2EE design patterns. Involved in client server side validations. \nInvolved in writing JDBC code to get data base connectivity. \nImplemented server side validations and developed model classes. \nInvolved in the Database structuring and Tables creation needed for the project. \nInstrumental in tuning the framework to meet the performance standards.\nDesigned and developed web-based software using STRUTS MVC Framework.\nUsed AJAX and Java Script to handle asynchronous requests, and CSS was used to keep uniformly in look of the application.\nEJBs in the application and developed Session beans for the business logic at the middle tier level.\nCreated Test plan documents and testing using Junit Framework.\nUsed JAXB parser for parsing valid .xml files as defined by XSD.\nCreated and modified Stored Procedures, Functions and Triggers Complex SQL Commands for the application using PL/SQL.\nMonitored the error logs using Log4j and fixed the problems.\nDesigned JDBC Connection for data retrieval and updating purpose, also developed connection pool to avoid waiting time for database connection.\nUsed Tomcat server for application development with Eclipse.\n\nEnvironment: Core Java, JDBC, JAXB, WSDL, Rest, JSP, Servlet, HTML, JavaScript, CSS, Apache Tomcats, MySQL, STRUTS, Log4j, XSD. \n\nEDUCATION\n\nBachelor’s in Electronics and Communication Engineering from JNTUH\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "communication",
        "css",
        "dynamodb",
        "ec2",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mongodb",
        "mysql",
        "oracle",
        "postgresql",
        "project management",
        "rds",
        "react",
        "rest api",
        "s3",
        "scrum",
        "sql"
    ]
}