{
    "id": "resume_c38f3900-2d65-49d5-ad44-c60e6d66d2bb",
    "metadata": {
        "filename": "Jayadattaperi N.docx",
        "processed_date": "2025-09-24T08:45:41.920201+00:00"
    },
    "raw_text": " Jayadattaperi N\njaya9.java@gmail.com\n469-629-8109\nLooking for Contract (C2C or C2H) roles only\nProfessional Summary:\nAround 8 years of progressively responsible experience in development, testing, documentation & production support applications using Internet, Web and Client Server Technologies in N-Tier J2EE Architecture.\nExperience in Test Driven Development (TDD), Waterfall model and Agile methodologies like SCRUM.\nExpertise through all parts of Software Development Life Cycle (SDLC) in developing web applications using JAVA, J2EE, EJB, Web services, SOA, SOAP, RESTful etc.\nExtensive hands-on experience with core expertise in design, development, and deployment of N-Tier enterprise applications for the J2EE platform using Core Java, Servlets, Struts, Spring, EJB, JSP, Web services, JPA, JNDI, JMS, JAXP, JUnit, JMeter.\nExpertise in spring framework, including Spring IoC/core, Spring DAO support, Spring ORM, Spring micro services, Spring AOP, Spring Security, Spring MVC, Spring Cache, and Spring Integration, and Spring Boot, Spring REST, Spring Eureka, Spring Ribbon, Spring Netflix, Spring Zulu.\nExperience of working on GIT and SVN.\nExperience in Selenium Web Driver automation tool with TestNG framework using Java.\nHands on experience in Front-End technologies like Angular Js 1.4.7, Bootstrap 3.1, HTML5, JavaScript, CSS3, JQuery, Google Web Toolkit (GWT), Tag Libraries, Custom Tags, Ajax and Node JS and ExtJS.\nExpertise in designing, developing and deploying applications using J2EE technologies including Servlets, JSP, EJB 2.x/3.x, JSTL, Struts, Spring 3.5, JMS, AJAX, JDBC, JNDI, Java Beans Hibernate and Web Services.\nExperience in XML related technologies like XML, DTD, XSL, XSLT, XPATH, JAXB, JAXP, SAX and DOM.\nExtensive knowledge and working experience of web development technologies such as JavaScript, JQuery UI, AngularJS, Angular2.0, HTML5, CSS3, SASS and Bootstrap.\nExtensive experience in building rich user friendly, high performance web applications using HTML5/4, CSS3/2, SASS, and JQuery and implementing cross-browser style-sheets\nInstalled and configured the Web Server and Database Server in Linux Platform.\nExtensively worked to build Model-View-Controller (MVC) and multi-tier client/server architecture using design patterns like DAO, DTO (Data Transfer object), Singleton and Session Façade.\nExperience in using various Amazon Web Services (AWS) Components like EC2 for virtual servers, S3.\nCreated and supported numerous Java Swing and Servlet based applications using Eclipse.\nWorked on deploying the latest builds in standalone as well as set up the JBoss cluster nodes to deploy builds using JBOSS Deployment Manager.\nApplication development experience using Serialization, Externalization, Collection, Generics, Core JAVA, Applets and Swing.\nDeveloped REST API test automation, utilizing REST Assured for Java and the TestNG Framework.\nExperience in building Microservices and implementing Spring Cloud- Netflix OSS Stack and Hystrix Circuit Breaker.\nAuthored the application using Spring Cloud and worked on Microservices Architecture using NETFLIX OSS configurations like Hystrix.\nExpertise in the Apache Camel Integration Framework, in conjunction with Apache CXF and ActiveMQ. Experienced in working with Spring Integration.EJB Session Beans were used to process request from user interface using OSS.\nPerformed necessary day-to-day SVN/GIT support for different projects.\nDeveloped Selenium Automation framework using Java, Java Script executor and Selenium Web Driver.\nKnowledge on all the AWS components like VPC, EC2, ELB, Auto Scaling, launch Configurations, S3, Glacier, Lifecycle rules for storage, Route 53, Cloud watch, Cloud Trial, RedShift, Volume and Snapshot management, SNS, IAM and Roles.\nGood working knowledge of NoSQL Database, MongoDB.\nWorked on Service Oriented Architecture (SOA) such as Apache Axis web services, uses SOAP, WSDL. Exposure to JAXB & JAX-WS & JAX-RS.\nManaged GIT, Jenkins. Designed and automated build & release process.\nExperience in writing SQL queries, Stored Procedures, Triggers, views with the major databases like Oracle 9i to 11g, SQL, PL/SQL and MS Access.\nExperiences in Data Modeling, Dimensional Modeling of large databases.\nGood experience in Information Technology field as a SQL server developer with strong expertise in SQL server development, designing Stored Procedures/Transact SQL coding.\nHands on Experience in Installing, Configuring, Managing, Monitoring and Troubleshooting SQL server […]\n\nTechnical Skills:\nProgramming Languages: \tJava8/J2EE, SQL, PL/SQL, HTML, DHTML, JavaScript, Perl, UML, XML, XSL, XSLT, JQuery\nJ2EE Standards: \t\tJDBC, JNDI, Java Mail, JTA\nWeb Technologies: \tJSP, Servlet, JAX-WS, AXIS, REST (JAX-RS), SOA, SOAP, JMS, Bootstrap, EJB, Angular-JS, RMI, IBM MQ Series\nDatabases: \t\t\tOracle, MySQL, Sybase, SQL-Server-2008, Mongo-DB, Hadoop\nIDE's: \t\t\t\tEclipse, Intellij, Sublime, RAD, WSAD\nWeb/App Servers: \t\tWebSphere Application Server, WebLogic, JBoss, Apache Tomcat\nFrameworks: \t\t\tStruts, Node-JS, Spring, JSF, Hibernate, Apache Camel\nOperating Systems:\t\tWindows, UNIX, Solaris, Red Hat, AIX\nVersion Control Tools: \t\tCVS, SVN, Git, ClearCase\nTools/Utilities: \t\t\tLog4j, Ant, JUnit, Caliber, Maven, Gradle 2.1, Jenkins, SOAP UI\nMethodologies: \t\tAgile (Scrum, TDD), Waterfall\nIntegration:                                Apache Camel, JBoss Fuse 6.2, Active MQ, Apache ATOM, WESB\n\nClient: Hanger Inc., Austin, TX                                                                                 \tJan’ 2016 – Till Date\nRole: Sr. Java Full Stack Developer\nResponsibilities\nActively involved in Analysis, Design, Development, System Testing and User Acceptance Testing. Successfully followed agile methodology in the Scrum Cycle model.\nDesigned and developed Microservices using REST framework and Spring Boot and used Bootstrap along with AngularJS in creating the Application.\nUsed NodeJS for doing non-blocking design operation for server-side code and Angular.js framework in developing various UI components.\nDeveloped the responsive UI web pages using XHTML, HTML5, CSS3, Angular JS 2, JavaScript, node JS and has worked with Angular JS filters in expressions and directives to filter data in the UI.\nDesigned and coded application components in an Agile environment utilizing a Test Driven Development (TDD) approach. \nExtensively used MVC, Factory, Delegate and Singleton design patterns.\nUsed Spring framework including Spring core/IoC, Spring Web, Spring Security and implement the authentication, authorization, and access-control features by using Spring Security.\nUsed Spring Inversion of Control (IoC) for injecting the beans and reduced the coupling between the classes and implemented the Model View Controller using Spring MVC.\nImplemented the application using Spring Boot Framework and handled the security using Spring Security.\nProvide expert technical leadership to customers and partners regarding all aspects of Pivotal Cloud Foundry (PCF).\nDeveloped single page applications using Angular 2, Typescript, HTML5, CSS3, and Bootstrap.\nDeployed EARs, WARs and configured application specific JVM settings, Web container parameters using the Admin Console and WebSphere admin scripts.\nAccomplished Work Load Management by creating Clusters.\nInvolved in designing, developing and testing the web application by using the HTML5, CSS3, Bootstrap, and React.JS.\nUsing the ReactJS, Flux for SPA development.\nInvolved in responsive design and developed a single ISOMORPHIC responsive website that could be served to desktop, Tablets and mobile users using React.js.\nImplemented various screens for the front end using React.js and used various predefined components from NPM (Node Package Manager) and Redux library.\nUsed React-Router to turn application into Single Page Application\nInvolved in using React JS components, Forms, Events, Keys, Router, Animations and Flux concept.\nProject migration into cloud environment using AWS, Docker container.\nApplication and developed cross browser and multi browser compatible web pages using HTML5, CSS3 and Bootstrap.\nImplemented code according to create AngularJS Controller, which isolate scopes perform operations.\nCreated Typescript reusable components and services to consume REST API's using Component-based architecture provided by Angular 2.\nImplemented REST based web services using JAX-RS annotations, Jersey provider and consumed using HTTP services from angular JS modules.\nResponsible for setting up AngularJS framework for UI development.\nUsed Spring framework to provide loose coupling between different application modules.\nDeveloped Hibernate with Spring Integration as the data abstraction to interact with the database of MongoDB.\nDevelop a data integration application using Apache Camel leveraging Apache CXF and messaging middleware like ActiveMQ. Agile methodology used.\nUsed Microservices to communicate using synchronous protocols HTTP and REST for implementing SOA.\nEnvironment: J2EE, Java 1.8, Spring framework, Spring MVC, Hibernate, JSP, AWS, AJAX, SOA, TDD, Web Services, SQL Server, Microservices, XML, Ext JS, NodeJS, AngularJS, Angular2.0, Typescript, JQuery, JavaScript, IBM RAD 9.1, WebSphere 8.5, Agile Methodology, Design Patterns, PCF, Clear Case, Apache Maven, Apache Cassandra, MongoDB, JUnit, Html, Unit, XSLT, HTML/DHTML, JENKINS, Spark, Kafka.\n\nClient: Exelon Corp, Houston, TX                                                                                      Jun’ 2014 – Dec’ 15\nRole: Java Full Stack Developer\nResponsibilities:\nResponsible for gathering and understanding the system requirements by interacting with clients.\nGenerated the Class diagrams, Sequence diagrams extensively for all the process flows using RAD, MS VISIO.\nDesigned and developed GUI screens for user interfaces using JSP, JavaScript, XSLT, AJAX, XML, HTML5, CSS3, Bootstrap, JQuery and DHTML.\nDeveloped a HTTPS server and implemented features to serve different file types(TLS)\nExtensively involved in coding with Core Java concepts like Collections, Exception Handling, Multithreading, Java I/O, and Generics to implement some business logic.\nUsed Core, Context, and Security, Bean modules of Spring Framework.\nImplemented MVC, Singleton, Factory, DAO, Value Object, session, Facade, Data Access Object, Business Object paradigm.\nHandling orchestration service and rule engine which is implemented in NodeJS.\nUsed JQuery framework for creating front end applications and for Client Side validations.\nUsed iBatis for designing, developing and maintain the data layer.\nCreated Stored Procedures, SQL Statements and triggers for the effective retrieval and storage of data into database.\nApplication developed on Agile methodologies scrum and iterative method process.\nUsed Apache Log4J logging API to log errors and messages.\nCreated JUnit test suite to automate the testing of the business logic.\nUsed React-Router to turn application into Single Page Application.\nUsed ReactJS components, Forms, Events, Keys, Router, Animations and Flux concept.\nBuilding stable React components and stand-alone functions to be added to any future pages.\nDeveloped the Drag and Drop functionality using React-Dragabble.\nUsed React-Autocomplete for creating Google maps location search on the webpage.\nInvolved in 24x7 support, Maintenance and enhancement of the application.\nAutomate the web application using Selenium-Automation tools.\nJPA and Spring Rest to provide a Restful Interface based on Spring Boot application\nEnvironment: JDK 1.7, Spring framework, XML, HTML, JSP, AngularJS, Hibernate, iBatis, ANT, JavaScript, VSS, XSLT, CSS, AJAX, JMS, Spring Boot, Hibernate, SOAP, Web Services, AWS, Web Sphere Application Server, Tomcat, Oracle DB, MQ Series, JUnit, UNIX.\n\nClient: Gap Inc., San Francisco, CA                                                                              Sep’ 2012 – May’ 2014\nRole: Java/J2EE Developer\nResponsibilities:\nDesign and implemented the backend layer using Hibernate.\nInvolved in multi-tiered J2EE design utilizing Spring Inversion of Control (IOC) architecture and Hibernate.\nApplied design patterns including MVC Pattern, Façade Pattern, Abstract Factory Pattern, DAO Pattern and Singleton.\nMade use of content negotiation (XML, JSON, text/plain) using JAXB, GSON, Jackson, and XStream.\nUsed JQuery for back end table of Customers/Orders - for administrators to inspect and edit.\nExtensively used JMX API for management and monitoring solutions.\nInvolved in developing front end screens using JSP, JSTL, DHTML, HTML, CSS, AJAX and JavaScript.\nConfigured the Docker Containers and creating Dockers files for different environments.\nAnalyzed, diagnosed and resolved data delivery and data quality issues, fixed SSIS package and job defects, solved data conflicts and inappropriate usages of data in different environments.\nProvided query optimization and performance tuning for T-SQL scripts, SSIS packages and SSRS reports. Analyzed SQL Server execution plans for query performance tuning. Generated indexes or modified SQL executing logic to optimize query performance.\nDeveloped Web services to allow communication between applications through SOAP over HTTP using Apache Axis2.\nImplemented Hibernate for data persistence in Workflow screens. Used RAD6, WSAD as IDE for development of the application. Worked with Weblogic, Tomcat as the application servers and JMS as the message Server.\nPerformed Clear Quest defects, Database change requests logging using Clear Quest. Used Perforce as versioning system.\nDeveloped RESTful services using Jersey, JAX-RS and Restlet to call third party vendors\nDeveloped the automation environment for build, deployment, and configuration of Portlets onto the IBM WebSphere portal server using ANT scripts, XML Access scripts and JACL scripts.\nUsed Spring Framework for Dependency injection and integrated with the EJB 3.0 using annotations.\nWhich would in turn call the third party partner web services (both RESTful and SOAP).\nConfigured and built Spring MVC application on Tomcat web server.\nInvestigate, debug and fixed potential bugs or defects in the implemented code.\nImplemented JUnit tests and mandated 90% min. code coverage.\nDesigned builds which can grow and support builds using Gradle.\nDevelop named HQL queries and Criteria queries for use in application.\nImplemented transaction management for ORM project using Spring Transaction Management API.\nCreated and built project using Maven.\nCreated Stored Procedures and other SQL scripts using PL-SQL.\nImplemented logging using log4j and Spring AOP.\nImplemented various cross-project functionalities using Spring AOP.\nConfiguring the service on Weblogic/WAS application server for successful deployment\nEnvironment: Solaris, JSP, JSF, Spring, Servlet, Hibernate, JMS, JCA, JMX, XML, CSS, XML Schema, AJAX (JQUERY, AJAX), JSON, JAXP, SAX, DOM, JAXB, Java Portlet Specifications, JAX-RPC, SAAJ, SOAP, Java script, PL/SQL, D/HTML, XHTML, Maven, Log4j, JUnit, Weblogic 8.0, Oracle 9i RDBMS, Mercury Quality Center 9.0, Eclipse 3.2.\n\n\nClient: Marsh & McLennan Company, NJ                                                                    Oct’2010 – Aug’ 2012\nRole: Java/J2EE Developer\nResponsibilities:\nResponsible for analysis, design, development and integration of UI components with backend using J2EE technologies such as Servlets, Java Beans and JSP.\nUsing Technologies like SOAP, WSDL and UDDI based Web Services.\nDeveloped Hibernate 3.0 in Data Access Layer to access and update information in the database.\nDesigned the workflow, system architecture, drawing sequence diagrams, activity diagrams, class diagrams, HTML pages, database schema and tables.\nWriting JSP's for user interfaces, JSP's uses Java Beans objects to produce responses.\nInvolved in Tomcat server configuration for deployment.\nUsed JUnit framework for Unit testing of application.\nUsed log4j 1.2 to log different types of messages to write on to the proprietary log model.\nUse Case, Class, Sequence diagrams and also in complete development, testing and maintenance process of the application\nStore persistent JMS messages or temporarily store messages sent using the store-and-forward feature.\nInvolved in testing the XML files and checked whether data is parsed and loaded to staging tables.\nStore persistent JMS messages or temporarily store messages sent using the store-and-forward feature.\nUsed Hibernate to persist and retrieve data from database.\nEnvironment: Java, J2EE, Struts, Spring, Hibernate, JSP, Servlet, XML Schema, SOAP, JavaScript, PL/SQL, DHTML, XHTML, Ant 1.6, Log4j, JUnit, Weblogic10.0, Oracle 11g, Wsdl, IBM Rational rose, Maven, Eclipse, XSD.\n\n\nClient: HDFC - India \t                                                                                                   Nov’2009 – Sep’2010\nRole: Java Developer\nResponsibilities:\nPreparing the documentation for High Level design, Low Level design of the application and Process Flow of control for the entire application.\nPlayed key role in the design for the implementation of this application.\nImplemented the Consolidated applications front-end pages using JSP, JSTL, and Struts Tag Libraries.\nUsed JavaScript for client-side validations. Used JUnit for unit testing of the system and Log4J for logging\nImplemented validation rules using Struts framework.\nDesigned the Web application implementing the Struts framework for Model-View -Controller (MVC) pattern to make it extensible and flexible.\nUsed Hibernate for Object Relational Mapping.\nUsed Hibernate for Database Persistence to perform CRUD operation like insert, update, retrieve.\nUsed extensive JavaScript for creating the Global templates that can be used across the JSP Pages.\nConfigured Logger, appender and layout using log4j.\nUsed Eclipse Integrated Development Environment (IDE) in entire project development.\nUsed Ant for building JAR and WAR for the application.\nEnvironment: Servlets, JSP, EJB, Struts, Hibernate, JNDI, HTML, CSS, XML, JUnit, DOM, SAX, ANT, Web logic Server, Oracle9i.\n\n\nReferences: Provided upon request\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "communication",
        "css",
        "docker",
        "ec2",
        "git",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "leadership",
        "mongodb",
        "mysql",
        "oracle",
        "react",
        "redux",
        "rest api",
        "s3",
        "scrum",
        "spark",
        "sql",
        "typescript"
    ]
}