{
    "id": "resume_023424af-52c1-4752-a743-780e8e99edf1",
    "metadata": {
        "filename": "Kumar Raj.docx",
        "processed_date": "2025-09-24T08:45:42.973408+00:00"
    },
    "raw_text": " \t\t\t\t\t\t\n                                                               \n                                                                          Kumar Raj\n                                                                         407-218-6395  \n                                                               Expert.java11@gmail.com\n\n\nPROFESSIONAL SUMMARY:\n\n9 years of experience in Software Development Life Cycle (SDLC) with nice blend of expertise and leadership, be it requirements gathering, analysis (OOA), prototyping, design (OOD), development (OOP) or maintenance and testing of client-server applications.\nStrong experience in designing and developing component based reusable GUI based applications.\nStrong experience in Full Stack Web technologies like Core Java, J2EE, MVC Architecture (Struts and spring), Servlets, Swing, Hibernate, mybatis, EJB, JBOSS, JMS, MQ Series, AJAX, JQuery, JSF, Web services(REST and SOAP), Java Script, JSP, JSON, JQuery, JDBC, HTML, DHTML, CSS, and Custom Tag Libraries User defined JSTL, JDBC, XML, LOG4J.\nHands on experience using IDEs like Eclipse (RCP), Rational Application Developer (RAD), and Web sphere Studio Application Developer, Rational Software Architect (RSA).\nEducational experience in iOS software development (iPhone and IPod Touch).\nExtensively worked on relational databases like Sybase, DB2, MS SQL Server, Oracle 9i and MySQL.\nHands on experience in building Java server side and enterprise applications using the latest.\ntechnologies like Core Java, Multithreading, Swings, Spring IOC, Hibernate, Web services, \nJSF, JSP, Servlets, EJB, JMS, JDBC, XML,  XSLT, DOM, SAX, JAXP, JAXB.\nHighly qualified in design and architectures of n-tier applications using IBM WebSphere MQ (WMQSeries), WMB (Message Broker).\nExperience in iOS software development (iPhone and IPod Touch).\nDuring development of the plugin I create a symbolic link from the _plugins/gui/_site to my checked out github project. (see sources). Elasticsearch will provide all content under _site in a plugin as static html resources. Which is perfect for AngularJS.\nProficient in implementation of web based systems using Struts Framework. Excellent Knowledge in developing applications using Spring Framework and iBATIS. . \nExpertise in ESB frameworks like spring, Jboss Fuse and Apache Camel.\nExperienced in developing and implementing Web Services using REST, SOAP, WSDL, CXF, \nAXIS, JERSEY, UDDI, XSD, JAX Band Spring Web-services. Comprehensive understanding with the capabilities, constraints and methodologies of open source and vendor specific XML based parsing technologies of SAX, DOM using JAXP Framework.\nExperience in developing applications involving Agile, Test Driven Development methodology using Apache Continuum and Emma (Test coverage tool) and SCRUM methodologies.\nStrong analytical and problem solving skills and a proven ability to be an effective team player with excellent time management skills.\n\n\nTechnical Skills:\n\n\nPROFESSIONAL EXPERIENCE:\nCalifornia State Health Department (PHI), San Jose, CA                                           Mar2014 – Till Date\nRole: Sr.JAVA DEVELOPER\nResponsibilities:\nDeveloped technical specifications for various back end modules from business requirements and specifications are done according to standard specification formats.\nDeveloped an AngularJS workflow manager leveraging Angular-UI's state router for flexible configuration and management of multi-step user input flows.\nInvolved in  developing in Ruby.\nStrong understanding and hands on experience setting up Elastic Search 1.7 in an AWS cloud environment.\nDeveloped multiple web applications, systems and automation tools using a ColdFusion front end.\nWorked  with the Groovy / Grails framework.\nDesigned Rule Engines Drools 3.0/4.0 Rule Engine, Blaze Rule Engine, ILOG Rule Engine.\nProficient with Java Swing, AWT, SWT, Jboss and Hibernate .\nExperienced Portal technologies e.g. Life ray, JBOSS.\nResearch about of JBPM process engine for use in the implementation of Flow Control System of People.Technologies used like Core Java, Swings, Spring 4.0 and 3.5 IOC, Hibernate 4.0, Web services.\nBuild Rest/SOAP Web Services FUSE and Apache Camel.\nUsed JAXM, Python for making distributed software applications communicate via SOAP and XMLWorked on NoSQL databases – Cassandra .Mongo db and  Kafka.\nWorked extensively with Java, Android Touch frameworks and third party API including Java mail API.\nExperienced in building automation frame works using Python.\nWorked  as iOS software development (iPhone and IPod Touch).\nDesigned and implemented  the Android applications.\nProvided technical guidance during development of Scala applications.\nManaged and reviewed Hadoop log files.\nDeveloped and implemented MapReduce jobs used Hadoop to work with Big Data.\nShared responsibility for administration of Hadoop, Hive and Pig.\nDeveloped quality code adhering to Scala coding Standards and best practices.\nInvolved in the creation and development of the AWS SDK for PHP 2Thorough knowledge of the Ruby language and Ruby on Rails framework.\nWorked  with Java(J2EE) or Python, Service Oriented Architecture methods and techniques.\nUsed native Objective-C and Java to develop state-of-the-art mobile applications for iOS and Android.\nWorked on Linux, Java, Python, Groovy, Maven, Gradle. \nWorked on  SQL and NoSQL(MongoDB, Cassandra, Hadoop,) data structures.\nExperienced worked Chef, Jenkins, Predix, WSO2, SAML, UNIX, databases, and networking.\nDesigned used a JSON or XML based web API.\nHave used Hibernate framework for Database access from SOAP Web Service.\nDesigned REST APIs that allow sophisticated, effective and low cost application integration.\nInvolved in consuming, producing Restful web services using JAX-RS.\nDeveloped JavaScript libraries for error handling, Input validation and Event Handling.\nWorked  in AngularJS supports declarative development documents. For the system integration.  \nExpert in RDBMS and NoSQL data storage technologies like MongoDB.\nInvolved in Hibernate and Spring ORM . Spring JDBC and  Spring Transaction Management.\nDesigned and developed screens in HTML, JSP with client side validations using JavaScript.\nPrepared unit test plans through applications such as Core Java, ORM and Backend Oracle.\n\n\nEnvironment: Core JAVA, JDK 1.7/1.6/1.5, GWT,J2EE, Apache, REST WebSerivces, Ajax, EJB, Spring, Hibernate (ORM), Struts, TIBCO, UNIX, Jboss, JDBC, JavaScript, JSP,HTML5, CSS3, JSF 2.0, JMS, Active MQ, Angular JS,GIT, SQL and Oracle 11g.\n\nGeneral Motors – Detroit, Michigan                                                                                    Jan2013-Mar2014\n Role: JAVA J2EE Developer\n Responsibilities:\n\nInvolved in Requirement Analysis and Technical Design meetings and have created Technical Design Documents as per the Business Requirements.\nPerformed graphs for Kafka, RabbitMQ and ActiveMQ.\nImplemented Service such as Camel Context along with a number of Component and Endpoint classes.\nCreate the Infrastructure design for PROD, Performance, Development Elastic-search environments.\nMaintained and expand our AWS infrastructure, and provided mentorship to others on my team. \nDesigned applications used Eclipse RCP framework.\nExperienced and add-on design practice, but as a core feature used by every Angular project.\nExpert in application written with the backbone.js framework along with JQuery, JQuery Templates.\nInvolved in entire software development process for all assigned android application development projects: requirement specification, design, implementation, testing and maintenance.\nInvolved in installing, configuring SiteMinder policy server, Web agents, Netegrity Transaction Minder, Active Directory server LDAP and various Web Application servers.\nDesign and manipulation of JBPM process for the client activities in order to manage the people queue for each activity.\nExperienced in API development, MongoDB, Reddis, OpenStack API development.\nExperienced in RDBMS and NoSQL data storage technologies like MongoDB.\nCloud/AMIs instances and used the best of EC2, and other cloud instances.\nWorked  in Cloud especially Amazon Web Services.\nDesigned and developed Service layer using Struts 2.0 and 1.0framework.\nAssisted in installation, assembling and maintenance of latest versions of JBoss Application server.\nTechnologies used: Scala, AWS, Akka, NoSQL technologies (such as Cassandra and Elastic Search).\nStrong Knowledge of core Java server-side programming.\nWorked with scripting skills like Python, perl, bash etc.\nExpert with the Groovy / Grails framework.\nUsed API Management solutions (e.g. WSO2 and MuleSoft).\nUsed PHP and MySQL, Oracle, ASP and Cold Fusion. Learned Ruby on Rails, business rules, SEO and other advanced tools.\nWorked with the MULE ESB platform as a Developer.\nWorked on software development using Liferay Portal.\nAngularJS provides means to create abstractions, reusable chunks of functionality.\nExperienced with web services and web development languages in Python, Java.\nDeveloped and implemented UI controls and APIs with ExtJS.\nExperienced with SQL and NoSQL(MongoDB, Cassandra, Hadoop,) data structures.\nUsed JSP, JavaScript, JQuery, AJAX, CSS3, and HTML5 as data and presentation layer technology.\nExperienced with Nodes’Js..\nExperienced in Designing, Developing and Testing complex rules in DROOLS Fusion and DROOLS CEP.\nDeveloping Ant and Maven scripts to automate the compilation, deployment and testing of Web and J2EE applications to the above platforms.\nWrote JUnit test cases for unit, integration, and functional tests, run automatically by Hudson/Jenkins in the builds triggered by each push to Git.\nStrong Knowledge working with MQ Series and JMS.\nUse Spring ORM to store JMS consumed messages into database.\nProvided estimation using internal estimation tool for the client requirements.\n\nEnvironment:  Core Java, J2EE, Angular JS,J2EE, SQL, Servlets , Struts, Unix, EJB,  JDBC, JMS, GWT, HTML5, JavaScript, DB2, RCP, Jboss, REST Web Services, Eclipse, TIBCO, Apache Camel, Active MQ,  Android, SQL, Web sphere Portal.\n\nMercury Insurance, Dallas, TX\t\t\t\t\t\t\t Aug2012-Jan2013\nRole: JAVA Developer\nResponsibilities:\n\nInvolved in study of User Requirement Specification, Communicated with Business Analysts to resolve ambiguity in Requirements document.\nParticipated in the design, architecture and development of a Java based content management system. (CMS).\nknowledge on messaging systems like active MQ, rabbit MQ, kafka.\nExperienced in Core Java, spring, Struts and Angular JS,backbone Js.\nWorked in Agile Scrum Methodology.\nResponsible for deploying enterprise applications from Admin console and enabling security using LTPA and LDAP for admin console and application components on AIX.\nTranslating business requirements into a Elastic Search implementation\nIntegrated Java and Angular based application to Elastic Search tier via Spring 4 Restful Controllers communicating to a custom java utility wrapping the Jest API.\nExperienced with the Groovy / Grails .\nWorked with the AWS Elastic Beanstalk team to provide PHP support for the platform.\nImplemented clustering and throttling concepts for mule based solutions.\nKnowledge  of Configuration of Docker Containers via Puppet etc.\nExperienced  with Java, Scala or other OO technologies.\nDeveloped virtual platforms used Cloud computing, Clustered and Memory-Grid.\nPrepared the MQ software architecture document (SAD) documents based on the requirement.\nImplemened RedHat RHDS authentication solution for ActiveMQ Fuse. Experienced with Java & Python frameworks like Spring, Hibernate, Django, Celery.\nDeveloped an AngularJS workflow manager leveraging Angular-UI's state router for flexible configuration and management of multi-step user input flows.\nUsed RabbitMQ for supports clustering, clustering is intended to facilitate scalability, not availability.\nParticipated in understanding of ExtJS technologies and development tasks.\nImplemented multiple high-performance MongoDB replica sets on EC2 with robust reliability.\nInvolved in configuration of Spring MVC and Integration with Hibernate. \nDeveloping automated process for builds and deployments using Jenkins, Ant, and Maven.\nDesigned and implemented a Cassandra no SQL based database and associated RESTful web service that persists high-volume user profile data for vertical teams..\nDevelop consumer based features and applications using Ruby on Rails.\nCreated Location Look up SOAP based web services using spring 3.0. \nUsed Hibernate for Object relational Mapping and Persistence. \nBuilt rich prototypes and applications using Backbone.js, HTML5 local Storage and CSS3. \nImplemented Test Driven Development using frameworks like Junit, Selenium. \nUsed Maven for building applications. \nDeployed applications on Web sphere 8.5 and Tomcat during development.\n\nEnvironment: Core Java, JSP, J2EE, GWT, E-Commerce, Servlets, Spring, Struts, Angular JS, SOAP & REST WebSerivces, WSDL, JDBC, Hibernate (ORM), JSF, UNIX, EJB, Eclipse RCP, XML, JAXB, GIT, Junit, Maven, PL/SQL, Power Shell, Oracle 10g, Tomcat 6.\n\n\n\n\nSprint Nextel - Herndon, VA\t\t\t\t\t\tSept2011-Aug2012\nRole: Java Developer\nResponsibilities:\n\nInvolved in business requirements gathering, use case analysis and application design strategies.\nInvolved in full Stack web development like Angular JS.\nWorked with Object oriented programming (Java, Scala) and common design patterns.\nKnowledge ofAngularJS supports automated testing via pervasive dependency injection - not merely.\nResponsible for developing batch jobs applications to generate Key Performance Indicator reports in CSV file format using Java, XML and developed DAO’s to abstract business logic from data access using transaction management module and batch in Spring framework.\nDeveloped the custom web application implementing MVC Architecture, iBatis and spring frameworks. \nResponsible for developing business logic to retrieve voice messages to handsets by encoding to QCELP format to handset specific format like OGG and compose and forward messages from the handset. \nImplemented various J2EE Design patterns like Singleton, Business Delegate, and Transfer Object.\nResponsible for developing user Interface using Junit, Servlets, JSP, HTML, JavaScript to conduct unit testing as well as end to end testing.\nAttended and worked with agile scrum standup meetings.\n\nEnvironment: Core Java, J2EE, JDK 1.5, Angular JS, Hibernate(ORM), JSP, JSF, SDET, Unix, Servlets, Spring, MQ, Junit, iBatis, Web, JavaScript, Struts, HTML, ,CSS, XML, Eclipse IDE, Oracle 10g, Windows 7/XP, CVS.\n\nWells Fargo – Seattle, WA\t\t\t\t\tOct2010-Aug2011\nRole: Java/J2EEDeveloper           \nResponsibilities:\n\nDeveloped a GUI interface to administer a hardware application using XML/XSL transformations and JavaScript.\nExtensively used OOD concepts in overall design and development of the system.\nDesigned and Implemented the J2EE / Struts with JDBC in Eclipse IDE.\nWork directly with management, vendors, and third parties to ensure database management applications operate at peak efficiency.\nExtensively worked on Java server side programming using Servlets, and JSP. CSS is used to style Web pages, XHTML and XML markup.\nImplemented Servlets to handle HTTP requests for on-line requests, credit card payments, registration and bug tracking.\nUsing XML for dynamic display of options in select box and description on web page.\nAsynchronous messaging is done using JMS and created Queue for point – point messaging.\nREST based Web Services are used for accessing flight and hotel information’s.\nDesigned complex application database SQL statements for querying, updating and reporting using JDBC.\nDeveloped Junit test cases and performed integration and system testing.\n\n\nEnvironment: Core JAVA, J2EE, Angular JS, XML, UNIX, Rational Application Developer (RAD), Servlets, Java Script, JSP, CSS, JDBC, Struts1.2, SOAP, SDET, Eclipse3.2 with My Eclipse, PL/SQL, CVS, Junit, Web Logic, Windows.\n\n\n\n\n\nAT&T Middle town NJ\t\t\t\tMar2009 – Sept2010\nRole: Java web developer\nResponsibilities:\nCoordinated with team members in gathering system requirements and specifications required for the redesign.\nDesigned and developed the Application based on Model-View-Controller architecture.\nInvolved in analysis, design, Coding and development, Implementation phase of the modules.\nCreated external XML documents.\nWorked on JAVA J2EE team and designing DAO interface and implementation.\nInvolved in Bug Fixing (Debugging) of the application.\nInvolved in Developing User Interfaces using HTML and JSP's.\nDeveloped and published web-services using WSDL, SOAP and XML, JAXB.\nImplemented Web-Services to integrate between different applications (internal and third party components using SOAP and RESTFUL services).\nDeveloped web pages with JSP and Servlets using HTML, JavaScript, AJAX, and XML.\nUsed Apache Ant as the software build tool.\nUsed Apache Maven for the over-all software project management.\n\nEnvironment: Core Java, J2EE, HTML, MVC, JavaScript, JSP, Servlets, SOAP, WSDL, spring, CSS, UML, XML, HTTP, Eclipse, MVC, AJAX, Apache Maven.\n\nInformative tech - INDIA\t\t\t\tMay2007–Mar2009 \nRole: Jr. Java Developer\t\t\nResponsibilities:\nDeveloped a website where user can login and enter their personal information.\nDesigned tables in the database to store the user data gathered from the online forms.\nUser data is stored in Database and available when the user log’s in again and can modify the data.\nCreated Queues for each specific type of certificate.\nDeveloped a communication between the local databases with the central database to validate the credibility of the applicant.\nCreating and maintaining databases which include configuration, query optimization and de-normalization.\nEnvironment: HTML, Java, SQL.\nEDUCATION:\nBachelors in Computer Science and Engineering, \n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "bash",
        "cassandra",
        "communication",
        "css",
        "django",
        "docker",
        "ec2",
        "git",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "leadership",
        "mongodb",
        "mysql",
        "oracle",
        "php",
        "problem solving",
        "project management",
        "python",
        "ruby",
        "ruby on rails",
        "scala",
        "scrum",
        "sql"
    ]
}