{
    "id": "resume_77b07408-43dd-4f2a-89f2-558981f74d94",
    "metadata": {
        "filename": "KY BA PM UPDATED RESUME .docx",
        "processed_date": "2025-09-24T08:45:43.075971+00:00"
    },
    "raw_text": "KETHANA Y\nRole: BUSINESS ANALYST/PROJECT MANAGER\nCERTIFIED SCRUM MASTER-License 752763\nEmail: ajay@appsboat.com\t\t                                                         Phone: 214-501-6784\n\nPROFESSIONAL SUMMARY:\nA techno-savvy Business Analyst with out-of- the-box thinking and 5 successful years of experience in Business Analysis, Business Modeling, Requirement Gathering, Technical Documentation and Data Analysis. Domain experience comprising Healthcare, Banking with strong expertise in all phases of the Software Development Life Cycle and a firm understanding of the technologies involved. \nExperience in interacting with business teams, programmers and technical staff at all levels. \nStrong ability to elicit, document, validate and transform business requirements at various stages of software development life cycle (SDLC).\nExtensive success in translating business requirements and user expectations into detailed specifications employing Unified Modeling Language (UML).\nStrong business analysis skills and an understanding of the software development life cycle (SDLC) utilizing Rational Unified Process (RUP). \nExtensive knowledge in working with various project management objects like SWOT analysis, Cost Benefit Analysis, Scheduling, Resource planning, Critical path Method, Risk analysis and Risk Management.\nGood at communicating effectively with Stake holders, Top level Management, Stakeholders, SME’s, Tech leads and Business users.\nCreated Dashboards for cognos portal for everyday access and easy identify of history and projections.\nExperience with MS Office products experience including MS Word, Excel, Access, power point. \nInterpret client's business rules into SQL commands that help in the creation of databases that store customer information.\nBusiness analyst and data analyst on Guidewire conversion upgrade from Claim Center version 5 to Claim Center version 8. \nExposure in creating and analyzing data flow diagrams, and entity relationship diagrams, and worked as expert to drive future growth of the cash management product set, policies and procedures.\nOrganized JAD and JAR sessions to gather requirements at various stages. Good understanding of project process and ability to analyze business problems and identify solutions. Worked extensively with the team to meet business requirement, create prototypes and analyze workflow. \nProfessional with interpersonal, analytical and team work skills. Effective communication both verbal and written skills. Strong Presentation and Leadership Skills.\nStrong experience in creating Requirement Traceability Matrices (RTM) to trace the requirements\nthroughout the design, use case, development and testing lifecycle.\nCreated visualizations using custom hierarchies, groups and merged data from multiple sources using the data blending technique within the tableau workbook. \nPerformed online banking, made cash deposits, managed petty cash, balanced register.\nWorked closely with project stakeholders, SMEs, and staff to understand the requirements and specifications for new applications along with enhancements to the existing applications.\nElicited requirements from stakeholders, vendors, consultants, subject matter experts and existing system users using various techniques like JAD sessions, brain storming, one on one. \nResearch, gather, and analyze content data and information, to include formatting and reformatting, reviewing, revising, cataloging, and electronically storing for future retrieval. \nHands-on experience with process modeling techniques using UML - Use Cases, Work Flow Diagrams, Data Flow Models, Swim Lane Diagrams, Sequence Diagrams and Activity Diagrams using MSVisio.\nExcellent communication, client relationship and customer service skills. Responsible, self-motivated and organized.\nTECHNICAL SKILLS:\n\nWork Experience:\n\nClient: Merchant e-solutions, Redwood City, CA\nRole: Sr. Business Analyst/Project Manager                                 Duration: March 2017-Till Date\n\nDescription: It is a national sales executive responsible for national sales of Credit Card Processing solutions specific to the business to business transaction.\n\nResponsibilities:\nResponsible for defining the scope of the project, gathering business requirements and documenting them.\nConducted Daily Scrum meeting, Planning Sessions, Backlog updates, User Stories updates, Continuous Testing.\nCoordinated with business users, architects and developers to create business case document, concept proposals, and process workflows. \nIdentified defects, documented Business Requirement Document and collaborated with Subject Matter Experts and Managers to identify an optimal solution.\nFacilitated requirements elicitation sessions with product owners and stakeholders for new software features.\nMaintaining existing cognos reports and making necessary changes as requested.\nConducted JAD sessions for each assignment, held SME interviews, gathered requirements and created use cases. \nCreation and updating our Source-to-target mapping documents.\nImplemented Guidewire claim center for the client Merchant e-solutions.\nInterviewed the Subject Matter Experts (SME) by asking detailed questions.\nDeveloped SQL Queries to fetch complex data from different tables in remote databases using joins, database links and Bulk collects.\nResponsibly maintain and operate ETL process in support of job issues. \nPerform extensive Data Analysis, Data Requirement Analysis and Data Mapping.\nExtensive experience in installation, configuration and upgradation of various versions of Tableau Desktop/Server.\nGeneration of dashboards with calculated fields, Filters, Groups, Parameters and Sets to handle views more efficiently in Tableau.\nDesigned the Data Warehousing ETL procedures for extracting the data from all source systems to the target system. \nExtracted, discussed, and refined business requirements from business users and team members.\nDesigned and developed project document templates based on SDLC methodology.\nCreated UML diagrams such as Activity Diagram, Sequence Diagram and Use Case Diagram to depict the various processes flow using MS VISIO. \nPerformed Feasibility Analysis and SWOT Analysis.\nUsed google docs for project management and delivery.\nWrote PL/SQL statements and stored procedures in Oracle for extracting as well as writing data.\nAssisted Quality Assurance (QA)/Testing Team in creating test scenarios, scripting test cases using testing and defect management tools.\nMonitored the progress of projects using MS Project and took appropriate action to ensure that they keep up with the schedule. \nCreated PowerPoint presentations incorporating MS Office Suite, Excel, Word and Access.\n\nEnvironment: SQL, Windows XP/2000, MS word, MS power point, MS Excel, MS project, MS Access, MS Visio, MS outlook, UML (2.0), Waterfall, Rational Rose, Requisite Pro, Clear Case, Rational Clear Quest.\n\nClient: Lille Systems, San Jose, CA      \nRole: Business Analyst/Project Manager                          Duration: September 2016 – February 2017\n\nDescription: LILEE Systems, an Inc. 500 award-winner, is capitalizing on the growing market for providing secure and reliable connectivity for IoT and Fog Computing. LILEE’s fog computing platforms enable a higher level of customizable services which can be deployed to enhance safety, grow ridership, improve customer satisfaction, increase operational efficiency, and seamlessly interconnect IoT applications in the Smart World.\nInteracting with business users and client to understand the requirements to fill the gap between technical and business teams.\nPreparing the technical mapping sheet, functional spec, gap analysis, design document, data modeling sheet, test cases document for streamlining the existing process of deliverable.\nDeveloped customized cost reports based on business needs and comprehensive reports for decision making purposes.\nDocumented processes (in MS Visio), and supported internal and external audit efforts involving cross-functional collaboration and educational sessions.\nKey responsibilities included planning and forecasting, cost monitoring, monthly reporting, technical training, regulatory analysis, and process improvement.\nManaged implementation of a new accounting structure for standardize reporting, and the use of a SharePoint to streamline and centralize interactions with over 400 end-users.\nLearned the energy and utility domain in no time and acknowledged by clients in a small span of time.\n\nEnvironment: XP Operating Systems, Windows, Word, Excel, and Power point, Visio, HP Service Manager, Verint 360 WFM, Desktop Process Analytics and Avaya Unified Communications.\n\nClient: United HealthCare (UHC), San Diego, CA                                 \nRole: HealthCare Business Analyst                                                    Duration: Aug 2015 – Aug 2016\nDescription: UHC is a Preferred Provider Organization (PPO) that has created a network of physicians, hospitals, and other healthcare providers with the goal of offering affordable healthcare services. I worked on Claims processing module of the Group Approval Process (GAP). The claims processing module involved Receipt and Verification of Claim Forms (837) and Claims Attachments (275), Claims Enquiry and Response, Adjudication, Healthcare Claim Payment/Advice as per HIPAA guidelines.\nResponsibilities:\nWorked in close collaboration with the Project Manager and business users to gather, analyze and document the functional requirements for the project.\nWorked in Healthcare Claims Administration – Healthcare Claims and Processing (837/835) includes facility claims and professional claims.\nDeveloped a conclusion using analytical and graphical methods for different cases utilizing STAAD Pro and MS Excel.\nWorked with a cross-functional team of Business Development, Product Support in the analysis of Business Needs, information input/output requirements, process and data flows, as well as report format and content Facilitated JAD sessions for communicating and managing expectations with customers were going to be the final users of the product.\nUsed cognos Connection for organizing, security, scheduling and distributing reports. \nConducted detailed requirements gathering sessions related to data analysis, data mapping to lock down acceptance criteria.\nResponsible for gathering requirements and developed Requirement Traceability Matrix (RTM), writing functional specifications.\nExtracted data using SQL.\nContributed in the database design with ER-models.\nResponsible for feature enhancement and performance tuning in both SQL Server and MS Access environments.\nDeveloped use case diagrams, use case models, state diagrams and class diagrams based on UML methodology. \nPerform Gap Analysis for analyzing the gaps in key metrics utilized in existing Dashboards.\nResponsible for various deliverables throughout the software development lifecycle from process flow diagrams to mock-ups and wireframes.\nEnvironment: MS Visio, UML, SQL, MS Word, MS Access, MS Excel, cognos, Waterfall, Rational Rose, Requisite Pro, Clear Case, Rational Clear Quest.\n\nClient: Cipla Global Limited, India                                       \nRole: Project Manager/Business Analyst                                       Duration: June 2013-july 2015\n\nDescription: Cipla global limited is an Indian multinational pharmaceutical and biotech company, headquartered in Mumbai. Cipla primarily develops therapeutics to treat cardiovascular disease, arthritis and depression. The project involved development of a centralized web-based database called EDR (Electronic Data Reserve) to be used by various members for generating reports and data from different departments. The application allowed researchers and scientists to store and retrieve data as and when required.\n\nResponsibilities:\nOrganize and track activities ensuring project successfully completes on time and within budget.\nFacilitate business requirements-gathering and review. Ensured all project documentation is kept up to date and communicated to the relevant stakeholders on a timely basis. \nInvolved in multiple phases of SDLC for enterprise level projects, as a client facing consultant, with a focus on the Microsoft platform. Responsible for leading and supporting various projects, as a trusted advisor, for publicly traded clients in a Waterfall and Agile environment. \nDeveloped process flow diagrams (flow charts) using MS Visio to identify and analyze process flows.\nGathered user and business requirements through open-ended discussions, brainstorming sessions and role-playing.\ncreated and maintained the requirement traceability matrix (RTM) and performed impact analysis.\nCreated project plans, taking into consideration projects mission, process flow, timelines, requirements, and documentation.\nManaged workload, schedules and coordinated status review meetings with project managers, business managers and team members.\nConducted presentations during meetings, took meeting minutes, created action item tracking items, communicated with internal and external stakeholders, and setup phone calls.\n\nEnvironment: MS word, MS power point, MS Excel, MS project, MS Access, MS Visio, MS outlook, UML, Waterfall, SQL, Windows XP, Agile.\n\nEducation:\nMaster of Science in Computer Science-Colorado Technical University, CO.\n\n\n\n\n\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "data analysis",
        "leadership",
        "oracle",
        "project management",
        "scrum",
        "sql",
        "tableau"
    ]
}