{
    "id": "resume_ebfa36f5-c767-4763-805d-fe7998046b78",
    "metadata": {
        "filename": "Madhuri Pawar.docx",
        "processed_date": "2025-09-24T08:45:43.130943+00:00"
    },
    "raw_text": "Madhuri Pawar\n484 754 6872\nmadurichand@gmail.com\n\nSUMMARY:\nOver 7+ years of experience as Senior Business Analyst working in diverse work environment within the Healthcare industry. Excellent communication, writing and presentation skills. \nExperience in Business analysis, specializing in requirement management, uses cases and project coordination. Skilled in eliciting user demands, managing user requirements and translating them to functional and design specs.\nStrong expertise as an Analyst in Health Insurance, Mortgage, Health Care & Medical and Financial domains. Proficient in creating Requirement traceability matrix, workflow diagrams and UML based documentation. Knowledge of ICD 9, ICD 10, NCPDP and HIPAA EDI transactions (4010, 5010).\nHas (3+) years of experience in EDI/HIPAA and Facets (benefits enrollment, claims processing etc.,)\nExperience working with Stakeholders, Business Owners and Senior Management. Hands on experience in analyzing the business needs, gathering requirements, identifying opportunities for improvement, and designing systems and application for various organizations.   \nSolid knowledge and understanding about phases of Software Development Life Cycle (SDLC) including several Methodologies like Waterfall, Agile, Spiral, RUP, and SCRUM. \nHighly skilled and experienced with gathering requirements, well acquainted with use of several elicitation techniques like JAD, Brainstorming, Focused Group and Prototyping.\nExperienced in developing UML use case diagrams, work flow diagrams, data flow diagrams, flowcharts, screen mockups and report prototypes using dynamic UI with HTML, MS Visio.\nHands on experience in research article review, data analysis and statistical analysis through computerized medical databases such as PUBMED, MEDLINE, COCHRANE, CINAHL. \nExperienced in capturing of client's business/high-level/functional requirements and business processes from different categories of internal as well as external stakeholders like business, SMEs, process heads, Real-time or field service user and project managers.\nExperienced in creating requirement artifacts, Business Requirement Document (BRD), System Requirement Specification (SRS), Use Case, Functional Requirement Documents (FRD), and Change Request Planning (CRP). \nStrong project management skills like Planning, Budgeting with requirement analysis, GAP Analysis, SWOT, Risk Analysis & Risk Management. \nCreative thinker, excellent communicator, strong team player and an organized professional.\nExpert level skills in MS Office products and other tolls including MS Project, MS Word, MS Power Point, MS Visio, MS FrontPage, MS Excel.\nWell versed with testing methodologies and performing Gap Analysis. Dynamic and Assertive team player with excellent written and communication skills.\nTECHNICAL SKILLS:\nSoftware Development Life Cycle principles (SDLC) – Agile, SCRUM, Waterfall.\nMS Office Suite, RTM, UML, SWOT, Gap Analysis, Risk Analysis & JAD.\nEMR & HER systems (NextGen, EPIC systems, RPMS, Dentrix, BMW, Athena) \nDatabases: MS SQL, MS Access, Oracle.\nSKILLS HIGHLIGHTS:\nKnowledge of HMOs, Medicare, and Medicaid\nElectronic Medical Record (EMR) software’s\nKnowledge of ICD-9 and ICD-10 codes\nKnowledge and hands on experience with Electronic Health Records (EMR)\nKnowledge of HIPPA Standards, Healthcare Claims Processing, Reimbursement\nStrong knowledge about health insurance policy pricing, eligibility, benefits & authorization\nWell acquainted with concepts like Coordination of Benefits (COB), Co-insurance, Explanation of Benefits (EOB), In & Out of network benefits\nPROFESSIONAL EXPERIENCE:\n\n Billing Service,                                     \t       Oct’2016– Current\nSr.Healthcare Business Analyst\nDescription - This Project is about to implement the Automated Adjudication System, which deals with different phases of claim process such as Intake Phase, Adjudication Phase and Reporting Phase. Implementation of ACAS (Automated Claim Adjudication System) must have to comply with HIPAA Rules and Regulation of privacy and security. Implementation of ACAS to generate automated Claim Submission, Processing and creating a report.\nResponsibilities:\nParticipated in Business Modeling by understanding the needs of the business, and also documenting Business Use Cases as well as System Use Cases.\nGathered Requirements and documented the proposed additional extension to the existing HIPAA application.\nFacilitated Joint Application Development (JAD) sessions with the Management, Mainframe and HIPAA team to make sure everyone is coordinated with the business requirement processes.\nWorked on HIPAA Transactions 270, 271, 276, 277,834, 835 and 997.\nInvolved in HIPAA 5010 gap analysis of ANSI X12 4010 and ICD 10 initiatives.\nUsed MS Visio to create Use Cases and Sequence Diagrams.\nAccomplished experience through whole SDLC from requirement analysis till deployment, using highly efficient RUP process of Software development.\nAssisted development team to translate requirements into technical specifications.\nLiaised and Coordinated in resolving EDI mapping issues arising from data transfer process from EWM to ACAS and third-party systems.\nAnalyzed mandatory and the situational fields and compared with the user manuals for EDI.\nWorked closely with the host (Main frames support person) and helped him understanding the process and in the creation of the match, input and the delete files.\nCreated and Maintained the Requirement Traceability Matrix (RTM).\nInitiated Test Plans, developed and executed test cases and scenarios, worked with users to develop specific acceptance criteria, and prepare test exhibits.\nConducted User Acceptance Testing (UAT) sessions with business users and prepared document for enhancements and bug fixes.\nUsed Test Director and  to report any bugs found and communicate to the developers and product support team.\nAnalyzed and evaluated User Interface Designs, Technical Design Documents and Quality Assurance Test condition the performance of the application from various dimensions.\nHelped create the ‘Business Glossary’ to facilitate efficient understanding of the Business process amongst the other teams.\n Environment: MS Visio, MS Project, WIN XP, HIPAA, MS Office Suite, Quality center, RUP & UML, Share Point, Medicare, Medicaid. \n\nCIGNA Healthcare,                                                               Sep’2015-Aug’2016\nSr. Business Analyst \nDescription: The project objective is building fully insured on Facets to deliver a common solution set i.e., simplify our message with a product offering that best meets the needs for the Select segment and delivering a core administrative system that can prioritize deliverables for Select with reduced costs and cycle times. This involves enhanced quoting capabilities and customer presentation packages.\nResponsibilities: \nDetermined what information is needed to support the organization's business activities and to measure its performance.\nFormally documented requirements what the business users require from the system or application to meet the business objective and to solve business problem. \nResponsible for determining requirements specific to the project deliverables.\nRequirements once agreed upon are tracked throughout the life cycle of the project.\nFollowed Basic Waterfall Methodology in the implementation of various phases in the SDLC.\nDefined business requirements to address competitive gaps in our current quoting process and customer presentation package. Scope includes: quote turnaround time and the ability to allow sales and the broker to rapidly adjust defined benefit features to meet client needs/desired price point.\nWorked on FACET claim processing system.  Worked on FACET modules such as pricing, payer, eligibility under claims processing system.\nGathered Requirements to enhance front end benefit design/quoting capabilities i.e., customer presentation quote package include ASO and fully insured new and renewing business.\nDocumented High-level requirements from requirements gathering sessions that are essential to dive deeper in gathering detail level requirements.\nWorked with the Product Manager and requirements analyst to detail the specification of project deliverables throughout the project lifecycle.\nAttended Steering Committee meetings to estimate the Impact and necessity of the scope of the project.\nFacilitated daily Stand-Up meetings to ensure that right requirements are being analyzed, gathered, documented, and implemented as per the business rules.\nConducted meetings with developers, and testers to collaborate resource allocation and project completion tasks.  Active participant in discussions, solution creation and risk assessment.\nResponsible for clarifying/refining business requirements created by the Work Teams. \nGathered existing end-to-end business workflows so you can pinpoint what Fully Insured could do to change those.\nReviewed and prioritized requirements that occur internally within track.\nActively participated in Requirement review session – with all members of track one that occur every week.\nCreated a Requirements Template using Microsoft Visio which provided a format for our teams to document the requirements.\nCreated a draft version of the Fully Insured PRD for our and other team members to review.\nThe solution implemented provided the level of automation that is at least as good as current state.\nEnvironment: SDLC, MS Office tools, MS Project & MS Visio, Facets 4.81 & Facets interfaces (IFOX).\n\nDuPont,                                                                          \t\tDec’2014-Aug’2015\nBusiness Analyst\nDescription: DuPont is one of the world's most innovative companies. DuPont offers a wide range of innovative products and services of which Medical Device Materials is one of them. DuPont products advance better health care by helping protect people improving their health with medical and pharmaceutical devices. The featured applications include flexible and durable design, complex part design, and precision molded parts. A web Application was developed to assist the personnel in collecting the information from the system out of materials provided.  \nResponsibilities:\nLead Business requirements sessions by conducting meetings with stakeholders and business users. \nPerformed GAP analysis of client requirements and generated workflows to assist with TO-BE design.\nStudy and analysis of the mapping document indicating the source tables, columns, data types, transformations required, business rules to be applied, target tables, columns, and data types.\nExtracted data from multiple sources which include relational sources and flat files.\nDocumented High-level requirements and developed use cases. Performed use case analysis using UML, which provided the framework for potential use case deliverables. \nDeveloped an analysis model that included use case diagrams, and activity diagrams using Microsoft Visio that provided development team a view of requirements for construction phase activity. \nCreated Screen Layouts utilizing the MS Power Point by specifying what the existing and final screens look like because of this project.\nProduced database design which includes the creation of Entity-Relationship diagrams and traceability matrices.  Involved in Creating New Enhancements through Change Control.\nDiscussed test cases and test plans to select test data for software testers. \nTracked all the UAT Defects utilizing the  tool.\nParticipated in various meetings and discussed Enhancement and Modification Request issues.\nProactively involved in analyzing challenges associated in integrating the client systems located in different geographical areas. \nCreated complex and sophisticated Reports that had drilldown, slice and dice features using Cognos Report Net.  Involved in UAT to validate the functionality with the requirements.\nEnvironment: MS Office Suite, GAP Analysis & UAT & Cognos.\n\nSutherland Global Services,                                                                     May’2010-Nov’2014\nSr. Business Analyst\nClients: St. Mary’s Hospital (Lexington, KY), Wake Forest Hospital (Winston-Salem, NC) and Massachusetts General Hospital (Boston, MA).\nDescription: Sutherland Global Services is an innovative leader in the health and well-being industry. The project dealt with enhancements to the Healthcare Payment EDI transaction set to generate a payer level containing payer specific information. Implementation of the Automated Clearing House Origination software to generate NACHA compliant files that adhere to all NACHA standard entry class codes at a multi payer level to further penetrate the provider market with electronic payments and statements. \nResponsibilities:\nWorked with Business users and technical lead for gathering requirements and data transaction information.\nWorked in a team for Claims processing and was involved in prioritized claims, identified problems, prepared an action plan, implemented the solution, identified claims outside the benchmark.\nCreated the business process model using MS Visio and present it to SME’s for validation and getting the sign-offs. Document testing process flows using Visio flow-charting.\nGathered requirements and analyzed requirements for documenting reports which spotlights payer’s performance.\n Identified Claims Management work flows, business rules and developed flow charts and activity diagrams.\n Participated in Billing System Process Flow analysis and identified revisions to the billing system documentation.\nPerformed data quality analysis on data by writing queries to ensure data integrity across tables in DB2 database environment.\nDocumented System Design Documentation (SDD) describing the systems requirement, operating environment, files and database design, input format, output layout, detailed design.\nAnalyzed customer needs and existing functions in HIPPA transactions to determine feasibility, consistency with the established scope of work.\n EDI experience with X12 transaction sets 835, 837, 270/271.\nResponsible for mapping of ICD9 to ICD10 and did testing for 270/271, 837I/P/D, 835R transactions to migrate to HIPAA 5010.\nConfigured FACETS to adhere to customers work flow for claims processing, claims automation and group administration.\nWorked on Medicare, Medicaid, HMO, Workers Compensation, and commercial insurance claims. \nPerformed insurance pre-certification, pre-authorization, and verification. \nResearched and resolved incorrect payments, EOB rejections, and other account issues. \nSubmitted secondary claims. Insurance follow-up and resubmission.  Knowledgeable in timely filing rules. Met or exceeded productivity and the quality goals.  Team management, work assignment and monitoring.  Developed strategies for insurance A/R reduction.\nIdentified trends in insurer payment delays to improve follow-up methods.\nInduction of new staff and integrated them into the project team. \nTrained individuals/team on new procedures, new systems, plus remedial training.\nWorked with EPIC, Envision Meditech, PATCOM, Eagle and other hospital systems. \nAudited accounts for team members.\nEnvironment: FACETS, Facets extensions, MS Visio, ICD9, ICD10, HIPPA, Claims Processing, EOB, COB, AR\n\nEDUCATION:\n (2010) \n",
    "extracted_skills": [
        "agile",
        "communication",
        "data analysis",
        "html",
        "oracle",
        "project management",
        "r",
        "scrum",
        "sql"
    ]
}