{
    "id": "resume_97e81fb1-3c9e-4964-9c19-82e3e6b030a4",
    "metadata": {
        "filename": "Mahesh_Kamath_PM (1).docx",
        "processed_date": "2025-09-24T08:45:43.445587+00:00"
    },
    "raw_text": "Mahesh \nProject Management\nPhone: +18327758735\nE-Mail: asmith@nichesoftsolutions.com\nAn accomplished professional, aiming for challenging middle / senior level assignments in Product/ Program Management, Quality Assurance, People management with an organization of high repute in IT industry\n\nPROFILE SNAPSHOT\n\nA dynamic professional with 17 years of experience in:\n ~Program Management  \t\t             ~Software Testing \t\t\t~Project Management\n~Quality Assurance \t\t\t             ~Client Relationship Management\t~Liaising & Coordination\nProficient in planning and executing projects with a flair for adopting modern methodologies in compliance with the quality standards\nExpertise in creating and sustaining dynamic environment that fosters development opportunities and motivates high performance amongst team members\nResourceful in analyzing valid test conditions, design & documents, relevant test scenarios and test cases to effectively execute the software \nEfficient in assessing resource requirements and preparing logical set of prioritized test breakdown for test execution\nInterfacing and mapping requirements of clients & Suggesting most viable Solutions/ Products thereby cultivating relations with them for maximum retention\nAn effective communicator with strong negotiation, team management and analytical skills \n\nCORE COMPETENCIES \n\nImplementing quality standards for various Operational areas and ensuring high-quality customer experience\nperforming entire gamut of tasks right from planning, monitoring & controlling phases of project lifecycle and resource planning\nHandling Risk and Change Management, Reflection, Processes, Agile/ Waterfall Development & Scrum Methodologies.\nIdentifying & analyzing defects, questionable, functions, errors, inconsistencies in software programs by performing Root Cause Analysis and troubleshooting the same to avoid further escalation\nEnsuring establishment of environments, necessary connectivity & data for testing\nAssessing &mapping client’s requirement, Translating them Into Techno – functional specifications and designing customized solutions for the same\nCreating& monitoring database backups and ensuring smooth operations \n\nExpertise:\n\nGood knowledge in Configuration and Change Management\nStrong Project Management, Program Management and Client Interaction skills\nExperience in Requirements Gathering, Developing Statement of Work & Change Requests, Automation Test Framework, Developing Test strategy, Defining Defect Management processes, Test Effort Estimation, Test Schedules, Traceability Matrix, Test Design, Manual & Automation test scripts, Test Execution & Metrics Reporting\nExperience in Leading Manual, Automation & Performance testing projects\nExperience in Defining and Implementing Quality Assurance Processes\nExpertise conducting analysis of the various paths a software program can go and develop a software testing strategy that addresses all possibilities \nHands on Experience in Coordinating between cross functional teams across the globe\nInvolved in all phases of SDLC and good knowledge in Agile Methodologies like SCRUM and Test-Driven development etc.\nExperienced in complete project life cycle development including Analysis, Design, Coding, Unit Testing, Integration Testing, System Testing, UAT & Maintenance.\nHighly proficient in using the defect-tracking tools like HP Quality Center, HP ALM and Rational Clear Quest\nInvolved in creating Project Software Process Handbook, Risk Plan, Task Tracking, Project Status reports (Daily, Weekly and Monthly), Training Plan, Resource Plan and Project Metrics.\nStrong problem solving, judgment and decision making skills\nExperience in Documentation of testing procedures using \nExcellent organizational skills, ability to prioritize and work independently on multiple ongoing tasks\n\nORGANIZATIONAL EXPERIENCE\n\nMar’17 – till date\tNICHE Software Solutions INC. Texas USA\n \nMay’10 – Mar’17\tHewlett Packard Software India Pvt. Ltd., Bangalore as QA Manager (Project, Program and People) @ USA\n\nOct’05 – May’10\tIBM India Pvt. Ltd. (ISL), Bangalore\nGrowth Path:\nOct’05 – Apr’08\tQA Lead\nApr’08 – May’10\tQA Manager (People & Project) \n\nJul’01 – Oct’05\tIBM, Lenexa, USA \nGrowth Path:\nJul’01 – Sept’03\tSoftware Engineer\nSept’03 – Oct’05\tSenior Software Engineer\n\n\nJan’01 – Jul’01\t\tINFORMIX Software Inc., Lenexa, U.S.A. as Software Engineer\n\nNov’99 – Jan’01\t\tINFORMIX Software India Pvt. Ltd., Bombay as Software Engineer \n\nKey Result Areas:\n\nPerformed functional testing of the new features of DB2\nHandling automation of the installed scenarios\nConducted analysis of the customer encountered defects and coming up with new scenarios based on this input and creating customer like setup in the Lab\n\nHighlights:\n\nSuccessfully maintained Zero Attrition in the team for 16 Quarters in HP \nQuarterly Award for Zero Attrition in the team in HP Software\nAppreciation from senior management on the GUI portion automation for IDS installation in IBM Lenexa\nAppreciation from the manager during the Install Automation / Testing in IBM Lenexa\n\nPROFESSIONAL QUALIFICATION\n\n1996\tB.E. in Electrical and Electronics Engineering from Malnad College of Engineering, Hassan, Karnataka, University with 1st Class (Achieved Distinction)\n\nCERTIFICATION\n\nCertified Scrum Master Training from Good Agile Pvt. Ltd.\nIBM- certified DB2 DBA\nCompleted Basic Blue for New Leaders Certification from IBM \n\nTRAININGS \n\nCompleted:\n4 days training in Leader Readiness Lab, Online SimPm and SWG Leadership Training from IBM\nBullet Proof Manager Training from Crest Com\n\nIT SKILLS\n\nLanguages\t\t:\t'C', Shell & Perl Scripting\nRDBMS\t\t\t:\tInformix Dynamic Server (IDS) Internals, DB2 Internals.\nOperating System\t:\tUNIX (Solaris, HP-UX, AIX, Linux, NCR, ZLINUX) Windows, DEC ALPHA, zOS\nTools                              :\tClearCase, ClearQuest, Debugger, Workshop, 2gen tools, Rational Functional Tester, Automated Test Manager, rtest infrastructure, Product Tracking System, HP Quality Center, HP Application Life Cycle Management (ALM)\n\n\n~ANNEXURE~\n\nPROJECTS HANDLED\n\n\nTitle \t\t:\tApplication and Performance Monitoring\nOrganization\t:\tNICHE Software Solutions INC. Texas USA\nDesignation\t:\tProject Manager and QA Manager \nPeriod\t\t:\tSince March ’17 till Date \nDescription       :\tThe project involved an application and performance Management Software for facilitating Administration Work. \n                                            \nAs a QA and Project manager I Extensively used HP Application Lifecycle Management (ALM) on a daily basis for Project Planning, Traceability of requirements and defects, Quality Assurance, Release and cycle management. We followed agile methodology, tracking of the release is managed using ALM. As a QA manager I used to generate these metrics and present to various stakeholders on regular basis. \nRole\t\t:\n\nLeading QA Team of 8 Members with multiple projects getting executed in parallel.  \nBusiness Use case Analysis and creation followed by FSD formulation in DevOps life cycle.\nDay to day interaction with various functional teams, developing design document, performing debug and mainline build and   release activities.\nWorking with Scrum teams to manage product backlogs and user stories for monthly build and release testing.\nParticipating in velocity estimation and actively monitoring projects using Scrum methodologies.\nDefect status and triage with cross functional teams on regular basis\nMentoring the new team members\n\nTitle \t\t:\tHP OM Smart Plug-Ins and Operations Bridge Reporter - QA\nOrganization\t:\tHP Software India Pvt. Ltd., Bangalore ( Onsite, USA)\nDesignation\t:\tManager (Program, Project and People)\nPeriod\t\t:\tMay’10 – Mar’ 17\nDescription:\tThe project involved an application and System Management Software for facilitating Administration Work. It is installed on OM Server and deployed to managed nodes and uses Agent for communicating between Server and Node. Alerts for fault, performance, security, availability issues and reports in the form of messages, reports, graphs, service navigator and helps to configure the application. It efficiently monitored distributed enterprise-wide applications/system environments from a central, best-in-class console. The SPIs helpedin increasing availability and performance, visualize capacity shortages & trends and lower the overall cost of maintaining environments. HP Operations Manager has the capability to monitor the application/system performance.\n\nRole\t\t:\n\nLeading QA Team of 12 Members with multiple projects getting executed in parallel\nLeading the QA team of 8 Members and Program Management for Operations Bridge Reporter\nHandling the projects from the initial phase till the completion of the project\nPreparing detailed test plan and strategies\nDefining the scope of testing within context of each release\nMonitoring the current project Quality Status by getting all the Quality Metrics and presenting the data in Program meetings and communicating to all stakeholders\nCommunicating allrelated risks and devising mitigation plan for the same while updating the progress to all stakeholders\nCollaborating with the Cross Functional Teams (Development, Documentation and other teams)\nPerforming Individual Development Planning for employees\nAdministered Performance. \n\nExamples of the Smart Plug Ins (SPIs):\n\nDatabase SPIs (Oracle, MS SQL, DB2, Sybase & Informix)\nJ2EE SPIs (Web Logic, Web Sphere, JBOSS, JMX and Web Server)\nSAP SPIs (SAP)\nMS SPIs (MS Active Directory, Exchange, Share Point, Biztalk & Lync)\nSystem Infrastructure SPIs (AIX, Windows, HPUX, Linux & Solaris)\nCluster Infrastructure SPIs (MCSG, HACMP, VCS)\nVirtual Infrastructure SPIs (Vmware Vma, HPVM, Solaris Zones, IBM Lpar/Wpar, MS HyperV, KVM & XEN\n\n\n\nTitle \t\t:\tCommon Application Development QA\nOrganization\t:\tIBM India Pvt. Ltd. (ISL) Bangalore\nDesignation\t:\tManager (People and Project)\nPeriod\t\t:\tApr’08 – May’10\nCLI: DB2 Call Level Interface (DB2CLI) is IBM's callable SQL interface to the DB2 family of database servers. It is a 'C' and 'C++' application programming interface for relational database access that uses function calls to pass dynamic SQL statements as function arguments. CLI in the end is a driver and almost all tools use this to connect to DB2.\n\nJCC: Java Common Client driver is a JDBC driver which connects to multiple IBM data servers including DB2 on LUW, DB2 on zOS and IDS\n\nCLPPlus: Java based command-line Tool\n\nClient Optimizer: Component Captured static information and binding then executing queries statically to gain performance\n\nRole\t\t:\n\nHandled QA Team and recruited 6 engineers (total team size 11)\nOwned FVT for new features, Regression and installedtesting for 4 client components of DB2 for Fixpacks and new releases. (CLI, JCC, Client Optimizer and CLPPlus)\nCollaborated with development team and release management team from ISL, Toronto Lab and SVL during each phase of the Fixpack and Release\nManaged project and resource planning of the QA Team\nCoordinated with partner labs on status update, updating on the issues and resolution of the issues\nEnsured timely completion of all the Fixpack and Release deadlines and quality of the client components handled is improved from one release to another\n\n\nTitle \t\t:\tDB2 Kernel FVT\nOrganization\t:\tIBM India Pvt. Ltd. (ISL) Bangalore @ USA\nDesignation\t:\tStaff Software Engineer (Team Lead) \nPeriod\t\t:\tOct’05 – Mar’08\nDescription:\tThe project involved LIs FVT for DB2 server version 9, 9.5 and 9.7\nFaster Redistribute\nOptimistic Locking\nSchema Evolution\nRole\t\t:\nOwned FVT for new features in DB2 kernel area starting from external review, test planning, high level design reviews, test spec, creation of test cases and execution across multiple platforms and raising and following up on defects found\nReviewed work and guided the team for various problems\nPerformed RCAs and field problem analysis and got tests included in the regression suite \n\nTitle \t\t:\tIBM Informix Dynamic Server QA\nOrganization\t:\tInformix Software Inc & IBM-INFORMIX Software (Lenexa)  \nDesignation\t:\tSoftware Engineer\nPeriod\t\t:\tJan’01 – Oct’05\nDescription:\tThe project involved Informix 7x, 9x and 10x Online Server QA. Scope included execution and analysis of failures for Server tests and enhancing the test-suite for new feature development along with pointers from code-coverage and RCA and field problems.\nRole\t\t:\nHandled critical cases with very tight schedules and meeting critical milestones. \nRaised the Defects found during the testing immediately, so that it gets fixed quickly. \nInvolved in the triages deciding Severity and fix precedence of the Defect and deciding how critical this Defect is from customer point of view\nFixed test case related defects during all the releases due to change in behavior of Server and automated Final QA to make the release process fast. \nGained understanding of different tracking tools (Atlas, IRIS, PTS, ATM and RTS) and all processes\nPerformed test-spec, test cases and execution on multiple platforms for new features in IDS server, also handled IVT, media validation and regression analysis for IDS\nExecuted responsibilities under the components related to ONUTILS (Onstat, Onmode, Oncheck, Onspaces) and DBUTILS (Dbexport, Dbimport) and Loader & HPL utilities (Onload, Onunload, Ontape, Onpload) which were utilities of Informix Dynamic Server\n\nFeatures worked on:\nTapesizezero feature for 9.40 Server.\nSingle User Mode feature for 10.00 Server.\nAutomation of Install Scenarios for IDS Install testing on UNIX. \nAutomation of the GUI portion of install testing using Rational Functional Tester.\n\nTitle \t\t:\tInterim Patch Release, Online Server and Client-SDK Maintenance\nOrganization\t:\tInformix Software (India) Pvt. Ltd.\nDesignation\t:\tSoftware Engineer\nPeriod\t\t:\tNov’99 – Jan’01\nDescription:\tOnline 5x server was first Informix server with client-server architecture available on all UNIX platforms of that time (SUN, HP, AIX, Linux, DEC, etc.) and Client - SDK is Software development Kit to connect to Informix Servers containing ESQL/C and various drivers.\nRole\t\t:\nAddressed customer requests for Interim and Patch releases of Online 5x and CSDK\nPerformed Defect Fixing, verification and creation of new test cases\nPorted activities including platform specific merging, builds, QA and defect fixing and verification and making it EGA\nInvolved in GLS testing and code cleanup.\n\n",
    "extracted_skills": [
        "agile",
        "go",
        "java",
        "leadership",
        "mentoring",
        "oracle",
        "problem solving",
        "project management",
        "scrum",
        "sql"
    ]
}