{
    "id": "resume_f33884e3-7b6c-4997-9111-38b0b38ac8c5",
    "metadata": {
        "filename": "Manohar Reddy.docx",
        "processed_date": "2025-09-24T08:45:43.926652+00:00"
    },
    "raw_text": "Manohar\nSr. Java Developer\n\nEmail: manohar.r7754@gmail.com                                                         Cell: (614) 285-5486\n\n\nSummary\n9+ Year of IT Experience is working with Java based frameworks and databases.\nEffective team player as well as individual performer with experience in Java, J2EE, JSP, Servlets, spring, Hibernate, SQL, PL/SQL and Oracle, MySQL, NOSQL.\nExtensive experience in multiple Java and J2EE technologies such as Servlet, JSP, JSTL, Spring, Struts, Sitemesh, IBatis, Hibernate and JPA, XML, JSON, XSD, HTML, JavaScript, JQuery, AJAX, JUnit, WSDL, SOAP, Restful Web Services (Restlet), ActionScript 3.0\nWell experienced in Working on Core Java, J2EE (EJB, JSP & Servlets, JDBC, JMS), SQL, JQuery, HTML.\nExperience with Core Java with Multithreading, Concurrency, Exception Handling, File handling, IO, Generics, Data structures and Collections, Garbage Collection.\nExpert in using testing, logging and building tools like JUnit, Log4J and Ant. \t\nStrong skills in API design, Enterprise Application Integration, Database Design and knowledge of various Architecture, design, Integration patterns and Application frameworks development. \n4+ years of experience in Apache Hadoop technology and core Hadoop technology stack which includes HDFS, Map Reduce programming, Hive, Pig, HBase and SQOOP.\nExperience with WebSphere Portal 7 development and IBM Workplace Web Content Management and Workplace Forms\nStrong proficiency in SMB POP IGMP SMTP and TCP/IP protocols\nConduct in-house and public workshops and training seminars: Extreme Programming, Test-Driven Development, Agile Development, .NET Development, Design Patterns, \"Communicating with Tests\" seminar.\nWorked on the creating different screen using ExtJs worked on writing some Extjs Plugin.\nGood experience in using Amazon Web Services (AWS) and AWS SNS/SQS for delivering messages. \t\nExperience in creating comprehensive web applications using MEAN stack implemented with MS SQL, Express, Angular 2/4 and Node.js, Java8.\nProficient in designing and implementing web server solutions and deploying Java application servers like Apache Tomcat, IBM Web Sphere, Web logic on Windows/UNIX platform\nExtensively used JDBC Statement, Prepared Statement, Callable Statement and Result Set interfaces while providing database interaction with the RDBMS backend.\nStrong and recent experience with developing or working within an automated testing framework.\nHands on Experience on Angular 2 technology for one complete project in rebasing the UI of the application using the techniques in Angular 2/4.\nProvided technical assistance for integration of Appian systems along with external systems such as SAP.\nConducted detailed analysis to support designing and development of BPM applications.\nImplemented Hadoop based data warehouses, integrated Hadoop with Enterprise Data Warehouse systems. \nExpertise in the implementation of Core Java concepts of Java, J2EE Technologies: JSP, Servlets, JSF, JSTL, EJB transaction implementation (CMP, BMP, Message-Driven Beans), JMS, Struts, Spring, Swing, Hibernate, Java Beans, JDBC, XML, Web Services, JNDI, Multi-Threading, Data structures etc. \nWorked on the Implementation of system as an independent component to be supported/integrated with Appian based BPM applications to deliver management capabilities using Appian 7.5 SAIL features such as Record Types, Record dashboards, SAIL Reports, Actions and Introduced the use of automated testing tools such as Cucumber to reveal and document, as well as drive development of, behavior in a large legacy code base (mostly Java and Perl)\nLightbend Reactive Platform plus many other Scala libraries and frameworks.\nConfluent Platform (Apache Kafka and its ecosystem) and Reactive Kafka\nUsed Web Sphere Application Server, Web Logic Application Server, JBoss and Apache Tomcat in all my projects and successfully deployed and compiled many of the applications on them. \nUsed Bootstrap and Angular.JS, React.js and Node.js in effective web design.\nMotivation of peers and mentoring team members to achieve their respective annual object\t \nExperienced developing against SOLR Search Platform APIs\ndeveloping Multi-Tier Web Applications and Server side Business Logic using J2EE, XML, WebSphere, WebLogic, Apache Tomcat, Enterprise Java Beans, Servlets, JSP, Struts, JDBC, DB2, Oracle, PL/SQL. \t\nFamiliar with data collection technologies like Kafka.\nExperienced in React JS and working with React Flux architecture.\nExperience in developing JAVA/J2EE, Spring4, Hibernate4 applications using IDEs such as Eclipse, RAD. \nExtensive experience in working with various databases like Oracle 11g/12c, SQL Server and MySQL\nHands on experience in Rational Suite of Products like Rational Rose in developing Use Cases, Sequence Diagrams using UML, Rational Suite. \nExpertise in configuring the Spring Application Context with dependency injection and using Spring Framework that can integrate Hibernate and Web Services \t\t\nHands on experience with production support tool such as Jira, Remedy, Quality Center - bug tracking tool.\nExpertise with Spring Framework using components like MVC, Transactions, ORM and JDBC. Also used Hibernate ORM, JSF and Struts MVC frameworks. \t\t\nHas extensive knowledge on UNIX Shell scripting, FTP, SFTP. \t\nExperience with Design patterns like Singleton, Data Access Object, MVC Pattern and Agile, SCRUM methodology.\nExperience in working with ES6 features, used babble, web pack with ES5, React js.\nExpert in latest technologies and approaches for SOA based development and good understanding of SOA life cycle, SOA design Backbone principle, Service registry and various other SOA infrastructures.  \n\nSkill set \n             \t\t \n\nProfessional Experiences \n\nAT&T Telecom, Atlanta, GA\t\t\t\t                                    Sep’16 – Till date\nSr. Java Full Stack Developer \nResponsibilities\nInvolved in analysis, design and documentation of the application model. \nApplied design patterns including MVC Pattern, Factory Design Pattern and Singleton Design Pattern. \nWorked on advanced UI design and full stack development using MEAN stack.\nUsed spring4 framework for Dependency Injection and integrated with Hibernate. \nInvolved in developing Spring Beans and wiring their dependencies. \nExtensively worked with Hibernate Query Language (HQL) to store and retrieve the data from Oracle database.\nExperience in Automation testing using Selenium Web Driver, JUnit and Maven.\nUsed Apache Kafka (Message Queues) for reliable and asynchronous exchange of important information between multiple business applications. Involved in developing an automation tool, in Java and Scala on Akka Framework\nDeveloped and deployed solution using several new technologies, including Linux - Ubuntu, Drupal and Apache SOLR.\nConducted Automation testing using the Standards, guidelines and structured methodology in testing the application.\nResponsible for overall Docker & Kubernetes setup, configuration and Architecture. \nConfigured and maintained a large scale Docker based PaaS environment using kubernetes \nTroubleshooted and resolved issues within the Docker and kubernetes environment \nUsed Java 8 features like stream and Lambda expressions\nBuild microservices for the delivery of software products across the enterprise.\nRecommend and develop strategy for integrating internal security model into new projects with Spring Security and Spring Boot.\nUsed Rally issue tracking application for Agile management\nIntegrated Jira with Rally tickets using Perl scripts and Jira-Rally plugin\nCreate RFP (Request for Proposal) microservice to provide RESTful API utilizing Spring Boot with Spring MVC.\nUsing cloud foundry to push application to Predix cloud which is specific to GE Digital.\nCreated, implemented and managed Pivotal Cloud Foundry deployments\nExperienced in using Cloud Foundry (CF) CLI for deploying applications and other CF management activities \nProficient with Shell, Python, Ruby, Perl, Power Shell, JSON, YAML, Groovy scripting languages.\nFamiliar with concepts of Azure and OpenStack Cloud Based Technologies.\nExperienced in installing and troubleshooting CF installations on IAAS (Azure, AWS etc.) \nResponsible for developing microservices using GE’s Predix platform for Industrial IoT apps and migrating existing monolithic app to microservice architecture in Predix.\nDeveloped an integration project called GCC using Predix services like UAA (user authentication and authorization), Enterprise Connect (connect predix cloud and your enterprise), Predix Machine (connect edge devices on premise to cloud and send sensor data to cloud), Predix Asset service (create and store machine asset models), Predix Analytic service (analyze continuous sensor data as time series data).\nDeveloped web application using Predix web components using Polymer, CSS, HTML and CSS.\nCreate Data Model for and initial Java JPA entities for RFP project.\nUtilize Camel to integrate microservices with other microservices and RabbitMQ messaging exchanges.\nUsed SVN Backbone as a version controller. \nMoved the project to Java 8 to extensively use Lamda expressions and have better connectivity to Cloud in addition adding Spring Boot Libraries and UI Enhancement.\nDeveloped stored procedures, triggers and functions to process the data using NOSQL, PL/SQL, Spring4, and Hibernate4 and mapped it to Hibernate4 Configuration File.\nCreated tempo enabled forms using SAIL, design DB schema using nested CDT\nContributed greatly to increases in code quality and productivity through his leadership and guidance in areas such as Test/Behavior Driven Development, Refactoring, Pair Programming (Extreme Programming/XP), and Agile Estimation and Planning\nWorked on the Implementation of system as an independent component to be supported/integrated with Appian based BPM applications to deliver management capabilities using Appian 7.5 SAIL features \nExperienced in MEAN stack advancement (MongoDB, CockroachDB, Express.JS, and AngularJS & NodeJS).\nDeveloped React.js applications using Redux architecture for front-end UI, and Node.js applications for backend.\nUsed microservice architecture, with Spring Boot-based services interacting through a combination of REST and Apache Kafka,Spring4 message broker\nConfigured routes in Apache Camel using XML for routing messages between end points\nDeveloped bootstrap UI JS using with Angular JS, Hibernate4, NOSQL\nDevelopment of Apache Struts web applications from concept to rollout \nExtensive experience on MVC architecture and using frameworks like Angular 2/4 and React JS for creating Single-Page Applications(SPA) using concepts like Dependency Injection, Promises, Services, Scope, Controllers and Directives.\nDeveloping micro services using Java Spring Boot and GoLang with Docker deployments\nAdded routing and developed factories, worked on root level variables and functions \nDeveloped Unit and E2E test cases using Node JS.\nThe tech stack is AngularJS, Express and innovative server side technologies like Node.js, MongoDB (MEAN Stack).\nExperience with Front-end JavaScript frameworks like Angular JS, Node JS. And with the creation of RESTful Web service.\nUsed the light weight container of the Spring Frame work to provide architectural flexibility for inversion of controller (IOC).\nExperience with Python, Hadoop, Mongo DB.\nCreated Type Script reusable components and services to consume REST API's using component based architecture provided by Angular 2/4.\nImplementing the Big Data solution using Hadoop, hive and Informatics 9.5.1 to pull/load the data into the HDFS system.\nIn depth knowledge of Apache Cassandra architecture.\nExperience in installing, configuring and monitoring DataStax Cluster (Enterprise Edition).\nExperience in deploying the Cassandra cluster in cloud, on premises, data storage and disaster recovery.\nExperience in designing data models in Cassandra and working with Cassandra Query Language\nDeveloped Keyword Driven Framework Using Selenium Web Driver and Java.\nInvolved in design and development of keyword-driven automation framework using Selenium Webdriver.\nAnalysis of test requirement and automation feasibility.\nLearning automation tools like Selenium and QTP.\nUsed Eclipse and Tomcat web server for developing & deploying the applications.\nWorked on different Automation tooling techniques to support reporting/development and the CI/CD pipeline.\nUsed Gwildor node application to configure repositories and compare github tags.\nSetup and benchmarked Hadoop/H Base clusters for internal use\nImplemented continuous integration & deployment (CICD) through Jenkins for Hadoop jobs.\nDeveloped and Implemented new UI's using Angular JS and HTML, NOSQL, Java8. \nDeveloped Spring Configuration for dependency injection by using Spring IOC, Spring Controllers.\nExperienced in Responsive Web Design technology with or without framework like Bootstrap.\nExpertise in AngularJS controllers, directives, factories, services, routing, DOM manipulation using JavaScript, jQuery and Angular JS. Experience in MEAN (Mongo DB, Express, JSON,AJAX,CSS, Angular2/4 and Node JS) Stack application development \nWorked on Solr, Elastic Search, Kafka, Flume, Mango DB, CockroachDB,  and Cassendra\nExtract the data from Oracle and push to Apache Kafka Queue using Golden Gate.\nImplementing Spring MVC and IOC methodologies. \nUsed Java 8 Method References feature to point to methods by their names and also used functional Interfaces.\nUsed Scala for coding the components in Play and Akka.\nUsed scala scripts for spark machine learning libraries API execution for decision trees, ALS, logistic and linear regressions algorithms.\nImplemented multi - data center and multi-rack Cassandra cluster.\nGood conceptual understanding and experience in cloud computing applications using Amazon EC2, S3, EMR.\nExperience in managing multi-tenant Cassandra clusters on public cloud environment - Amazon Web Services (AWS)-EC2.\nManaging Cassandra clusters using Datastax Opscenter. Experience in Cassandra systems backup and recovery\nCurrently working on developing Server less functioning using AWS lambda with JAVA\nDeveloped common reusable component libraries (CRUD Scaffolding) to be reused in different projects throughout the company's IT team using GWT, Sencha, spring data, JPA. \nCreate BI reports using reactive web frameworks using Scala Play & D3.js\nWorked with RxJava (ReactiveX) for asynchronous composition and manipulation of data and events using Observers and Observables in the application.\nExpert in implementing unified data platform to gather data from different sources using Kafka and Java Producers and consumers.\nLoaded data in elastic search from Datalake and Optimized the full search function using Elastic Search.\nDeveloped Framework components for Struts Presentation tier, Business tier and Resource tier\nImplemented application specific exception handling and logging frame work using Log4j,Hibernate4 \nImplemented Apache Kafka to provide a unified, high-throughput, low-latency platform for handling real-time data feeds \nInvolved in developing the component which provides the required information to Reporting system to generate the trend analysis reports for user attempts, success, user failures and system failures. \nInvolved in developing an automation tool, in Java and Scala on Akka Framework\nInvolved in complete development of 'Agile Development Methodology/SCRUM' and tested the application in each interaction.\nExperienced in using Scala, Java and Python frameworks for Bigdata/Spark engine requirements. \nInvolved in with xml, MVC, Backbone, svn Synfony2.\nWorked with Angular.js routers, forms, modules, DOM, events, expressions, controllers, filters and Http Request.\nExperience in different Hadoop distributions like Cloudera (CDH3 & CDH4) and Horton Works Distributions (HDP) and MapR 2.\nDeveloped Spark code using Scala and Spark-SQL for faster testing and data processing.\nSetting up the Spark Streaming and Kafka Cluster and developed a Spark Streaming Kafka App.\nImported millions of structured data from relational databases using Sqoop import to process using Spark and stored the data into HDFS in CSV format.\nMEAN stack implementation, Angular.JS Full-Stack generator (generator-angular-full stack), and actually run, edit, and deploy an application. \nInvolved in converting Hive/SQL queries into Spark transformations using Spark RDD, Scala.\nImprove the performance of the application by using the Performance Tuning and Time lines for each module of the Application. Based on Time lines decrease the page loads and increase the total performance of the application. \nImplementation of Struts - Configuration Files, Validation Files, Interceptors, Filters, Listeners for Modules. \nImplemented Core Java Methodologies like Interfaces, Collections, Customized Exceptions and Multi-Threading.\nDesigning and developed Micro Services using (MEAN Stack) node.js, Mongo DB, Neo4J, Elastic search on Cisco Private Cloud OpenStack Platform \nDeveloped the Application making use Java 8's new Streams API and parallel Streams to partition the streams.\nDevelopment of Apache Struts web applications from concept to rollout \nDesigned and developed the process of synchronizing and Multi-Threading for each module of the application.\nExperiences in Web Programming and User Interface Development having hand on experience on python, MySQL.\nProgramming experience in node.js, mongo db, java and MySQL, NOSQL.\nSolved Production Support defects by using tool HP Tracing. Based on priority of the defect solve the all production support defects. \nDesigned and developed the login portal using framework Angular 2 along with HTML5, CSS3 and Type Script.\nExtensively used Java 8 features (Lambda Expressions, Streams)\nUsed Java 8 Method References feature to point to methods by their names and also used functional Interfaces.\nDeveloped the Application making use Java 8's new Streams API and parallel Streams to partition the streams.\nUsed micro service architecture, with Spring Boot-based services interacting through a combination of REST and Apache Kafka, Spring4 message broker\nWritten micro services using Spring Boot and Spring Data for Dynamo DB\nUsed Subversion for activities tracking Version Controlling and Change Management that is tracking structure of folders, maintaining global revision number for the whole repository and Clear Case operations \nUsed Hibernate Mapping to form persistence objects to interact with Database\n       \nEnvironment: Java8, J2EE, Servlets, JSP, HTML, Spring4, Hibernate4 DHTML, JavaScript, AJAX, JQuery, XML, XSLT, Eclipse, Spring Web MVC, NOSQL, Hibernate 4.0, SOAP,JSON,CSS, JAXP, JAXB, Oracle 11g, SQL, JUNIT, Java8 , Cloud Foundary ,Reactive Systems, Reactive programming                                                                                                              \n\nNovartis, East Hanover, NJ\t\t\t\t\t\t\t     Nov’14 – Aug’16\nSr. Java Developer\n\nResponsibilities\n\t\nDevelopment, enhancement and testing of the Web Methods flow services and Java services. \nUsed web services for interaction between various components and created SOAP envelopes. \nPaypal had their own application stack for REST based Java application, understood their architecture before design and development.\nProficient coder in multiple languages and environments including Python, Django, C, C++ and SQL, NOSQL.\nExperienced in using Scala, Java and Python frameworks for Bigdata/Spark engine requirements.\nImplementation of Struts - Configuration Files, Validation Files, Interceptors, Filters, Listeners for Modules.\nImplemented continuous integration & deployment (CICD) through Jenkins for Hadoop jobs\nExperience in different Hadoop distributions like Cloudera (CDH3 & CDH4) and Horton Works Distributions (HDP) and MapR 2.\nHands on experience in Html, CSS Java Script, BootStrap, Ajax, php.\nDeveloped custom spring boot starters in existing Microservice Framework to provide for developers Cloud-native microservice environment like Centralized configuration, service registry and discovery, circuit breaker, monitoring and distributed tracing so developer can focus on writing business logic.\nDeveloped and enhanced some configurable camel routes in framework using yml file configuration.\nEnhanced some spring boot starters which hold dependencies and code.\nDeveloped Junit tests, integration test using Mockito.\nExperience in performance tuning a Cassandra cluster to optimize writes and reads\nInvolved in the process of data modeling Cassandra Schema\nInstalled and Configured DataStax OpsCenter for Cassandra Cluster maintenance and alerts.\nBenchmarked Cassandra cluster based on the expected traffic for the use case and optimized for low latency\nBuilt Cassandra Cluster on both the physical machines and on AWS\nAssisted Development teams to migrate applications to Docker based PaaS platform using Kubernetes. \nExperienced in defining Application Deployment Solution on Docker based PaaS environment and migrating applications to Kubernetes and Docker platform\nDesigned and implemented required Failover mechanisms in a Docker/Kubernetes Ecosystems.\nAutomated Cassandra Builds/installation/monitoring etc\nCreated frontend screens using GWT framework.\nLoaded data in elastic search from Datalake and Optimized the full search function using Elastic Search.\nExpertise in AngularJS controllers, directives, factories, services, routing, DOM manipulation using JavaScript, jQuery and AngularJS. Experience in MEAN (MongoDB, CockroachDB, Express, Angular Js and NodeJS) Stack application development \nUsed Elastic search for Real time analytics and a Full text search functionality \nSubject matter expert in enterprise search engine analysis, design, development and systems integration. Search engines include Autonomy IDOL Server, MOSS 2007, Endeca, Lucene/Solr and Microsoft FAST 2010 for SharePoint 2010, SharePoint 2013.\nExperience in working with the NoSQL, Mongo DB, and Apache Cassandra.\t\nResolving scalability and performance issues both in Applications as well as in Web sphere/Web Logic Application Servers.\nDeveloped the Application making use Java 8's new Streams API and parallel Streams to partition the streams.\nUsed micro service architecture, with Spring Boot-based services interacting through a combination of REST and Apache Kafka, Spring4 message broker\nWritten micro services using Spring Boot and Spring Data for Dynamo DB\nDeveloped Framework components for Struts Presentation tier, Business tier and Resource tier\nExperienced in MEAN stack advancement (MongoDB, CouchbaseDB, Express.JS, AngularJS &NodeJS).\nExperience in developing Web based GUI’s using JSP, HTML, DHTML, CSS, JavaScript (and its frameworks like JSON), Action Script, DOJO, Node JS, Angular JS, JQuery, EXT JS and Ajax.\nModularized front end CSS and JS code with Sass.Built a real-time mouse/click user analytics web service with Node.js\nInvolved in developing an automation tool, in Java and Scala on Akka Framework\nExperience in web applications creation with HTML5, Ajax, JQuery, Backbone.js, and CSS3.\nPerformed UNIX Shell scripting for the application. \nWorked on Solr, Elastic Search, Kafka, Flume, MangoDB, CockroachDB and Cassendra\nExtract the data from Oracle and push to Apache Kafka Queue using Golden Gate.\nUsed Apache Kafka (Message Queues) for reliable and asynchronous exchange of important information between multiple business applications. Involved in developing an automation tool, in Java and Scala on Akka Framework.\nImplemented search engines by using Angular JS filter to make the data searchable and sortable.\nInvolved in converting Hive/SQL queries into Spark transformations using Spark RDD, Scala.\nExperience in development of JavaScript for client side validations. \nDesigned/developed UI with AJAX, HTML, DHTML and JavaScript for interactive web pages. \nExpert in implementing unified data platform to gather data from different sources using Kafka and Java Producers and consumers.\nDesign the J2EE components of the Restful Web Services and scheduled Java batch jobs based application in UML. \t\t\nUsed Scala for coding the components in Play and Akka.\nUsed scala scripts for spark machine learning libraries API execution for decision trees, ALS, logistic and linear regressions algorithms.\nCreated Web Services (SOAP) between different components and also exposed few web services to client apps get metadata for the specific entities and documents. \t\t\nMEAN stack implementation, AngularJS Full-Stack generator (generator-angular-full stack), and actually run, edit, and deploy an application. \nExperienced in developing Web Services with Python programming language.\t\nDeveloped the application using Struts Framework that leverages classical Model View Controller (MVC) architecture.\nFront end design using HTML CSS Bootstrap. \nImplemented Business processes such as user authentication, Account Transfer using Session EJBs.\nImplemented Apache Kafka to provide a unified, high-throughput, low-latency platform for handling real-time data feeds \nExtensively developed stored procedures, triggers, functions and packages in oracle SQL, NOSQL, PL/SQL.\nDeveloped the front end using HTML, JavaScript, AJAX, JSP, CSS, JQuery, and XML. \nDeveloped POJO's, Data Access Object (DAO) which handles all database operations using Hibernate.\nDeveloped Spark code using Scala and Spark-SQL for faster testing and data processing.\nSetting up the Spark Streaming and Kafka Cluster and developed a Spark Streaming Kafka App.\nImported millions of structured data from relational databases using Sqoop import to process using Spark and stored the data into HDFS in CSV format.\nExtensively used Java 8 features (Lambda Expressions, Streams)\nUsed Java 8 Method References feature to point to methods by their names and also used functional Interfaces.\nDeveloped the Application making use Java 8's new Streams API and parallel Streams to partition the streams.\nUsed microservice architecture, with Spring Boot-based services interacting through a combination of REST and Apache Kafka message broker\nExperience on Protractor in end-to-end test framework for Angular JS applications and also performed in jasmine, mocha, and chai.\nExperience in using design patterns and UI frameworks such as MVC, Struts, Hibernate, NodeJS, and spring.\nStrong knowledge in developing and designing web 2.0 application according to Information architecture and Usability standards using Ajax, JQuery, Backbone.js, XML, Symfony 2, CSS3 and MVC frameworks.\nImplementing the Big Data solution using Hadoop, hive and Informatica 9.5.1 to pull/load the data into the HDFS system.\nSetup and benchmarked Hadoop/H Base clusters for internal use\nImplementation of the Business logic layer for Mongo DB Services.\t\t\nImplemented the Animation and styling using CSS3 and JQuery. \nDeveloped logging module-using Log4J to create log files to debug as well as trace application.\t\nDeveloping data access layer using IBATIS -ORM and JDBC. \t\nInvolved in JUnit Testing, debugging, and bug fixing. \nUsed Log4j to capture the log that includes runtime exceptions and developed WAR framework to alert the client and production support in case of application failures. \t\n\nEnvironment: Java, J2EE, Servlets, JSP, HTML, DHTML, CSS, AJAX, JQuery, XML, XSLT, Eclipse, Spring Web MVC, Hibernate 4.0, WSDL, SOAP, SQL, HP Quality Center, JUNIT, Ant.\n\nPrudential, Newark NJ\t\t\t\t\t\t\t                Jun’13 – Oct’14\nSr. Java Developer\n\nResponsibilities\n\t\t\nResponsible for coding with the use of Object Oriented Principles and implementing MVC with JSP, Struts. \nDeveloped the Spring AOP programming to configure logging for the application\t\t\nDeveloped user interfaces using Java Server Pages using HTML, DHTML, XHTML, CSS & JavaScript.\nExperience with Python development under Linux OS (Debian, Ubuntu, RedHat Linux).\nDesigned different UI aspects for improved performance of the application by using GWT.\nDeveloped code using Core Java to implement technical enhancement following Java Standards.\nProficient in Node.js, Mongo db, Redis and Linux flavor. \t\nInvolved in the analysis, design, and development and testing phases of Software Development Life Cycle (SDLC). \t\nUsed JPA (Java Persistence API) with Hibernate as Persistence provider for Object Relational mapping.\nExpertise in client scripting language and server side scripting languages like JavaScript, jQuery, JSON, DOJO, bootstrap, Node.js, Angular.js, backbone.js, Require.js, JSF and JSP.\nDeveloped the Front end for the application using HTML5, Angular JS, JSP and JavaScript.\t\nDeveloped and implemented Swing, Spring and J2EE based MVC (Model-View-Controller) framework for the application \nOptimized the Cassandra cluster by making changes in Cassandra configuration file and Linux OS configurations. \nSetup, upgrade and maintain Cassandra DSE clusters.\nTune databases and provide design changes and support stress tests to proactively fix problems.\nImplemented application level persistence using Hibernate and Spring.\nData Warehouse (DW) data integrated from different sources in different format (PDF, TIFF, JPEG, web crawl and RDBMS data MySQL, oracle, SQL server etc.) \nUsed XML and JSON for transferring/retrieving data between different Applications. \n Also wrote some complex PL/SQL queries using Joins, Stored Procedures, Functions, Triggers, Cursors, and Indexes in Data Access Layer. \t\nDesigned and developed SOAP Web Services using CXF framework for communicating application services with different application and developed web services interceptors. \t\nAnt build file creation and usage of Maven Ivy tool set, along with dynamic JUnit report generation in PDF format.\nDeveloped dynamic web pages using Python, Django Frameworks.\nWorked as backend developer of this app using Nodejs, Socket io and mongo db. \t\nImplemented the project using JAX-WS based Web Services using WSDL, UDDI, and SOAP to communicate with other systems.\nExperience in developing UI applications using HTML, HTML5, Jquery, and AJAX, AngularJS, Backbone JS. \nDeveloped back end interfaces using embedded SQL, PL/SQL packages, stored procedures, Functions, Procedures, Exceptions Handling in PL/SQL programs, Triggers. \nIn depth exposure to creating API for internal and external application using REST and SOAP based design. Open source framework like Jersey used for create REST API \nManaging Source code in CVS and SVN and Project Documents in Share Point. \n\nEnvironment: JAVA, J2EE, JDK JSP, XML, JSF, Struts , Web Services ,Spring MVC, JNDI, JDBC, SQL, HTML, DHTML, JavaScript, AJAX, Oracle, SOAP UI Tool, SVN, SQL, ANT.\n\n\n\nCitizens Financial Group, Atlanta GA\t\t\t\t                               Dec’11 – May’13\nJava Developer\n\nResponsibilities\n\nDesign, Development, testing and debugging of new software and enhancements to existing software.\nResolving design conflicts and using best coding practices.\n Developed common reusable component libraries (CRUD Scaffolding) to be reused in different projects throughout the company's IT team using GWT, Sencha, spring data, JPA. \nGetting signoff from the users after User acceptance testing.\nUsed JavaScript, JQuery and ExtJs to create UI on the Front End.\nDeveloped major websites and services by including Mongo DB as backend software.\t\nUsed various libraries of JavaScript like jQuery, backbone.js, underscore.js and node.js.\nTranslation of business requirements to information technology.\nDeveloped business modules using Hibernate & Spring frame work technologies.\nExperience in handling WebLogic scripts for server management and application deployment\nConfiguration of application using the Spring, Hibernate, DAO’s, Action Classes, Java Server pages.\nInvolved in building database Model, APIs and Views utilizing python, in order to build an interactive web based solution.\nWorking as Cassandra Admin (Datastax DSE-DevOps-NoSQL DB) on 39 node cluster.\nAdministration and maintenance of the cluster using OpsCenter, Devcenter, Linux, Node tool etc.\nData migration from Teradata to Cassandra using Teradata Fexport & Cassandra loader.\nWeb pages are developed using Java Server Pages, HTML, DHTML, EXTJS, AJAX, and JavaScript.\nPerformed unit testing with JUnit. \nUsed Cobertura tool to analyze the code covered by Unit test cases.\nUsed Oracle WebLogic 10.x as my Application Server for this application.\nDeveloped new modules using JSF 2.0 Framework \nBuilt an online system using XML, Javascript, AJAX, Strust 2.0, JDBC \nInvolved in technical Documentation for the module \nDesigned and created SQL Server Database, Stored Procedures \nExtensively used XML, JSP, Javascript, AJAX, Servlets to drive the application / request user input from backend \nInvolved in designing and developing Customized tags using JSP taglib \nImplemented Model View Control (MVC) architecture using Struts Framework and Spring framework \nDeveloped browser-based Java Server Faces front-end to an AS/400 system \nWorked on Web Sphere Application Server \nUsed Ajax to provide dynamic features where applicable \nUsed MVC pattern for GUI development in JSF and worked closely with JSF lifecycle, Servlets and JSPs are used for real-time reporting which is too complex to be handled by the Business Objects \nCreated several JSP's and populated them with data from databases using JDBC \nWorking on Session maintenance was done using Servlets \nDeveloped and Designed Interfaces using JSP and Servlets .\nUsed ANT automated build scripts to compile and package the application. \nUsed Jira for bug tracking and project management. \n\nEnvironment: JAVA, J2EE, JDK, Servlets, XML, Web Services (JAX-WS: SOAP), Spring MVC, JDBC, SQL, HTML, JavaScript, AJAX, SOAP UI Tool, SVN, SQL, Apache Axis 1.2, ANT, JUnit,.\n\n\nATA SOFTWARE P LTD, Bangalore\t\t\t\t                              Jul’08 – Nov’11\nJava Developer\n\nResponsibilities\n\nInvolved in various phases of Software Development Life Cycle (SDLC) of the application like Requirement gathering, Design, Analysis and Code development. \nDeveloped a prototype of the application and demonstrated to business users to verify the application functionality.\nDeveloping front end of application using HTML, CSS, backbone.js, javascript, jQuery. \nDesign, develop and implement MVC Pattern based Keyword Driven automation testing framework utilizing Java, JUnit and Selenium WebDriver.  \nUsed automated scripts and performed functionality testing during the various phases of the application development using Selenium.\nUsed Angular js framework where data from backend is stored in model and populated it to UI.\nPrepared user documentation with screenshots for UAT (User Acceptance testing). \nEnvironment: Java, Javascript, HTML, CSS, Xpath, Selenium Web driver, Eclipse, JUnit, Jmeter, Jira, Windows, Mac OSX, Oracle 10g, Agile Methodology.\nDeveloped and implemented the MVC Architectural Pattern using Struts Framework including JSP, Servlets, EJB, Form Bean and Action classes.\nHands on experience with MVC Javascript frameworks such as Backbone.js, Angular.js and Node.js. \nImplemented server side tasks using Servlets and XML. \nHelped developed page templates using Struts Tiles framework. \nImplemented Struts Validation Framework for Server side validation. \nDeveloped JSP's with Custom Tag Libraries for control of the business processes in the middle-tier and was involved in their integration. \nImplemented Struts Action classes using Struts controller component. \nDeveloped Web services (SOAP) through WSDL in Apache Axis to interact with other components. \nImplemented EJBs Session beans for business logic. \nUsed parsers like SAX and DOM for parsing xml documents and used XML transformations using XSLT. \nWrote stored procedures, triggers, and cursors using Oracle PL/SQL. \nCreated and deployed web pages using HTML, JSP, Javascript and CSS. \nWrote JUnit Test cases for performing unit testing. \nUsed Rational Clear Case as Version control. \nImplemented Java/J2EE Design patterns like Business Delegate and Data Transfer Object (DTO), Data Access Object and Service Locator. \nInteract with clients to understand their needs and propose design to the team to implement the requirement.\nBuilt Angular js framework including MVC architectures, different modules, specific controllers’ templates, custom directives and custom filters.\n \nEnvironment: Java1.5, JSP, JDBC, Spring Core 2.0, Struts 1.2, Hibernate 3.0, Design Patterns, XML, Oracle, PL/SQL Developer, Web services, SOAP, XSLT, Jira.\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "azure",
        "cassandra",
        "ci/cd",
        "css",
        "django",
        "docker",
        "ec2",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "kubernetes",
        "lambda",
        "leadership",
        "machine learning",
        "mentoring",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "php",
        "project management",
        "python",
        "react",
        "redis",
        "redux",
        "rest api",
        "ruby",
        "s3",
        "scala",
        "scrum",
        "spark",
        "sql"
    ]
}