{
    "id": "resume_03408c85-82a9-4246-a7ef-74a218a5ad1b",
    "metadata": {
        "filename": "manohar.B.docx",
        "processed_date": "2025-09-24T08:45:44.022148+00:00"
    },
    "raw_text": "                                                                                                       \nManohar\nSr. Java/J2EE Developer\nEmail ID: manohar.bmr36@gmail.com                                                                                Contact: 281 247 -0818\n\nProfessional Summary: \nHaving 8 years of experience in all phases of software development life cycle (SDLC), which includes User Interaction, Business Analysis/Modeling, Design/Architecture, Development, Implementation, Integration, Documentation, Testing, and Deployment of desktop, Enterprise and Web based applications using Java, J2EE technologies. Knowledge on Java features like lambda expressions and Java Stream API. \nStrong application development experience in using Agile Software Development methodologies like Scrum, Sprint and Traditional software models like Waterfall and TDD. \nExpertise in developing web pages using HTML, CSS, JavaScript, jQuery, Ajax, AngularJS, Bootstrap with webpage cross browser compatibility and responsive web design and Server scripting language like Node JS, BackboneJS. \nManaged Amazon Web Services like EC2, S3 bucket, ELB, Auto-Scaling, SNS, SQS, AMI, IAM, Dynamo DB, Elastic Search, Virtual Private Cloud (VPC) through AWS Console and API Integration. \nProficient in implementation of frameworks like Struts, Spring (Spring MVC, Spring Web Flow, Spring IOC, Spring AOP, Spring Security, Spring Boot, Spring Data, Spring Batch, Spring TX), JSF, AJAX frameworks (Rich Faces, MyFaces) and ORM frameworks like Hibernate, IBATIS. \nExpertise in Web Front End Technologies Struts, Tag Libraries and Struts custom validation rules, Tiles, JSTL, Java Script, DHTML and XML/XSL. \nDeveloped web-based enterprise applications using core Java, J2EE, Servlets, JSP, EJB, JMS, JDBC, Hibernate, Web Services (SOAP and REST), MVC framework (Struts, Spring MVC), SQL and Object-Oriented Programming techniques. Expertise XML technologies like DTD, XSD, XSLT and various parsers like DOM, SAX and JAXB. \nProficient in core java concepts like Collection Framework, Multi-threading, Generics, Annotations, Serialization, Thread pools, JavaBeans, Externalization. \nExtensive experience working with RDBMS such as MySQL, MS SQL Server, Teradata, DB2, Oracle. \nExperience in working with the NoSQL Database like MongoDB to manage extremely large data sets. \nExpertise in Creating Hibernate configuration file, Hibernate Mapping files and defined persistence classes to persist the data into Oracle Database. Expertise at JDBC API for connection and access to databases. \nProficient in developing Web Services, related technologies &frame works: WSDL, SOAP, REST, JAX-WS, JAXB, JAX-RPC, AXIS and Jersey, SOAP UI and generating client's client using Eclipse for Web Services consumption. \nHands on experience in creation, Configuration and management of MQ series objects like Queue Managers. \nWorked on deployment, installation, configuration and issues with Application servers like Apache Tomcat, IBM Web Sphere, BEA WebLogic and JBoss Enterprise Application Server. \nExperience in implementing Design Patterns like Singleton, Factory, MVC, Data Access Object and Business Delegate. Experienced in developing UML diagrams with Star UML, Rational Rose. \nActively involved in the DevOps streamlining process through Jenkins CI and CD Release Automation. \nExtensively worked on Pivotal Tracker and JIRA tools for tracking stories in a Project in a different methodology of Software Development Life Cycle. Hands on experience in building tools like ANT, Maven, Gradle.\nConfigured and created application log files using Log4J to trace required application messages. \nHaving Experience on UNIX, Linux commands and Deployment of Applications in Server and ability to work effectively on Windows platforms. Subversion SVN, CVS, GIT and Visual Source Safe as versioning software tools.\nAbility to work effectively in cross-functional team environments and experience of providing training to business user. Experience on different IDEs such as RAD, Eclipse, Spring Tool Suite, and IntelliJ.\nGood understanding of Business workflow, Business logic and Business methods for further implementation of user requirement in a distributed application environment.\n\n\nTechnical Skills:\nLanguages: C, C++, Java, J2EE, SQL, PL/SQL, Python \nEnterprise Java: Java, J2EE, Swing, RMI, Sockets, JDBC, Servlets, JSP, JMS, Java Beans, JSTL, JSF, Struts, EJB, Spring, JTA, JNDI and JPA \nWeb/XML Technologies: HTML, CSS, JavaScript, JQuery, AngularJS, XML, XSD, XSL/XSLT, SAX/DOM, AJAX, JSON, Backbone JS, DOJO, NodeJS. \nTools & Frameworks: Struts, Hibernate, Spring MVC, Spring Web Flow, Spring IOC, Spring AOP, JMS, JSF, Log4J, SOA, Jasper reports, SOAP UI, Spring Boot, Spring Batch, Spring Security, Spring Data. \nWeb services: SOAP, RESTful, UDDI, WSDL, JAX-RPC, JAX-RS JAX-WS, JAX-B, Apache Axis2, Apache CFX, JMS, MQ, AWS \nWeb/App Servers: Web Sphere, Apache, Tomcat, JBoss, EAP, WebLogic \nDatabase: Oracle, SQL-Server, MySQL server, MS SQL, IBM DB2, MongoDB and NoSQL \nDevelopment Tools: Eclipse, RAD, Spring Tool Suite (STS), IntelliJ \nO-R mapping: Hibernate, JPA, JTA \nModeling/ CASE Tools: Rational Rose, MS Visio Professional, Star UML \nTesting Tools/ Others: JUnit, SoapUI, Putty, Rational Clear Quest, RTC, LoadUI, JIRA \nVersion Control: GIT, CVS, SVN, Rational clear case, Star Team \nPlatforms: Windows, Sun Solaris, UNIX \nCloud Technologies: AWS EC2, Micro Services\n\nEducational Details:\nBachelors in Computer Science Engineering, Siddhartha Engineering College, Acharya Nagarjuna University, Vijayawada, Andhra Pradesh, India from 2005-2009.\n\nCertifications:\nOracle Certified Associate (OCA)\nSun Certified Java Developer (SCJD)\n\nProfessional Experience:\nFirst Citizens Bank, Raleigh NC                                                                January 2017 to Present\nRole: Sr. Java/ J2EE developer\nProject Description: Customer Accounts API Development/Enhancement and Migration to Cloud (AWS) - Customer Accounts Interface retrieves all financial accounts on basis of input parameters. Set of rules must be satisfied so that the client has access to accumulated data on his screen, which is fetched from multiple reference data stores (backend), using Restful web services. It also includes migration of application to cloud using Amazon web services to take advantages of high availability, high scalability and fault tolerance system. Everyday transactions are in millions for this application.\n \nResponsibilities: \nExtensive experience using framework APIs like Struts, Spring, iBatis and Hibernate. \nInterfaced with the Oracle back-end using Hibernate Framework and XML config files. \nDeveloped Servlets and JSPs based on MVC pattern using Struts and Spring Framework. \nExpertise in MVC Architecture using JSF, Struts framework and implementing custom tag libraries. \nMonitoring of network services (SMTP, POP3, HTTP, NNTP, ICMP, SNMP, FTP, SSH) using Nagios. \nIntegration of Automated Build with Deployment Pipeline. Currently installed Chef Server and clients to pick up the Build from Jenkins repository and deploy in target environments (Integration, QA, and Production). \nHands on experience in Amazon Web Services (AWS) provisioning and good knowledge of AWS services like EC2, S3. Created playbooks in Ansible to manage configurations and deployments to remote machines. \nDeveloped and maintained UNIX/Perl/ANT scripts for Java/J2EE build and release tasks. \nDeveloped and implemented two Service Endpoints (end to end) in Java using Play framework, Akka server Hazel cast. Developed the GUI module DMT using Struts framework, JavaScript, DOJO, Ajax, HTML and DHTML. \nImplemented a high-performance data processing platform using Apache Kafka, Apache Cassandra, and Apache Spark to analyze stock data. Designed and modified User Interfaces using JSP, JavaScript, CSS and jQuery. \nCreated various UI components for different web pages using HTML, JavaScript, ExtJS. \nGood experience with Hibernate, AJAX, PERL and Unix Shell Scripting. \nCreated various Parser programs to extract data from Autosys, Tibco Business Objects, XML, Informatica, Java, and database views using Scala. Developed Data Access Objects (DAO) using JDBC API for Database access. \nExcellent understanding of java concepts like Multithreading, String handling and construct and optimized SQL queries in DB2. Used JPA with Entity Beans for interacting with Persistence Layer for CRUD operations. \nInvolved in writing SQL & PL SQL - Stored procedures, functions, sequences, triggers, cursors, object types. \nWorked with Amazon Web Services (EC2, Elastic search). \nWrote business rules using Drools and business logic processing customs declarations. \nIntegrate Bootstrap in existing web applications. Involved in coding for the presentation layer using jQuery, jQuery Mobile, NodeJS and JavaScript. Transferred cloudscape to DB2 for WebSphere Portal. \nUsed Apache Camel in the JBoss Fuse ESB as the integration platform for SOA Services. \nAll the functionality is implemented using Spring IO / Spring Boot, Microservices and Hibernate ORM. \nCreation of REST Web Services for the management of data using Apache CXF. \nCreated XML Schema, XML template and XSL. Developed Web Services Application using SOAP. \nUsed Web services - WSDL and SOAP for getting credit card information from third party. \nExecuted project using waterfall model and practiced Agile Project Management & performed the Scrum Master role for specific projects/requirements as appropriate. Used Rally for Agile project management. \nInvolved in designing UML Use case diagrams, Class diagrams, and Sequence diagrams using Rational Rose. \nWorked on the Struts framework and JSP and Struts tag libraries to page display technology. \nEnhanced user experience by designing new web features using MVC Framework like NodeJS accommodate these advanced and fast technologies and used other modules of spring DI & AOP. \nDeveloped experience in dealing with Cassandra, Mongo db, Big Data and Big Data Analytics. \nDeveloped custom tags, JSTL to support custom User Interfaces. \nUsed Scala for coding the components in Play and Akka and Used Maven to build and generate code analysis reports. Involved in implementing Programmatic transaction management using AOP. \nUnit testing of developed product features using Junit and Mockito frameworks as part of development cycle. \nInvolved in building a single page and cross browser compatible web application using Angular-JS (Angular routing) and bootstrap. Responsible for implementation of java integration components for JBPM and DROOLS. \nExtensively used XSD for validations of XML transfer to the different Web Services. \nExecuted the test steps defined in Test Cases manually and reporting the bugs in JIRA. \nPerformed Unit as well as System Integration test (SIT) and User Acceptance Test (UAT) for all the modules. \n \nEnvironment: Java 1.7, JSP, J2EE, Spring 3 MVC, Hibernate 3, Spring Boot, Spring Batch, Spring Dependency Injection, Struts, Jquery 1.7, JSF, Dojo, JavaScript, CSS, Ajax, Angular Js, Html5,PERL, REST, Crud, PL/SQL, Spring JDBC, Apache CXF, SOAP, Restful Webservices, Akka, NodeJS, ReactJS, DROOLS,MULE, Mockito, Spring Boot, bootstrap, MongoDB, SVN, NoSQL, MicroServices, Scala, Maven, XML, XSD, Apache Tomcat, Oracle 11g, SQL, Google Web Kit (GWT), Jira, python, Cassandra, SOA.\n\nSun Life Financial, Wellesley Hills, MA                                                                October 2015 to December 2016\nRole: Java/J2EE Developer\nProject Description: Customer Accounts Interface retrieves all financial accounts on basis of input parameters. Set of rules must be satisfied so that the client has access to accumulated data on his screen, which is fetched from multiple reference data stores (backend), using Restful web services. It also includes migration of application to cloud using Amazon web services to take advantages of high availability, high scalability and fault tolerance system. Everyday transactions are in millions for this application. \n \nResponsibilities: \nImplemented Agile (Scrum) Methodology that includes daily scrum with team, sprint planning and estimating the tasks for the user stories. Implemented business logic using Session Beans, Servlets. \nDesign and development of the new Technical flow based on JAVA/J2EE technologies. \nInvolved in analyzing business requirements and compose them into a technical use cases. \nInvolved in Spring Framework- Spring Dependencies and Spring Annotations. \nUsed Spring MVC on the web layer and business delegate and DAO on the business layer. \nDeveloped server-side utilities using Java Beans, XML, and EJB. Involved in developing code for obtaining bean references from Configuration file. Developing traits and case classes etc. in Scala. \nInvolved in the UI development using HTML5, CSS3, JavaScript, jQuery, JSON, AngularJS, Bootstrap and AJAX. \nUsed Spring MVC (Model View Controller) to intercept the user requests and used various controllers to delegate the request flow to the Backend tier of the application. \nCreated and presented training materials surrounding adoption of the Groovy language. \nExtensive experience with AWS (AWS Cloud Formation, AWS ECS and EC2, S3 etc.) \nMigrating servers, databases, and applications from On-premises to AWS, Azure and Google Cloud Platform. \nDesigned and Implemented the DAO layer using Spring, Hibernate. \nUtilized Spring Interceptor concept for detecting the suspicious calls. \nRedesigning the existing web application with new technologies like Bootstrap, Angular.js. \nUsed Core Java concepts such as multi-threading, collections, garbage collection and other JEE technologies during development phase and used different design patterns. \nBuild semantic templates effectively with handlebars.js. \nInvolved in application that makes different API calls across all the layers to get the user job done. \nDeveloped frontend of application using Angular.JS framework. Created new JSP views to incorporate backend functionality to display on the UI screens using client rich technologies like jQuery, JavaScript, HTML5, CSS3 files. \nResponsible for providing the client-side Java script validations and Server-side Bean Validation Framework as per the requirements. Managed and maintained Oracle and NoSQL databases in production domain. \nDesigned and developed Microservices business components using Spring Boot. Consumed REST based Microservices with Rest template based on RESTful APIs. \nDeveloped DAO for communicating with the database. Used Oracle11g for communicating. \nInvolved in writing SQL Stored Procedures, Functions, and Views for Oracle 11g database. \nDesigned and implemented a NoSQL based database and associated RESTful web service that persists high-volume user profile data for vertical teams. \nInvestigated various NoSQL database alternatives and methods for online database compression. \nDesigned and prototyped parts of a NoSQL database with sinfonia- style coordination. \nDeployed the application using Apache Tomcat, Web Logic Application Servers. \nExperienced in developing web applications using JSP, Servlets, JDBC, JavaScript, AJAX, and jQuery, HTML5, JSON, AngularJS, ExtJS, Bootstrap, ReactJS and CSS3. \nUsed Rally, JIRA for bug reporting and tasks and issue tracking. \nInvolved in application design like Sequence Diagrams, Class Diagrams using Rational Rose tool. \nCode reviews and peer reviews in every iteration. Developing business logic using Scala. \nMaintain multithreading using Executors framework & created a fixed thread pool to maintain it. \nWorked on Oracle 10g/11g, Elastic Search, MYSQL, NoSQL, MongoDB. \nUsed Jenkins for deploying in different Environments and Used Log4j for the logging. \nSupported extensively for functional as well as for Performance testing. \nUsed SVN for Version Control System and Used Maven for build automation. \n \nEnvironment: Java 1.5, J2EE, XML, Spring, EJB, AngularJS, HandlebarJS, JSP, jQuery, AngularJS, NodeJS, Restful API web services, Hibernate 3.0, AWS, JSON, Groovy, Scala, NoSQL, Java Beans, Agile/Scrum methodology, JavaScript, HTML, Eclipse, WebLogic, Microservices, Bootstrap, Spring Boot, Scala, Apache Tomcat, MongoDB, Jenkins, PL/SQL, Oracle 10g, NoSQL, Junit, Maven, JBOSS, SQL developer, Junit, Maven, SVN.\n\nState Farm Insurance, Atlanta, GA                                                               July 2014 to September 2015\nRole: Sr. Java/J2EE Developer Consultant\nProject Description: The Auto Insurance Application allows customers to access their account online. This application provides employers to access customer information to process & authorize claims of the customers and generates free quotes for the customers depending on the type of insurance package they selected. It also facilitates customers to pay their monthly premiums. \n \nResponsibilities:\nInvolved in various phases of Software Development Life Cycle (SDLC) of the application like Requirement gathering, Design, Analysis and Code development. \nGenerated Use case diagrams, Class diagrams, and Sequence diagrams using Rational Rose. \nDeveloping and editing user Interface Screens using JSP, HTML5.0, JavaScript and node.js. \nImprove presentation of webpages CSS 3.0, Adobe Flash and jQuery plug - INS. \nCreating custom, general use modules and components, which extend the elements and modules of core AngularJS. Worked on core java, using file operations to read system file (downloads) and to present on JSP. \nUsed Twitter Bootstrap to create responsive web pages, which can have displayed properly in different screen sizes. Used display tag libraries for decoration and used display table for reports and grid designs. \nInvolved in the development of underwriting process, which involves communications without side systems using IBM MQ and JMS. Developed Struts Action classes using Struts controller component. \nUsed PL/SQL stored procedures for applications that needed to execute as part of a scheduling mechanisms. \nDeveloped and debugged the Servlets with JOBSS. \nImplemented the application using design patterns such as Session Façade, Business Delegate, Adaptor, Bean Factory and Singleton. Created struts form beans, action classes, JSPs following Struts framework standards. \nUsed ReactJS to create views to hook up models to the DOM and synchronize data with server as a Single \nPage Application (SPA). Developed the applications using Java, J2EE, Struts, JDBC, etc.\nDeveloped and implemented Swing, spring and J2EE based MVC (Model-View-Controller) framework for the application. Implemented pre-authentication and data base security using spring security. \nDesigning and implementing scalable, RESTful and microservices based mobile back-end. The back-end is being written in Java using Spring Boot for simplicity and scalability. \nUsed Spring JDBC to retrieve the data and represented the data in the form of tree which has seven hierarchies and implemented drag and drop functionality to it. Involved in fixing bugs the bugs or defects in the application. \nUsed Apache Camel for messaging technology glue with routing. It joins together messaging start and end points allowing the transference of messages from different sources to different destinations. \nUsed Spring Batch as spring batch jobs can meet the requirements of reliability, robustness, and traceability, which are essential for automatic processing of large amount of data. \nUsed SAX XML API to parse the XML and populate the values for a bean. \nUsed Jasper to generate rich content reports. Writing Scala classes to interact with the database. \nImplemented persistence layer using Spring JDBC that use the POJOs to represent the persistence database tuples. These POJOs are serialized Java Classes that would not have the business processes. \nImproved stability and performance of the Scala plugin for Eclipse, using product feedback from customers and internal users. Apache ANT was used for the entire build process. \nAssisted in planning, installation and execution of new JRules ILOG server, application server and Team server and developed designs and strategies for business rules and address problems including configuration of ILOG Rules. Worked on Pivotal Cloud Foundry to host Cloud based Applications. \nInvolved in building a scalable email system using amazon simple email service, s3 for handling heavy loads. \nExperience in re-architecting monolithic architecture service into micro services based architecture using spring boot and pivotal cloud foundry. Implemented multiple high-performance Mongo DB replica set.\nWorked on Mongo DB concepts such as locking, transactions, indexes, replications, schema design. \nWorked with other NoSQL and Big data technologies such as Cassandra and Hadoop \nUsed Mockito for unit tests development of Test-driven Development (TDD). \nDeployed the application in JBOSS production server running in Linux platform. \nUsed log4j for logging errors in the application. Worked more with Selenium Testers in this project.\nInvolved in JAD sessions to gather requirements from the end clients. \nInvolved in unit testing, troubleshooting and debugging. Modifying existing programs with enhancements. \nSuccessfully executing offshore modeling by effective and on time knowledge sharing with offshore project groups through weekly team meetings and daily status update calls. \nWorked as the part of a core team to monitor and enhance the performance of the application. \nProvide guidance and direction to team members in their day-to-day activities.\n\nEnvironment: EJB3.0, Spring, JSP1.2, Servlets2.1, Jasper reports, JMS, IBM MQ, XML, SOAP, UDDI, WSDL, JDBC, JavaScript, XSLT, UML, HTML, JNDI, SQL, PL/SQL, API, TDD, Linux, JAD, Scala, NoSQL, Python, AngularJS, ReactJS, ExtJS, BootStrap, AWS, Web Services, Selenium, Apache Camel, POJO, Scala, RESTful, Microservices, Spring Boot, JBoss 6.x, ClearCase, Drools, Apache, Log4J, ANT, JUnit, Mockito, MongoDB, Eclipse, Pivotal Cloud Foundry. \n\nRed Cross, Lake Placid, NY                                                                       October 2013 to June 2014\nRole: Java developer\nDescription: Maintain manual details of blood camps, donor details, blood stock, blood types, instruments stock, bill generation etc. 'Red Cross Online' is an intranet system application to be used by doctors and technicians to reduce daily activities time, i.e. Register donor, blood camp details in the Red Cross Blood Bank. The system provides cross matching details, grouping details, bill generation, certificates for Blood Donors and organizations and information on blood stock, furniture and equipment's stocks.\n\nResponsibilities:\nInvolved in gathering business requirements, analyzing the project and created technical specification documents including use Cases, Class, Sequence and Activity Diagrams using Enterprise Architect. \nDeveloped the policy change screens using Struts, XHTML, and JQuery. \nDeveloped the vehicle change module using Spring and Hibernate. \nWritten managed beans and validators for UI interactions and configured the JSF for the web application. \nExperience in producing SOAP and REST Web Services and micro services for delivery of software products across the enterprise. Developed Java web application using JAXB, JAXP, XHTML, and XSLT. \nUsed Oracle SQL Developer 1.2.0 for Oracle 11g for running queries to confirm the results from the application. Build Data Access Layer using Elastic Search for Recommendation view for repair events. \nWrote Validation framework and implemented data validation rules for quality checks in the EDI claim files. \nUsed JUnit to write repeatable tests mainly for unit testing. Created REST API and Spring Batch Jobs.\nExperience in producing SOAP and REST Web Services. \nExperienced in ELDAP (Enterprise Lightweight Directory Access Protocol) administration.\nWritten spring services and DAO'S in the service layer for Oracle data retrieval operations using Hibernate. \nDeveloped modules for validating the data according to business rules and used Castor to convert data into array of xml strings. Used Spring data framework for CRUD operations on MongoDB. \nDeveloped Message Handler Adapter, which converts the data objects into XML message and invoke an enterprise service and vice-versa using JAVA, JMS and MQ Series. \nDeveloped Junits using Mockito and spring junit Runner frame work. \nConfigured the spring application context and integrated with Hibernate for data purposes. \nWrote Junit test cases for testing all spring service calls. Used JIRA issue tracker to file the bugs. \nCreated Spring batch jobs to write/read data from Oracle/HBase. \nUsed Apache Axis2 to create artifacts required for invoking SOAP web services. \nConfigured Maven pom.xml for dependency management and build purposes. \nConsumed Restful web services using spring to get data from external systems and configured log4j for logging purposes. Used iBATIS 2.x in data access layer to access and update information in the database. \nExperience in working with Groovy on Grails framework which makes creating complex workflows much simpler. Implemented migration from Oracle coherence cache with Hazel cast cache. \nExperience with unit testing using JUnit and writing build scripts for ANT and Maven. \nInvolved in creation of web services, WSDL and web methods with Annotation in hibernate, Implemented Web Services in JAXP based on SOAP protocols using XML and XSLT. \nDeployed the application artifacts on WebLogic and involved in entire software development life cycle. \nParticipated in builds and deployments using maven to dev, QA and production and resolved bugs. \nParticipated in code reviews and used maven for builds and SVN for source control. \nFollowed good coding standards with usage of JUnit, EasyMock and Checkstyle. \n \nEnvironment: Java 1.6, J2EE, Struts, Eclipse, Spring 3.2, JQuery, Oracle 10c, Hibernate 4, HTML, CSS, Apache Axis2, Spring batch, LDAP, JAXP, Junit, Elastic Search , REST Web Services, Maven and SVN, iBATIS 2.x, Spring Integration 2.x, XML, JSON, AngularJS, NodeJS, ExtJS, Bootstrap, JavaScript, Spring Source Tool Suite 2.9(STS), Multithreading, SOA, Log4j, Jenkins, MongoDB, Tomcat server, JIRA, SQL, Apache CXF, Junit 3.0, TestNG, SOAP, Agile, UML (Rational Rose) , OOAD, Mockito, Groovy/Grails, PL/SQL, AJAX\n\nCipla Health Care, Hyderabad, Telangana, India                                September 2011 to September 2013\nRole: Java/ J2EE Developer \nProject Description: Cipla Health Insurance Hub with single-point Internet access provides stream lined process for claims processing and transactional processing. The Application Client, Web Client tier is developed using spring, JSP, and Servlets. Business Logic and Messaging is developed using EJB, XML, SOAP, WSDL, and Business Objects. Used Web Sphere Application Server, MQ Series with JMS for Messaging and Teradata as Database. \n \nResponsibilities: \nUsed WSAD as IDE in developing EJB and deploying in server. \nGenerated Session beans, CMP and Message Driven Beans, and deployed on WebSphere. \nImplemented JMS to asynchronously send and receive messages, Error Tickets placed in Message Queues automatically generated and updated into database by Remedy Trigger. \nThe Application Servers were installed in clustered mode to balance the load in the case of increased traffic. \nInstalled, configured, maintained and administered Linux / UNIX operating systems and components. \nSkillful with the use of network connectivity tools like Ping, Netstat, Nslookup, Traceroute, Dig, Ethtool. \nPrepared prototypes for the project, based on the user requirements. \nImplemented migration from Oracle coherence cache with Hazel cast cache. \nInvolved in developing code for obtaining bean references in spring framework using Dependency Injection (DI) or Inversion of Control (IOC) using annotations. Worked on coding of Servlets and EJB communication. \nRabbitMQ was used to send/receive asynchronous data. Used Struts framework for presentation layer. \nDeveloped Micro Service to provide RESTful API utilizing Spring Boot with Spring MVC. \nUsed Hibernate framework for data persistence. VMware ESXi 5.5/vSphere Installation & Configuration. \nInvolved in creating the Hibernate POJO Objects and mapped using Hibernate Annotations for data persistence. \nExperience in working with the Columnar NoSQL Database like HBase, Cassandra to manage extremely large data sets. Have experience in pushing Urban Code Deploy applications to Cloud Foundry. \nExperience in working with Groovy on Grails framework which makes creating complex workflows much simpler. \nInvolved in working with Scrum Agile process with two-week iterations delivering new features and working software at each iteration. Prepared Low-Level Designs (LLDs) and UNIT Test Cases. \nImplemented SOLR search engine to search the products. Used Spring DI/MVC/AOP modules. \nPerformed Code Review to ensure Organization and Project level standards are met and checked for redundant code. Implemented different levels of logging and timely backups using Log4j. \nUsed putty for UNIX login to run the batch jobs and check server logs. \nInstallation, Configuration and maintenance of Hosted VMware products. \nPlayed a key role in the development and maintenance of the application. \nWorked on Distributed messaging system RabbitMQ to send messages to Existing Applications. \nExperience in installing and configuring kick start in Linux. \nExtensive experience in setup, configuration, upgrade, maintenance, performance monitoring and troubleshooting on different UNIX platforms like Linux, VMWARE and system software and hardware \nPerformed Unit Testing and System Integration Testing. \n \nEnvironment: Java 1.6, J2EE, XML, Spring3.2, Hibernate 3.0, SOAP, Web Services, Business Objects, SAX/DOM, WebSphere Application Server 8.1, WSAD, JMS, JDBC, JSP2.0, Java Servlets, Apache Camel, Hazel, Oracle 11g, SVN, HTML, JavaScript, jQuery, search engine, JBoss, Axis 2 Web Services, WSDL, XHTML, SOAP, PL/SQL.\n\nHSBC, Hyderabad, Telangana, India                                                          June 2009 to August 2011\nRole: J2EE Developer\nProject Description: This project involves developing a J2EE based framework to support dynamic report creation from various distributed databases. The framework supports dynamic PDF report an open source PDF generation library. The framework facilitates new report formats and databases by using xml configuration files. \n\nResponsibilities: \nInvolved in requirements gathering and analysis from the existing system. Captured requirements using Use Cases and Sequence Diagrams. Wrote Test Cases using JUNIT as a framework.\nDeveloped the application using Struts, Servlets and JSP for the presentation layer along with JavaScript for the client-side validations. Developed and used JSP custom tags in the web tier to dynamically generate web pages. \nWorked with Struts (MVC Paradigm) components such as Action Mapping, Action class, Dispatch action class, Action Form bean. Implemented spring service layer with dependency wiring, transaction, DAO and annotations. \nDesigned and developed the Java bean components and O/R Mapping using Hibernate. \nExtensively worked on Spring Bean Wiring, Spring DAO and Spring AOP modules. \nImplemented Spring AOP in exception handling, which it reduces the development time to handle the exceptions. Used PL/SQL, Stored Procedures for handling Oracle database. \nDeveloped a code for Web services using XML, SOAP and used SOAP UI tool for testing the services. \nProficient in testing Web Pages functionalities and raising defects. \nParticipated in Code Reviews for better quality assurance and Debugged the application Module. \nDeployed the application on Tomcat server. Used ANT for compilation and building the project.\nInvolved in planning process of iterations under the Agile Scrum methodology. \nUsed CVS for version control system. Used Log4J for logging the user events. \n\nEnvironment: Java, J2EE, JSP, Servlets, JMS, Hibernate, Spring DI & AOP, Web Services, UML, HTML, DHTML, PL/SQL, JavaScript, Struts, CSS, XML, Tomcat, Log4j, CVS, Oracle, SQL server, JUnit, JNDI , Eclipse, SOAP.\n",
    "extracted_skills": [
        "agile",
        "angular",
        "ansible",
        "aws",
        "azure",
        "cassandra",
        "communication",
        "css",
        "ec2",
        "git",
        "google cloud",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "lambda",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "project management",
        "python",
        "r",
        "rest api",
        "s3",
        "scala",
        "scrum",
        "spark",
        "sql"
    ]
}