{
    "id": "resume_8e5086ec-5758-43c7-a944-183f8cd2aba7",
    "metadata": {
        "filename": "Mehul.docx",
        "processed_date": "2025-09-24T08:45:44.081088+00:00"
    },
    "raw_text": "Mehul Panchal\nNew York City, NY\nGreen Card\nPanchalprofessional@gmail.com\t                                  646-610-9085\n\n Summary\n\nOver 8 years of strong experience in the field of Information Technology with emphasis on Business Analyst & Quality Analyst in Agile, Scrum and Waterfall methodologies for various web-based, client Server, Mobile and Windows Applications\nExperience in Agile methodologies and Test driven development.\nUnderstanding, and transmitting the business requirements of the project into application functionality and detailed test plans.\nSkilled in Eliciting User Requirements, translating them into data, functional, quality, and usability requirements.\nExperienced in requirements management, controlling change and preparing RTM (Requirement Traceability Matrix).\nExtensively worked on Business Process Models with understanding of Business Process Modeling Notations (BPMN). Created new models and updated the existing models. Used tools like Rational Rose, MS Visio.\nStrong experience in preparing Business Requirements Document (BRD), Use Case Specifications, Functional Specifications.\nWell acquainted with Workflows and (UML) (Unified Modeling Language) diagrams such as, Use case diagrams, activity diagrams and Sequence diagrams.\nActively used Joint Requirement Planning (JRP), Joint Application Development (JAD) and Rapid Application Development (RAD) sessions for requirements gathering and brainstorming ideas.\nProven track record in analysis and evaluation of Information Systems issues, analytical problem solving, decision-making and technical writing.\nResearched on Best Industry Practices and explained the Business Users of the benefits and costs associated in implementing the same.\nExperience in end-to-end testing, UAT (User Acceptance Test) and user training for customers.\nFamiliar with SOX compliance standards. Exposure to QA Principles like CMM levels and Six Sigma.\nMulti-Tasking and Organizational Aptitudes, with proven experience in Development and Implementation of Strategies.\nHighly disciplined and yet flexible approach to software development. A sound understanding of the balance that must exist between customer satisfaction and technical excellence. Proficient at all levels and stages of the software development cycle, from conception to production and maintenance.\nSelf-motivated and objective driven, with the philosophy that “change is the only constant”. Expert in the development of adaptable software infrastructures and frameworks designed to support transformations and growth.\nExcellent communication and interpersonal skills, capable of communicating with highly technical engineering teams. Exceptional mediator between external and internal customers, capable of interpreting their needs and positions to ensure the coherence and success of the projects Proficient with tools such as MS Office, Visual Source Safe, CVS.\nStrong Analytical and Problem Solving skills.\n\n\nTECHNOLOGIES \nProject Management Tools: MS Visio, Rational Clear Quest, MS Project.\nMarketing/BPM/ETL/BI: Primo Marketing Studio (AMS), IBM Data Stage, Oracle Warehouse Builder, SQL*Loader, Business Objects, Micro Strategy, SSRS, PACE.\nTesting tools: Quality Center, QTP, REST, SOAP UI, Selenium WebDriver/RC/IDE/GRID, TOAD Facets.\nBug Tracking/Testing: Quality Center, JIRA, MS Visual Studio, Rational Quality Manager, Rational Functional Tester, Rational Performance Tester, QTP, UAT.\nBusiness Modeling: MS Visio, Rational Requisite Pro, Concept Draw Pro.\nProject Methodologies: Rational Unified Process (RUP), Software Development Life Cycle (SDLC), Agile (Scrum, XP),Waterfall, RAD, Six Sigma, V-Model.\nDatabases/Web server:  Oracle 10g/9i, MySQL, MS-Access, SQL.\nStrengths: Good innovation streak, Quick learner, Team player, excellent interpersonal communication skills.\n\n\nProfessional Experience\n\n\nPayPal, Dallas, Texas\t \t\t\t\t\t                                          May 2014 – Present \nBusiness Analyst/Scrum Master\n\nPayPal Holdings, Inc. is an American company operating a worldwide online payments system that supports online money transfers and serves as an electronic alternative to traditional paper methods like checks and money orders. As a quality Business Analyst I worked on projects related to online Banking Portal applications that allow the customers to check the status of the credit card and allow the user to activate/de-activate mobile alerts using the web portal.\n\nResponsibilities:\n\nInteracted with the client as part of the Requirements Engineering team to finalize the project scope.\nConducted interviews with end-users to collect requirement and business process information.\nDesigned and developed project document templates based on SDLC methodology.\nParticipated in various stages of data and requirement analysis for project needs.\nIdentified internal and external system requirements, design and configuration set-up, also created User Documentation and conducted training classes.\nSuccessfully conducted JAD sessions, which helped synchronize the different stakeholders on their objectives and helped the developers to have a clear-cut picture of the project.\nWorked with Subject Matter Experts (SME), project team members (business and technical), to define technology application for the business and system requirements. Also worked with the QA Team Lead to develop QA standards and ensure compliance with all regulatory requirements.\nPerformed task decomposition (WBS), delegated tasks and monitored project milestones using MS Project.\nAssisted the PM in setting realistic project expectations and in evaluating the impact of changes on the project plans accordingly and conducted project related presentations.\nDeveloped business requirement specification documents as well as high-level project plan.\nDeveloped User Stories within JIRA by working closely with the Product Owner, and took the User story from story phrase to story narrative to story scope and all the way to User Story acceptance criteria. \nConducted Sprint Planning Meeting, Sprint Review/Demo and Sprint Retrospective Meeting\nDesigned and developed Use Cases, Activity Diagrams, Sequence Diagrams, and OOD using UML.\nAssisted the PM in performing Risk Assessment, Management and Mitigation.\nResponsible for data load reviews, analysis and verification of ETL logic design for Data Warehouse and data marts in star schema methodology with conformed dimension and fact tables.\nData mapping, logical data modelling, created class diagrams and ER diagrams and used SQL queries to filter data within the Oracle database\nResponsible for maintaining and help build client relationships between the offshore team, to bridge the gap with clients, able to comfortably converse with all facets in the clients organization.\nAssumed ownership of Use Case Diagrams, Use Case narratives and other various artifacts.\nCo-ordinate with developers, testers, business managers, and clients to implement the requirements and incorporated the changes as per client needs for the Regulatory purpose.\nParticipated in the logical and physical design sessions, assisted and developed high and low level design documents.\nManaged scope creep and worked with the scrum master to manage sprint time-box when business would request to change the requirements after development had started.\nAssisted with user testing of systems, developing and maintaining quality procedures, and ensuring that appropriate documentation is in place.\nExecuted Systems Integration Test Plan, including the comparison of actual results to expected results.\nPerformed Integration Testing and System Testing and bug fixing.\n\n\nLiberty Mutual, Dover, NH\t \t\t\t\t\t                 March 2012 – April 2014\nQuality &Business Analyst\n\nLiberty Mutual Insurance, is an American diversified global insurer, and the fourth-largest property and casualty insurer in the United States. Worked on Projects on claim adjudication, claim processing and provider Management.\n\nResponsibilities:\n\nAnalyzed Business Requirements and developed Test Procedures, Test Cases using Quality Center. \nDefining and performing the Test strategies and associated scripts for the verification and validation of the application and ensuring that it meets all defined business requirements and associated functionality.\nWorked on Project Charter, BRD (Business Requirement Document), User Stories, FSD (Functional Specification Document), and Use Case document. \nExperienced in designing and developing project document templates based on SDLC methodology. \nParticipated in all phases of Software Development Life Cycle (Agile, SCRUM, RUP, and Iterative).  \nCreated test cases from the business user requirements specifications for GUI, Functionality, Security, and Boundary testing \nExecuted all the test cases using the Quality Center \nPerformed testing for positive and negative test cases to test the response of the system \nConducted Functional testing, Regression testing, Integration testing to check the system is working according to the requirement specifications \nPerformed Database testing, Functional testing, and Smoke testing. \nTested the validity of the data cleaning done by the ETL by writing SQL and Scripts.\nPrepare and use test data/cases to verify accuracy and completeness of ETL programs/objects. \nUsed TOAD to confirm the correctness of the data in the backend. \nWriting SQL queries to retrieve data from data warehouse and source databases. \nUsed ETL Tools to validate and compare data of source and target databases. \nDeveloped QTP test scripts to support regression testing \nEnhanced the test programming with conditional statements, and comments to the test scripts \nConducted splitting of the different actions and making them reusable in QTP scripts \nUsed checkpoints to verify the properties of various objects in QTP \nUsed the Test Batch Runner to run several tests in succession using QTP \nParameterized the scripts and conducted regression testing using different data from the datasheets in QTP \nUsed SOAPUI for web service testing. \nUser Interface testing was done to validate so that the navigation of the application properly reflects business functions and requirements, including window-to-window, screen-to-screen, image-to-image, field-to-field and use of access methods. \nKeep track of the Daily Defect Status with the help of QA Metrics and then entering them into Test Director \nAutomated the daily, weekly and monthly reports by executing through CRON and sending the reports as an attachment as email to Microsoft outlook, which reduced manual intervention of using ftp.\nParticipated in the meetings with the project manager, business analyst and team lead for the planning of testing schedules and prioritizing the deliverables.\n\nCapital One, Dover, NH\t \t\t\t\t\t           February 2010 – March 2011\nQuality/Business Analyst\n\n\nCapital One is a financial holding company which offers a broad spectrum of financial products and services. The central idea behind the project was to easily enable the travel benefit program on a new card Venture which includes enrollment of card members, qualification and statement crediting, customer servicing and financial settlement and reporting. \n\nResponsibilities:\n\nWorked with stakeholders and management team in gathering various requirements for the project.\nWritten Use Cases, Use Cases designed detailed logical class and activity diagrams, other high-level process flows.\nAnalyzed business requirements and segregated them into high level and low level Use Cases, Activity Diagrams, State Chart Diagrams using Rational Rose according to UML standard thus defining the Data Process Models. \nPerformed Requirement Elicitation and Analysis and conducted JAD sessions for communicating with Stakeholders and Project directors during Iteration.\nAssisted in preparing User Stories in the Product Backlog after the collection of Functional Requirements from System Users that provided appropriate scope of work for technical team to develop prototype and overall system. \nDiscussed requirements with other members of the team like the Application developers, Project Manager and Data Base Administrators. \nAssisted and helped on the work with the easily implementation of web services by RESTful \nDesigned detailed logical class, use case, activity diagrams and other high-level process flows. \nInteracted with clients to assess needs, identify key challenges, and define project Scope and deliverables. \nLiaised with teams in Business, Team Leads and PMs in global offices for various operations. \nWorked in a Scrum Agile process with 2 week iterations and was involved in Sprint/Release planning. Participated in daily SCRUM meetings in an agile environment, retrospective meetings for issues, incorporate suggestions, decisions in code development. \nGathered requirements from SMEs and generated reports to help the business to visualize the design. \nInterpreted customer business needs and translate them into application requirements. \nCreated reports to help users track cash flows by business areas/department. \nPrioritized project efforts, develop project plans, process flows, UML Model and Use Cases. \nMaintained and update digital reports and dashboards based on client requirements. \nIdentified and prepared business requirements- gap analysis.\nDeveloped Project management plan which included background including \"CONSTRAINTS\" AND \"ASSUMPTIONS, business process, success measures, roles, & responsibilities, project plan for schedule/timelines and resource utilization. \nReported status, milestones, and project plan tracking to project management and project owners on a weekly basis. Used MS Visio for flow-charts, process model of the application.\n\n\nHealth Now, Buffalo, NY\t \t\t\t\t\t      February 2009 – January  2010\nQuality &Business Analyst\n\nHealthNow is an American managed health care company, which sells traditional and consumer directed health care insurance plans and related services, such as medical, pharmaceutical, dental, behavioral health, long-term care, and disability plans.  Worked on Projects on claim adjudication, claim processing and provider Management.\n\nResponsibilities:\n\nAnalyzed requirements, participated in Design Discussions and prepared Design document.\nWorked on all phases of SDLC (Software Development Life Cycle) and Quality Assurance methodologies of Agile.\nServed as a lead for the Facets testing effort, involved in the Reviewing of Requirements Specification with functional manger and technical specialists.\nDevelop testing strategy and test plan, outlined various capabilities of the testing process. Describe the tasks of each testing capability, outlined roles and responsibilities related to the testing process.\nWrote test cases in Quality Center derived from the BRD and generated a Traceability Matrix for testing purposes.\nImplemented manual testing of a web-based application, including backend, functional and integration testing \nDid gap analysis forHIPAA4010 to 5010 and 837 transactions, and analyzed error.\nWrote Test scenarios and test cases for testing the migration of EDI4010 to 5010 and the processing of member enrollment and benefits, (834) batch jobs corresponding to the claims (837).\nInvolved in forward mapping from ICD 9 to ICD10 and backward mapping from ICD10 to ICD9 using General equivalence Mappings (GEM).\nExperience with Networks pricer-testing and figuring pricing for procedures and claims based on information inputted into Networx.\nPerformed data validation testing after the ETL process using Informatica. \nUsed Rally for making the development organization faster, leaner and more agile and to get on the track with the User stories and to improve iteration planning practices. \nInvolved in manual testing, preparation of Business Process Test Cases and Test Execution. \nInvolved in the review of test cases and test scenarios of the Policy module. \nPerformed report testing for both SSRS Reports and BI Reports via Business Objects. \nMaintained all the documentation in Share point. \nWorked on Guidewire Policy Center for ETL Testing. \nUsed Informatica Workflow Manager to schedule and run Informatica mappings and Workflow Monitor to monitor ETL execution and logs.\nInvolved in configuration testing and end-to-end testing of FACETS Enrollment, Claim Processing, Subscriber/Member, Provider and Utilization Management module.\nIdentify scope systems that will be modified by the ICD-10 project to accommodate ICD-10code and /or downstream impacts steaming from ICD-10 codes.\nTested the HIPPA EDI transactions according to test scenarios and verify the data on different modules.\nInvolved in Black box testing, System testing, integration testing, Functional testing, Smoking testing, Regression Testing and User Acceptance Testing (UAT) manually and Automation tool.\nExecuted Automated Test scripts using Selenium.​\nWrote SQL queries to test the application for data integrity and verified the contents of the data table.\nExtensively used SQL queries to check storage and accuracy of data in database table\nManaged defect tracking process, which include prioritize bugs, assign bugs and verifying bugs using QC.\nHandling/Tracking defect in the Quality center and export in to Excel by using filter.\n\n\nEducation\n\nProfessional SCRUM Master (PSM) in agile methodology (2017)\nScrum.org\n\nMasters in Science \nSandiego State, CA\n\nBachelors in Science \nJNTU University Hyderabad, India\n\n\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "jira",
        "mysql",
        "oracle",
        "problem solving",
        "project management",
        "scrum",
        "sql"
    ]
}