{
    "id": "resume_fae4bc3d-5faa-4ca9-ab6f-3fd4a6ff1863",
    "metadata": {
        "filename": "Murali_Project Manager QA.DOCX",
        "processed_date": "2025-09-24T08:45:44.585454+00:00"
    },
    "raw_text": "Muralidhar Chandrashekar\nncmuralidhar@gmail.com\n(+1) 314 814 9041 \nSt Louis, MO\nPROFESSIONAL SUMMARY:\n\nCurrently working for the client AT&T in St Louis, MO as Manager-Testing with 2 PMs reporting from onshore and a testing team of 10 from offshore. E2E testing/QA of AT&T Mobile Apps on different platforms – iOS, Android & Windows.\n14+ years of IT experience which includes major contribution towards Project Management, Agile PMO, Quality Management, Analysis, Testing and Resource Management. Proactive, performance-driven IT professional, with Project Manager experience of more than 5 years. \nExtensive experience in SDLC using Waterfall and Agile (Scrum) methodologies.\nWell experienced in Creating Product Plan, Schedule, Estimation and monitoring.\nExtensive experience in different Tools Quality Center, JIRA, Rally, TDP - IBM Rational\nHaving experience of working in the Global Delivery Model for more than 8 years and has experience in handling multiple projects at a time both at Offshore and Onsite.\nExtensive experience in Agile Ceremonies and Methodologies.\nDaily interaction with technology staff including Developers, DevOps Engineers, Product management (Product Owners), and Program management to identify scope of projects and engage in creating Project plan, schedule, monitoring & execution of projects till closure.\nManage Large and big projects worth of $4 to $5 Million across multiple teams and different locations.\nGood Exposure to Global Delivery Model, done resourcing, planning, estimation, performance appraisal, team building for 20- 30 resources at Onsite & Offshore. \nExcellent communication, interpersonal, analytical skills and strong ability to perform as part of a team.\nGreat understanding of Agile Manifesto, Frameworks and Principles. \nExposure to Mobile Automation tool – ZAP-fiX for automating test scripts to be run on various mobile devices.\nAround 2yrs of experience on VOIP Protocol – SIP\n4 years of experience in telecom switching projects in Java.\n5+ years of onsite exposure at client locations in USA, UK.\n\nTECHNICAL COMPETENCIES:\n\nSOFT SKILLS:\n\nProject planning & resource allocation.\nVery good customer interaction skills.\nAbility to multi-task, and work under project pressure.\nExcellent verbal/written communication skills, teamwork and interpersonal skills.\nAbility to apply creativity and intelligence to craft test suites that uncover product defects.\nAbility to debug complicated system-level issues.\nReproduction and debugging of customer issues, handling of field queries.\nPreparation of Estimation, Effort Tracking , Customer Co-ordination, Test reporting.\nScheduling, Defect Tracking, Metrics Reporting.\nDefect Prediction & Management.\nOn time delivery of testing tasks.\nTeam Handling (Goal Settings, Evaluation, Employee Development).\nManage day to day operations for assigned staff and projects, including project management tasks such as resource allocation and prioritization, business case estimates, software quality assessments, and time reporting. Also includes anticipating needs and implications of decisions, proactively working to identify, clarify, resolve issues, and removing barriers within and outside the organization in a timely manner.\nProven ability to engage and focus team members on highest priority, highest risk tasks. \nSelf-motivated, apply good judgment, and willing and able to mentor others.\n\t\t                  \t\nACADEMICS:\n\nMBA in International Business (2010) through distance learning from Pondicherry University, India.\nBachelor of Engineering in Computer Science (2002), with an aggregate of 74% from Bangalore University, India.\n\nPROJECTS SUMMARY:\n\nIntegration System Testing of AT&T Mobile Apps on various mobile platforms\n\tMar2013-Present\n\nRole:\tProject Manager\nResponsibilities: \tPlan, execute, and finalize projects within triple constraints working in an Onshore/Offshore delivery model -  delivering on time, within budget and scope objectives, including acquiring resources and coordinating efforts of team members to deliver projects according to plan. Identify, effectively communicate, resolve project issues and risks and develop risk mitigation plans. Effectively communicate project health to stakeholders. Coach, mentor, and motivate team members, influencing them to take positive action and accountability for assigned work.\nEnvironment:\tiOS, Android and Windows native apps for AT&T mobile, tablets.\n\n\n    \tWith a team of 2 PMs reporting to me at onshore and 10 offshore testing resources, I’m responsible for delivering the AT&T mobile applications into the market on different platforms such as iPhone, Android & Windows. These apps are both in native and browser version. Every 3-4 months we work on new versions of the app and after several rounds of QA testing on the app, make it available to the end user.\nHave in depth knowledge of E2E Mobile Application to support wider range of Mobile Operation System, Mobile Devices and Tablets, our project feasibility guidelines and, most importantly, our proprietary customizations to Enterprise Mobile Platform with users to assist in determining current operating procedures, clarify program intent, identify problems and suggest modifications to adapt existing programs to new requirements and to increase operating efficiencies.\nFair knowledge to automation tools such as ZAP-fiX and Mobile labs to automate test scripts. The myAT&T mobile experience has 4 different versions - 3 Mobile apps and a Mobile HTML web site. Every release has new features being added for AT&T mobile customers. Working in agile methodology demands continuous development and testing in parallel one sprint after another. Interacting with client right from the requirements stage, highlighting about the issues, risks, reporting daily status of project related activities, to delivery of the application.\n\nDevelopment Integration Testing (DIT)\t\t\t     July2011-Feb2013\n\nResponsibilities\t: Smoke testing of daily/weekly builds, Writing test cases, execution and \n   Reporting the status/defects to the management team both \n   Onshore/offshore.\t\nEnvironment\t\t:  Eclipse Galileo, RTC\n\n    Handling a team of 5 doing smoke testing of our client product UDA. UDA (Unified Desktop Application) is a PC based software application that is used by many Stock Exchange brokers around the globe who do world-wide trading by making calls, texting & voice mail features. Every release has a new set of features added to the product and the same will be tested offshore by my team before releasing the product for System testing.  The team identifies the defect well before in hand and informs the development team about them before the Quality Testing team raises a bug. Ours is like an interface between the Dev and Quality Engineering team working together to report issues and the status first-hand to the management team both offshore & onshore.\n\nInteroperability Testing \t\t\t\t\t\t\tJan2011-June2011\n\nResponsibilities\t: Interoperability testing with the third party vendor devices\t\nEnvironment\t\t:  Audio Codes Media Gateway, Cisco Call Manager, Avaya PBX\n\nTesting our client’s VOIP product with other vendors in the market like Cisco and Avaya. Also testing the SBC (Session Border Controller) functionality of the Media Gateway from Audio Codes.\n\n\nDunkin UDA Simulator\t\t\t\t\t\t\tMay2010-Dec2010\n\nResponsibilities\t: Development, Testing\t\nEnvironment\t\t:  PHP, XML, HTML, AJAX, JSON, JQUERY, MYSQL\n\n\tUDA stands for Unified Desktop Application. UDA is basically a client application on the user’s desktop used to make/receive calls just like a physical telephone. There are two modules here client (UDAC) and server (UDAS). To test the individual UDAC and UDAS, PHP simulator was developed to verify the XML message exchanges between the components. This would aid in unit testing of the individual modules without any dependency on the other module. \n\nDunkin CDI Simulator\t\t\t\t\t\t\t     Feb2010 –May2010\n\nResponsibilities\t: Development, Testing\t\nEnvironment \t  \t: Linux, C++, libCurl\n\nDuring the initial iterations of Dunkin development, there was a need for testing the elements individually with the corresponding supported protocols. With the aim of testing Voice Application Server, the CDI Simulator is an attempt to develop and execute the Integration test cases automatically by simulating Turret & UDA using third party tools. CDI simulator will enable testing of all performance related capacities. The objective of this CDI simulator follows: \n\nMultiple instances of this automation software shall be invoked to simulate multiple Turrets\nAbility to respond to messages from A/S especially for various voice applications.\nAbility to update Line Status from Application Server.\nAbility to easily upgrade simulator to different Dunkin releases.\nAid in system performance testing, especially for application/media servers.\nProvides the performance test report based on collected data e.g. CPU usage, successful calls, number of simultaneous calls, CPS, Line Status updates, call failure etc.\n\nIQ/Impact: IPC Professional Services\t\t\t\t\t        Mar2009 – Jan2010\n\nResponsibilities\t: Development, Testing\t\nEnvironment\t\t: Windows, Core Java, Servlet, FLEX, Swing, SQL Server \n\t\t\t\t\t\t\t\t\t     \n IQ/Impact is a PC application that works in conjunction with the trader’s turret. The application provides the trader, the ability to monitor and answer incoming calls as well as place calls on hold, transfer or divert them and retrieve or disconnect the call. The Trader can also make outbound calls from the directory, call list, and a follow up list or by manually typing in a number or a contact name. They can also intercom another trader as well as be aware of other trader’s presence. The application can also invoke a screen pop within Outlook or any web browser based application.\n\n\nIPC: Switch/Network configuration and Demo                                    Apr2008 – Feb2009\n\nResponsibilities\t: Configuring, Installing, Testing & Bug Fixing.\n\t     \nThis job involved configuring the IPC’s Alliance switch, TCS server and IQ/Impact application in the network, test it thoroughly and educating the end customer on the usage. Also involved co-coordinating with the offshore and onshore team during the installation task. Have installed/configured for 4 different clients, onsite.\n\n SIP Registration & Location Server for Release 3.0                            Sep2007 – Mar2008\n\nClient\t\t\t\t: CopperCom, Florida, USA\nLanguage/Technology\t: C++, LDAP Netscape Directory Server\nTeam Size\t\t\t: 4\nDuration\t\t\t: 7 months\n\nProject Details:  Registration server keeps track of the SIP users registered (called binding) with a database called Location services, provides authentication capabilities to registrations. Registration details are maintained to provide SIP access to only valid users. Whereas the Location Services contains a list of bindings of address-of-record keys to zero or more contact addresses\n\nRole:  Involved in Design, Implementation and Testing.\n\nImplementation of COPS Protocol \t\t\t                           May2007 – Aug2007\n\nRole\t\t: Involved in Design, Implementation, Unit Testing and Bug Fixing.\nClient\t\t: Tech Mahindra, Internal Project\nTeam Size\t: 4\nDuration\t: 4 months\n\nProject Details:  Implementation of Common Open Policy Service (COPS) Protocol Frame work. This protocol is basically a Client/Server Protocol where the Server (PDP) analyzes the information, takes the decision, and relays it to the client (PEP)\n\n\n\nImplementation of SIP CALEA for Release 3.21 \t                            Nov2006 – Apr2007\n\nRole\t\t: Involved in Design, Implementation, Unit Testing and Bug Fixing.\nClient\t\t: CopperCom, Florida, USA\nTeam Size\t: 4\nDuration\t: 6 months\n\nProject Details:  Law enforcement agencies are authorized to tap and record suspect voice conversations. This provision presently available with circuit switched networks needs to be extended to VOIP network, and trace signaling messages and tap into voice sessions that occur on the IP network as well. \n\n\n\nMGCP CC Call Processing feature for Release 3.2 \t                      May2006 – Oct2006\n\nRole\t\t: Involved in Design, Implementation, Unit Testing and Bug Fixing.\nClient\t\t: CopperCom, Florida, USA\nTeam Size\t: 12\nDuration\t: 6 months\n\nProject Details:  MGCP - protocol used to route packet calls over the IP network.  The CSX2100 switch to route MGCP-to-MGCP, both to subscribers on the switch. Additionally, the CSX2100 will serve MGCP-to-PSTN, PSTN-to-MGCP, MGCP-to-SIP, and SIP-to-MGCP calls.\n\n\nRegression Testing of all Rel 3.1 Features \t\t                            Feb2006 – Apr2006\n\nRole\t\t: Involved in Designing of Test Cases and executing them.\nClient\t\t: CopperCom, Florida, USA\nTeam Size\t: 4\nDuration\t: 3 months\n\nProject Details:  Testing was an onsite support at the client’s place in Boca Raton, Florida, to help them in their testing activities and the FCS (First Customer Shipment) requirements.\n\n\nBBG-IP Enhancements \t\t\t                                               Feb2005 – Feb2006 \n\nRole\t\t\t\t: High Level Design, GUI and Database modification.\nClient\t\t\t\t: CopperCom, Florida, USA\nLanguage/Technology\t: Java\nDatabase\t\t\t: LDAP Netscape Directory Server5.1\nDuration\t\t\t: 12 months\n\t\t\nProject Details: \nCall Transfer sub-features – Restricting Call Transfer to certain call types; e.g., intra group only, etc.\nCall Forwarding sub-features – Providing Call Forwarding variations tailoring for BBG usage.\nIntercom Dialing Expansion – Allowing 3-5 digit extension dialing, where the extension number needs not be aligned with the PSTN Direct Dialed address.  Currently, the CSX system supports 4-digit extension dialing, where the 4 digits are the same as the last four digits of the PSTN DDD address.\nAssume Dial ‘9’ options to ‘escape’ to PSTN dialing.  In this case, special prefixes are assumed for Intercom Dialing.\nVariable length Inter-Digit Timing – Accommodating ‘slow-dialers.’ \nIncreased number of lines per BBG system – Extending the BBG capacity to allow up to 1,000 subscriber lines per BBG.\n\n\n\nDS3 Probe\t\t\t\t                                                             Oct2004 – Jan2005\n\nRole\t\t\t\t: Writing test application for testing the framer driver. \nClient\t\t\t\t: Paradyne, USA\nLanguage/Technology\t: C, VxWorks\nTeam Size\t\t\t: 3\nDuration\t\t\t: 4 months\n\nProject Details: The product consists of DS3 Line Interface cards – one for incoming traffic and second for outgoing traffic. The DS3 lines carry ATM cells in which IP and Non IP traffic are embedded. The DS3 Line Interface Unit terminates the DS3. In the receive direction the DS3 header is removed and the Header Error check is performed and the ATM cells are transmitted on the UTOPIA Bus. In the Transmit direction the DS3 framer frames the ATM cells received from the UTOPIA Bus. The T3 driver in the physical layer will ensure that the DS3 line is configured and the Performance monitoring and Alarms handling activities for the DS3 are in place.\n\n\nSystem Maintenance for Rel3.21\t\t                                       Jan2004–Sep2004\t\t\t\nRole\t\t: Integration Testing, Bug Fixing, Installations and Configurations.\nClient\t\t: CopperCom, Florida, USA\nTeam Size\t: 4\nDuration\t: 9 months\n\nProject Details:  Fixing bugs as part of the Releases delivered so far. It’s a maintenance activity supporting the customer with their customer’s issues. Upgrading the switch software with the new releases and configuring the new network elements.\n\n\nUpdating database for all features from Release 2.2b\t                 July2003 – Dec2003\n\nRole\t\t\t\t: Involved in Design, Implementation and Testing.\nClient\t\t\t\t: CopperCom, Florida, USA\nLanguage/Technology\t: Java, LDAP Netscape Directory Server \nTeam Size\t\t\t: 2\nDuration\t\t\t: 6 months\n\nProject Details:  Creating new database objects and modifying the existing ones for feature interactions with the LDAP Netscape Directory Server. Also caching the required objects for faster access.\n\n\n\n\nWORKSHOPS/TRAINING PROGRAMS ATTENDED:\n\nTechnical\n\nFlex3.0 Training – Edujini Labs – Oct’08\nSQL Training – ESG-B,Tech Mahindra – Aug’08\nXML Training - ESG-B, Tech Mahindra – Feb’08\nProfessional training on Sun Java Programming (Java 2) from a Sun Authorized Training   center - Oct05\nC/C++ - Apr'04\n\nNon-Technical\n\nCreativity & Innovation – L&D, Tech Mahindra – Feb’09\nEffective Problem Solving - L&D, Tech Mahindra – Feb’09\nWorking in a Team – L&D, Tech Mahindra – Jan09\nUS Accent Training – L&D, Tech Mahindra – Oct’08\nStress Management – L&D, Tech Mahindra – Dec’07\nExcellence in Customer Service – L&D, Tech Mahindra – Dec’07\nPersuasive Presentation  – by L&D, Tech Mahindra – Nov’07\nBusiness communication skills training by Alliance academy, Bangalore - Sep'05\n\n\nPERSONAL Details:\n\nEmail\t\t\t: ncmuralidhar@gmail.com\nMobile\t\t\t: (+1)3148149041\nVisa Details\t\t: H1B/I-94 until July2018\n",
    "extracted_skills": [
        "agile",
        "communication",
        "html",
        "java",
        "jira",
        "mysql",
        "php",
        "problem solving",
        "project management",
        "scrum",
        "sql",
        "teamwork"
    ]
}