{
    "id": "resume_1fb7714d-fa03-4067-a457-1454d86634a0",
    "metadata": {
        "filename": "Naren Sr.BA .docx",
        "processed_date": "2025-09-24T08:45:44.713810+00:00"
    },
    "raw_text": "NARENDRA LENKA\n973-910-8941\nnarenlenka99@gmail.com\n___________________________________________________________________________________________\n\nSummary\n9+ years of experience in Analyzing Business Needs, Gathering Requirements, Planning, Organizing, Documenting, Business Process Definition, Risk Analysis, Use Case Analysis and testing software applications. \nExpertise Domain Knowledge: Finance (Insurance, Mortgage), Web/E-Commerce, Healthcare, Media and Manufacturing.\nExpertise on Software Development Life Cycle (SDLC) including Software Architecture, Object Oriented programming, Designing & Prototyping, Development, Debugging, Testing, Database Activities, Integration, Maintenance and Production Support of Software Applications in Client/Server environment.\nExperienced with Rational Unified Process (RUP), Agile (Scrum) Software Development, Waterfall Methodology and UML. \nExtensive knowledge in working with Agile methodology, Scrum sessions, creation of product backlog, Sprints as a part of the team with shared aim and shared responsibility and participated in Sprint planning and Sprint review meetings. Experience conducting Scrum meetings. \nExpertise knowledge and experienced in Enterprise Resource Planning (ERP) and Customer Relationship Management (CRM).\nExperienced in design and development stages of E-Commerce reporting needs through ad-hoc queries to ensure the reporting tools are to the department’s standards, which in turn will be used as a means for the decision-making process. \nHands on experience in various business applications to support and improve business operations including day to day administrations of IBM AS 400 iSeries.\nExtensively worked on FACETS & compliance of ICD 9 to ICD 10 and HIPAA (Health Insurance Portability and Accountability Act) 4010 and 5010 EDI transactions.\nExperience with Medicare, Medicaid and commercial insurances in HIPAA ANSI X12 formats including […] […] 820, 835, 837, 997.\nExperience with the working of Medicare (Part A, B, C and D) and Medicaid Health Insurance Policies, Personal Injury Protection (PIP) insurance, billing experience with life and disability in health plans with thorough understanding of CPT coding, HCFA-1500 and CMS-1500 claim forms and reimbursement forms. \nExperience in Development, Administration, Configuration, Implementation, Lightning and support experience with Salesforce CRM platform. \nSkilled in Tableau Desktop for data visualization through various charts such as bar charts, line charts, combination charts, pivot table, scatter plots, pie charts and packed bubbles and use multiple measures for comparison such as Individual Axes, Blended Axes, and Dual Axes. \nExperienced conducting Joint Requirement Planning (JRP) and Joint Application Development (JAD) sessions with end-users, SMEs' and development team for project meetings, walkthroughs and customer interviews. \nDocumentation includes: Business Process Documentation, Business Process Modeling, HLDD's (SRS/SSR/BRD) and LLDD's (FRD/RTM). \nDeveloped Use Case Diagrams, Sequence Diagrams, Data Flow Diagrams, Process Flow Diagrams and Activity Diagrams. \nExperienced developing User Interface Requirements, User Interface Specifications, UI/Front End mockup screens, Wireframes using Visio and PowerPoint and Usability Standards.\nExperienced in using ARIS, VISIO, MS office, Power BI & Sway.\nWorked extensively with IBM tools for dimensional modeling, data migration, data transformation, data loading, data modeling, metadata model, catalog creation, cube modeling, SDK development and performance tuning. \nExperienced in understanding database structures and write SQL/PLSQL. \nExtensively experienced in data analysis, ETL techniques for loading high volumes of data and smooth structural flow of the data. \nAdept at writing Data Mapping Documents, Data Transformation Rules, Maintaining Data Dictionary, Data Migration Documents and Interface Requirements Documents. \nExperienced in writing Test Plans, Test Cases, Generate Test Scripts and Maintain Reports for defect tracking. \nExperienced in test automation, identifying tests to be automated, designing test automation framework, building automated scripts, modifying existing scripts, executing and result analysis. \nExperienced in Integration Testing, System Testing, User Acceptance Testing (UAT), Functional Testing/Black Box Testing, Grey Box Testing, Regression Testing, GUI Testing, Performance Testing.\nExtensively experienced of XML and HTML. Worked with XML format and being able to read XML files and use XMP parsing tools.\nExperienced using Confluence (wiki) for documentation.\nExperienced in generating reporting and business intelligence using Crystal reports and Tableau. \n\nEducation\nMasters of business administration (MBA)\t – ICFAI University, 2009, India \nBachelors of Life Sciences (MBBC)\t\t – ANU University, 2007, India\t    \n\nTechnical Skills\nPlatforms:\t\t\tMS-DOS, Windows (95, 98, Me, NT, 2000, XP, Vista, 7), UNIX, Linux\nMethodologies/Process:\tSDLC, Waterfall, Agile, SCRUM, UML, RUP\nModeling Methodology:\tUML, MS-Visio\nModelling Tool: \t\tIBM system architect, ARIS\nDatabases:\t\t\tOracle, SQL Server, DB2, MySQL, MS Access\nDatabase Tool:\t\t\tTOAD\nETL Tools:\t\t\tSSIS, Informatica Power Center 9.X\nTool:\t\t\t\tJIRA, Confluence\nReporting/BI:\t\t\tCrystal Reports, Tableau\t\nLanguages:\t\t\tSQL, PL/SQL, COBOL85, SCOBOL, UNIX/Linux shell\nGUI:\t\t\t\tSharePoint, Visio, MS Office (Word, Excel, PowerPoint, Access)\nWeb Technologies:\t\tHTML, CSS, XML, SOAPUI, Web Services\nTest Management Tools:\tBugzilla, QuickTestPro(QTP)9.2, HP Quality Center/ALM\n\n\nProfessional Experience\n\nClient:\tOUTFRONT MEDIA, MANHATTAN, NY\t\t\t\tJul’16 to Current ◊ 1 yr. 3months\nRole:\tSr. Business Systems Analyst\nResponsibilities:\nPrepared Business Requirements Documents (BRD), Systems Requirement Specifications (SRS), Use Case Specifications, Supplementary documents, Activity Diagrams, Data Trace Map Document & Data Quality Mapping documents depending upon the various media client’s needs.\nDeveloped User Interface Requirements, User Interface Specifications, UI/Front End mockup screens, Wireframes using Visio, Balsamiq and Usability Standards.\nCreated ‘Technical Specifications Documents’ based on the ‘Functional Design Document’ for the ETL coding to build the data mart for most of the out of home campaigns.\nConducted GAP analysis, identified and documented business bottle necks for improving the system.\nDiscussions with various stakeholders on deciding the backlog priorities based on user points and business value to design release backlog.\nUsing INVEST and SMART principles for writing well defined user stories and tasks.\nManaging daily scrum meetings, working on the team impediments and communicating with product owner.\nNegotiating effectively with Product owner on the release priorities and exceptional scope creep.\nIdentified the individual RMAs through Tableau and then tracked them down through our return database.\nWorked on Salesforce1 Platform to build Mobile App by enabling Lightning Components for use in Salesforce1 mobile platform to make Lightning Application mobile. \nRetrieved some data and its functionality from Third-Party API's and displayed within the lightning component. \nOverseeing, analyzing and responding to issues and Helpdesk tickets for IBM I-Series AS/400 by monitoring batch production, logging all issues on problem tracking system and escalating when needed.\nConducting JAD (Joint application design) across various cross functional teams and JAR (Joint Application Resolution) sessions for effective requirements management.\nConvert, clean analyze and document large data files prior to importing databases and present data-insights to management.\nDesigning, Developing and supporting interactive Tableau Dashboard reports. Involved in creating Dashboards and needed using Tableau Desktop and published them to Tableau server. \nRecommending Dashboards per Tableau visualization features and delivering reports to business team on timely manner. \nTriaging the tickets and prioritizing them based on the business priority in a product owner capacity.\nDefining the user acceptance criteria for the issues from the production and passing it on to the appropriate cross functional team.\nResolving and closing the tickets which don’t need intervention of the technical team which are non-functional properties of the application.\nMaintaining appropriate matrices for defect tracking and conducting follow up meetings with the team to understand the status of the tickets assigned.\nTesting the resolved tickets thoroughly and demonstrating them with the product owners/ business users for approval and closing them.\nCollected detailed requirements for E-commerce systems including our B2C websites, eBay store, YouTube channel and mobile properties. \nDocumented and wireframe system integrations between customer-facing E-commerce properties, 3rd party systems and back-end ERP systems.\nExecuted system testing & integration testing. Provided extensive support for User Acceptance Testing (UAT). \nInvolved in writing SQL queries and Database Checkpoints to verify data quality and calculations, reviews Performed data validation testing writing SQL queries. \nTested Web Services, IBM, XML, WSDL using SOAPUI tool and modified the end points when we worked on different servers and different versions of Web Services. \nAnalyzed large amounts of data sets to determine optimal way to aggregate and report on it using Tableau. \nCreated JIRA request in tracking tool workflow for the released deliverables. \nTo understand and enhance the controls within Risk Management & Reporting & to work with the key stakeholders (business and Risk IT) to ensure all requirements surrounding the end to end process are clearly understood and appropriate, clear solutions are designed, documented and implemented.\nAbility to produce high quality requirement specifications to support ERP functional design development.\n\nClient:\tSTATE OF NEW YORK, ALBANY, NY\t\t                              Jun’15– Jun’16 ◊ 1yr.\nRole:\tBusiness System Analyst(BSA)\nResponsibilities:\nWrote BRD and Use case documentation for requirements analysis, design specifications, user’s guides, installation guides, custom training materials, or project work plan Conceptualization of new requirements from customers, user surveys and competitors. \nProactively partners with other key areas within E-commerce and Merchandising to develop a solid understanding of the analytical, creative and technical aspects of the business. \nChecking the integrity of the newly added features and their effect to the existing ones with integrity testing and regression testing.\nMapping system requirements with Test Cases, manually executed test cases in QC, ensuring traceability of Test Cases back to the Business Requirements.\nEffectively handling sign off process with stake holders at different levels and executing good conflict resolution approaches.\nCreated several mock-ups and wireframes for GUI to understand the user requirements.\nPrepared user stories, master feature list, product backlog working with Product Owners and SMEs.\nDeveloped Design Models using IBM system architect such as Class and Sequence diagrams using Rational Software Architect (RSA).\nDeveloped Web Front End (GUI) using HTML/HTML5, DHTML, CSS3, JQuery, JQuery UI, AJAX, JSON, XML, XSL, JSP, Spring MVC, and developed validations using Java Script and AJAX.\nWorked as Business Intelligence developer using data visualizations tools with specialization on Tableau.\nPlanning the business analysis effort, determining how requirements will be managed, and reviewing deliverables created by all the BAs on the team for quality and consistency.\nConducting GAP Analysis and documenting the current state and future state, after understanding the Vision from the Business Group and the Technology Group.\nAcknowledging and accepting the issues/tickets for the production support team.\nDoing the root cause analysis (RCA) of the issue by reproducing the issue and analyzing the business rules around it.\nCreate and measure key KPIs such as Engaged Visitors, Checkout Drop rate, Conversion rates etc. to gaze the gaps and ensure the success of digital E-commerce Platform.\nWorked on Performance tuning in the existing PLSQL and Informatica ETL code. \nDeveloped intuitive reports in SSRS, Report builder and Tableau to support pre-assumed business questions.\nExtensively used Spring IOC and Hibernate persistence API and Hibernate was used as ORM mapping tool at the persistence layer.\nDeveloped User Interface Requirements, User Interface Specifications, UI/Front End mockup screens, Wireframes using Visio, Balsamiq, PowerPoint and Usability Standards.\nAttended Change Request Meetings to ensure products and changes are fully documented for further Test changes.\nDeveloped and executed unit test cases and test scripts using TDD, Junit, JMock.\nWorked on My SQL, Oracle DBMS SQL Server 2008 database for creating DB tables and DB objects.\nUtilized GIT for version control.\nInvolved in QA/UAT and Production support, defect fixing, monitoring server and error logs and Foreseeing the Potential Issues, and escalating to the higher levels.\nCreated scripts for training all internal users, support personnel, and external customers on ERP system changes and new procedures.\n\nClient: GENENTECH INC., SUNNYVALE, CA\t                           Jan’13 – May’15 ◊ 2 yr. 5months\nRole: Business System Analyst\nResponsibilities:\nProviding business solutions developed from a unique blend of industry experience, technological expertise, and service excellence, DST also helps its clients in improving efficiencies while also effectively managing the processes, information and products that directly impact quality outcomes. \nIdentified requirements for the customer and provided Gap Analysis as per the customer requirements and the application.\nCo-Managing the Change Control process for the entire project by facilitating group meetings, one-on-one interview sessions and email correspondence with work stream owners to discuss the impact of Change Request on the project.\nAnalyze all applications and recommend necessary upgrades and patches and perform troubleshoot on all issues.\nDeveloped ETL programs for various types of Data Extracting, Data transformation and Data loading.\nCreated ETL packages for incremental loading of fact table and handling slowly change changing dimensions.\nReviewed Compliance Instructions/mandates to verify were impact occur with the Facets Business Rules Configuration SME Compliance team, assessing of the applications when reviewing and handling Compliance/Mandates. \nWorked on HIPAA transaction codes specifically on EDI 837 (medical claims), 835 (medical claim payments), 276 (claim status), 277 (claim status response), and 834 (premium payments) to incorporate enhancements to existing efforts on capturing and mapping. \nAnalyzed the business requirement as per the HIPAA rules and regulations to follow in creating business requirement documents. \nPrepared various claims and member-eligibility files for the required test, submitting test output to the (vendor) clients through specific format and several similar functions. \nInvolved in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Medicaid Claims. \nResearched and understood the claims adjudication and reimbursement systems based on HIPAA X12 4010 standards. \nInvolved in creating 837(I, D, P), 835, 277-U, 270/271, 276/277, 278, 820 and 834 transactions processing flow. \nFor Project management purpose worked on Microsoft Project, used Microsoft Share Point for maintaining the updated documentation. \nScheduled meetings with technical personnel to determine technical parameters for EDI and other related processes, including communication, security, and privacy. \nCreated transaction sets requirements, usually with Microsoft Excel, for transactions such as: HIPAA 270/271, 276/277, 835, 837-(I, P, & D), 835 Remittances and others. \nHandled Benefit Implementation/Configuration for Provider contract / pricing setup for FACETS.\nBusiness process mapping - Preparation of process maps for as-is and to-be process highlighting the process changes and key system validation points. \nPerformed Requirement Analysis by gathering both functional and nonfunctional requirements based on interactions with the process owners & stake holders and document analysis, represented them in Requirements Traceability Matrix (RTM). \nMet with client groups to determine requirements and goals. Utilized Rational Unified Process (RUP) to configure and develop process, standards, and procedures and create a Business Requirements Document. \nDocumented the project by generating forms & reports, Business Requirements document, Use case diagrams, activity diagrams and process flows. \nHeld several JAD and JAR sessions to facilitate interaction with Business Users. Conducted Gap Analysis on the AS-IS and TO-BE business processes. \nDeveloped Use Case diagrams, Business flow diagrams, Activity/State diagrams and Sequence diagrams so that developers and other stake holders can understand the business process by using UML. \nPrepared User Acceptance Testing test plans and conducted UAT Testing. Also, prepared user reference documentation. \n\nClient: NATIONWIDE INSURANCE, Lincoln, NE\t\t            Oct’10 – Dec’12 ◊ 2yrs. 2months\nRole: Business System Analyst\n\nResponsibilities:\nValidated and processed insurance policy change requests, delegating to other departments/people when necessary. \nGathered Requirements from various business areas like Claims, Provider Relations, Enrollment, Finance and Benefits Administration for their updates to the Claim Processing Engine. \nDocumented business processes related to external agents, policy changes, including banks and clearing houses.\nOptimized Stored Procedures, SSIS Packages, Table Indexes and was involved in performance tuning of Databases \nDevelop mappings/sessions to migrate these objects From SAP BW/R3 to SFDC application using Informatica and Data Loader.\nAnalyzed Database structures and data, developed Data Mapping Documents and User Manuals.\nParticipate in periodic meetings and maintain all applications for productions and plan appropriate various strategies.\nMaintain effective relationships with various system administrators and development teams.\nCoordinated with the off-shore QA Team members in evaluating and developing the Test Plans, Test cases, Test and Evaluation strategy and methods for unit testing, functional testing and usability testing.\nAnalytics – ability to aggregate large amounts of data, filter for importance, and tie together in a context relevant “story” designed to drive action.\nContinuously drive better business practice and increased value to the business through consistent measurement and improvement of key activities Measurements.\nFamiliarity with XML and the ability to explain XML web service request and response elements and functionality to client development teams in the context of clients intended usage.\nCreated User Training Manuals for Equity and Fixed Income trades and provided the training to Portfolio managers, Director, Investment Managers, SME’s and Analysts.\nActively participated in Triage calls, Huddle boards and performed Usability Standards Validation, Story Acceptance Testing, User Acceptance Testing and Regression Testing. \nReviewed documents developed by other team members in the group for adherence to standards, consistency, and readability. \nWorked in conjunction with testers(QA), developers and other team members in validation and testing of complex project scenarios and in the maintenance of Quality standards of projects\nWell versed in Requirements/Change management, Impact Analysis and Gap Analysis.\nDeveloped a Root Cause Analysis report using MS Office.\n\nClient:\tGM Electrical Systems Pvt. Ltd, Hyderabad, India\tJun’08 - Sep’10 ◊ 2yrs. 3months\nRole:\tBusiness Analyst \n\nResponsibilities: \nPlayed a vital role in the creation and maintenance of iteration plan, documented and prioritized the scope by identifying the client's requirements. \nDeveloped Cost-Benefit Analysis and gathered requirements to drive small-budget IT-driven technology projects.\nProvided executives with analytics and decision-support tools used as the basis for reorganization, consolidation and relocation strategies.\nPerformed quality assurance, system integration and user acceptance testing facilitating on-time & on-budget of enterprise implementations.\nTo interface with risk officers both locally and in globally dispersed regions, gaining both insight into requirements, priorities and specific needs, but also to manage expectations and lead their thinking through end-to-end solutions (both process and technology) \nCollaborated with stakeholder groups across the organization to ensure business and technology alignment. Proposed solutions meeting defined specifications and needs.\nCreated Context diagrams, DFD’s, Process flow diagrams, ER diagrams using Class, Sequence, Component, Package diagrams.\nOrganized meetings and presented story boards to ensure accurate comprehension of the existing situation with regards to mismatched scenarios. \nProvided expertise on project templates and processes; reconciled project data and generated project reports. \nEfficiently and effectively managed the backlog of requirements for future releases and played a pivotal role in the timely release of the project. \nDeveloped a systematic plan for future release of the backlogged use cases after getting the priority of the features from the product managers. \nConducted integrated change control including project plan updates and performance reports. \nReviewed and provided input on test scripts to ensure thorough testing of new functionality and triaged defects and enhancement requests. \n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "confluence",
        "css",
        "data analysis",
        "git",
        "html",
        "java",
        "jira",
        "mysql",
        "oracle",
        "power bi",
        "project management",
        "scrum",
        "sql",
        "tableau"
    ]
}