{
    "id": "resume_236849db-9ca2-4912-bde2-7a5f3d8e3a27",
    "metadata": {
        "filename": "Naveen Arora.docx",
        "processed_date": "2025-09-24T08:45:44.975733+00:00"
    },
    "raw_text": "NAVEEN ARORA\n917 388 9436\naroranaveen40@gmail.com\nCurrent Location: Chicago, IL\nVisa – H1b\nOpen to relocate\n\n\nEDUCATION\nBE Computer Engineering (PCT ; University of Mumbai)- India  - 1999\nMS in Computer Science – (BITS, Pilani) India\t - 2001\n\nCERTIFICATIONS\nOracle Certified Java Programmer\nOracle Certified Business Component Developer\n\n\nPROFESSIONAL EXPERIENCE\n\nClient: BP - Chicago, IL\t\t\t\t\t June’ 16 – Till Date\nJava Solutions Architect / Java Developer\n\nBP is one of the world's leading integrated oil and gas companies.  Like all world class organization BP uses latest cutting technology to manage supply, customers, inventory, actuals and forecasting data. My job responsibilities in the organization is to help automate the existing manual operations and propose, design, develop software solutions.\n\nSenior Software Developer/Solution Architect\nProjects:\nFuel Equity Forecasting Tool\nRESTful web services for providing various views comparing datasets and display forecast and actual data for oil wells to aid in decision making for plan changes. The project uses Kerberos and LDAP authentication. \nDesign and Develop highly available Web Services using Spring RESTful technologies and Jersey implementation. The web services were reusable and versioned to provide for an upgrade path to existing API leveraging SOA software design, browser acting as service consumer and the Web Services were acting as service provider.\nDesign Regression and Performance automated test suite using SOAPUI and groovy.\nInteract with business to understand the requirements\nCoordinate with support team for software deployments and upgrade activities\nSecurity Design for web services using Spengo Kerberos and LDAP \nSpring Data and Hibernate ORM for persistence\nSpring Kerberos Rest Template for remote server REST calls.\nSpring for RESTful endpoints.\nDeveloped JUnit test cases for all the developed modules.\nAgile/SCRUM was used as the project management methodology \nJenkins for Self Service deployment portal and Continuous Integration (CI).\n\nFuel Supply Dashboard Mobile Application\nDesign and develop SOAP based web services for mobile application dashboard to display  fuel supply status and customer information.\n\nResponsibilities:\nDesign and Develop Web Services using SOAP technologies.\nDevelop Performance and Regression test suites using SOAP UI and groovy \nInteract with business to understand the requirements\nCoordinate with support team for software deployments and upgrade activities\nCoordinate with teams across the globe with interface development activities.\nJAX-WS Reference Implementation (RI) for code generation from WSDL\nHibernate ORM and reverse engineering tools for data base access and integration\nOrika Library for Mapping, filtering and modifying database parameters to SOAP web response.\nExposing Web Service Using Spring JAX–WS RI support developed as part of the JAX–WS Commons project.  \nBehaviour logging using Spring AOP and Log4j.\nDeveloped JUnit test cases for all the developed modules.\nAgile/SCRUM was used as the project management methodology \nJenkins DevOps toolkit for Self Service deployment portal.\n\nMaintenance Activities for Software Solutions\nProvide software support including fix issues and minor enhancements for Gasoline Blending Transaction Management system design in Spring/JPA running on Weblogic server.\nProvide software support for Trading News Portal designed in Spring MVC/Hibernate running on Tomcat server. Analysis of migration of application to Java 8 and Angular JS 2 based UI as Full Stack Java development. Worked integrating Rest Services with Angular JS 2 UI framework. Used decorator for log enhancement.\n\nEnvironment: Java 8, Spring 4.0.5, Hibernate 4.3.5, XML, HTML5, Maven, CSS, MySQL, Tomcat6.0/ 5.5, SOAP 1.0, JBOSS, SOAP-UI, Spengo Kerberos, Sprint Boot, groovy, JavaScript, JSP, Microsoft SQL Server, WebLogic, Jenkins, Angular JS 2, TFS, SOA\n\nClient: Access Health\t\t                                                                  Oct’ 15 – May 16\nLead Java Developer\nDevelopment of financial reporting for one of the largest hospitals, based on clinical variables with data from three initial sources, helps the CFO to make business decisions effectively. Involved in integration of client J2EE based web application system, software architecture, and service oriented architecture with BI reporting tool WebFOCUS reporting server web service framework. Work on development and customization of user interfaces (UI) using JavaScript, JQuery, JSP, HTML5 and CSS.  \n                                                                                        \nResponsibilities:\nAs a Solution Architect, involved in design and making choices for appropriate persistence, UI, middleware, webserver and integration frameworks along with reporting framework.\nCustomer interaction and analysis of customer environment for requirements specification and current operating environment.\nTechnical documentation and review for requirements specification, high level design and unit testing plan.\nDeveloped RESTful web services using Jersey 2.x as JAX-RS 2.0 implementation.\nResponsible for build (WAR) using maven and release the code from Perforce.\nWorked with UI designer for appropriate backend calls and handling expected output.\nUsed JAX-RS, JAXB, DOM/SAX Parsers, HTML, CSS, JSP, Servlet, JavaScript and JQuery to construct the reports leveraging WebFOCUS web services framework.\nDeveloped Servlets and JSP for web applications.\nDeveloped Spring 3 MVC restful web services using Jersey implementation for JAX-RS\nWorked with UI team in styling and integration of Web interface with server backend using JQuery,  JavaScript, HTML and CSS.\nInvolved in the development of SQL queries to get data from Oracle and MySQL. \nDeveloped JUnit test cases for all the developed modules.\nAgile/SCRUM was used as the project management methodology \nMonitoring Service Level Agreements (SLA) for all applications.\nProvided training to customer and post deployment support for any reported issues.\nMaintain code quality using build integrated code coverage and static analysis tools.\nInvolved in integration of reporting database, BI tool WebFOCUS to J2EE for generation of medical financial reports. \nEnvironment: Java, Spring 3,0, Spring 3 MVC, Spring OAuth 2.0, XML, HTML5, ant, CSS, JavaScript, JQuery, JSP, MySQL, Tomcat6.0/ 5.5, Oracle, WebFOCUS.\n\nObjective System Integrators\nClient: Verizon Wireless    \t\t      \t                                  Aug’ 14 - Sept’ 15\nJava Technical Lead /Solution Architect \n\nDesigned input probe for data processing using JMS 1.1 and the correlation engine for incoming fault alarm. The input probe was designed using JMS Protocol based data source that connects to Service Aware Manager element management system listening for notifications regarding the managed elements and forwards JMS messages to custom client for processing.  The incoming fault alarms were correlated using Core Java based correlation engine to correlate related alarms in attempt to reduce the total alarms raised. Remedy middleware used for Trouble Ticketing.\n\nResponsibilities:\nAs a Solution Architect, involved in design in analysis of requirements, the design, development, integration, deployment, unit testing and maintenance activities.\nResponsible for build and release the code from clearcase.\nDesigned synchronized multi-threaded Core Java processing engine for parallel processing of high rate of fault alarms. Template GoF object oriented design patterns was extensively leveraged to ease configuration of the engine so that same engine could be made to run by just changing the configuration in the template.\nSOA software design using CORBA as interoperable engine between applications running on distributed systems. The correlation plugins software used configuration, management services provided by broker application. Used XML technologies XSL, XSLT, JAXB, parsers SAX,DOM.\nJUnit and JMock used for writing unit test cases. JVM parameter tuning for system.\nAgile/SCRUM was used as the project management methodology \nTest Driven Development methodology used for development.\nUsed continuous integration framework to integrate unit tests with build.\nIntegrated third-party Remedy based trouble ticketing software.\nUsed findbugs, checkstyle integration with build environment to ensure software quality.\nSonar used to measure code coverage of unit test cases.\nGoF design patterns used for development as appropriate. Extensively used template and adapter pattern for reusable code.\nProfiling and tuning for optimization of code.\nWorked with QA in getting perl scripts running along with curl for black box testing.\nUsed curl, shell scripting, cron jobs for automatic deployment and testing of daily builds.\nPerforming sanity test before making the application live after deployment.\nMonitoring Service Level Agreements (SLA) for all applications\nProvided training to customer and post deployment support for any reported issues maintenance and further enhancement requests.\nInteracted with onshore customer, support teams and product development teams offshore in an onshore offshore module practice while providing 24*7 support to customer.\n\nEnvironment: JEE – [JDBC, Java, EJB 3.1, XML, JMS, JAXB, Oracle 12c, SQL, Solaris 10/11, RHEL 5.5/7.1, HTML, CSS, JUnit, JMock, Jenkins, findbugs, checkstyle, Sonar, Selenium, curl, perl\n\nClient: Surewest    \t\t                                     \t                                     Jul’ 12 - Jul’ 14\nLead Java Developer\n\nIP Device Management and Reporting solution is used to manage fault and performance for SNMP enabled devices along with discovery of devices. The faults were listened as notifications from devices and performance management was done using SNMP polling. Template Method Pattern used for defining templates for the custom action on faults. State machine engine was designed to manage the state of devices. The discovery engine was developed using Rocket Software middleware. \n\nResponsibilities:\nWorked as Team Lead and primary Architect for the project. \nActivities involved analysis of requirements, the design, development, integration, deployment and testing. Design UI, Middleware and reporting solution.\nDesigned and developed application using JEE design patterns.\nTechnical documentation and review for requirements specification, high level design and unit testing plan.\nDeveloped enterprise server side solution used JBOSS Wildfly as the application server and REST Web Services.\nDesigned message queue service provider using JBOSS MQ.\nDeveloped JMS client source and consumers using JMS specifications.\nAnalysed and compared Spring OAuth2 security and basic authentication and authorization of JBoss.\nDeveloped restful web services using Jersey 2.x as JAX-RS REST 2.0 implementation.\nDesigned synchronized multithreaded engine to process multiple polling requests and response at the same time from various devices. MVC and template design pattern was extensively used in the design for the correlation engine.\nUsed load balancing algorithms to spread out SNMP polling requests over time to ease out the load on the system.\nResponsible for build using maven and release the code from Perforce.\nDeveloped JUnit test cases for all the developed modules.\nDeveloped standalone UI using Java Swing for configuration and testing of IP Management Solution that could be used alternatively with web UI.\nDeveloped perl scripts for black box testing.\nDeveloped shell script and cron jobs for automated unit testing in a continuous integration environment.\nDeployed JSP and server side components to the JBOSS Wildfly server.\nCreated the domains, application servers and load balancers using JBOSS Wildfly.\nThe project is developed using TDD methodology in Agile/SCRUM used as the project management methodology.\nDesigned Persistence layer and integration using JDBC (DAO), Hibernate (Entity Beans).\nContinuous managed environment was managed using Jenkins DevOps with sonar for the code coverage.\nPerforming sanity test before making the application live after deployment.\nMonitoring Service Level Agreements (SLA) for all applications.\nProvided training to customer and post deployment support for any reported issues.\nEnvironment: JEE – [JDBC, JAX-RS (Jersey 2.x), Java, XML, JSON, CDI, JMS, JAXB, JSON], Oracle 11g/12c, SQL, Java Swing, JBOSS Wildfly Application Server, Solaris 10/11, RHEL 5.5/7.1, JavaScript, GWT, HTML, CSS, JUnit, Mockito, perl. NetBeans\n\nClient: AT&T Mobility, NTT (Japan)\t   \t\t\t                            Jul’ 11 - Jul’ 12\nSr. Java Developer\n\nPort legacy NetExpert C++ application to run on RHEL5.5 platform. Internationalization (i18n) support for legacy C++ NetExpert applications.\n\nResponsibilities:\nWorked as Senior developer in porting NeExpert C++ legacy applications to run on Linux platform and this activity also required migrating a lot of third party packages.  \ni18n support was added to support Unicode, multi-byte characters and globalization of user interfaces and logged messages.\nInvolved in troubleshooting, maintenance activity for the released product leveraging tools gdb, mdb, strace/truss. \nInvolved in localization of legacy Java Swing based UI.\nEnvironment: C++, Oracle 11g/12c, SQL, Solaris 10/11, RHEL 5.5/7.1, Java Swing\n\nClient: VFNL\t\t\t\t\t\t    \t\t           Jul’ 08- Jun’ 11\nSr. Java Developer\nService Assurance Solution – This is an enterprise server side solution which added service assurance over top of network assurance layer. The solutions was developed using JBOSS application server using Entity Java Beans 3.0 technology. Hibernate as the JPA implementation. JBOSS messaging was used as implementation of JMS 1.1 for inter process communication and as a data source.\n\nResponsibilities:\nWorked as a Sr. Java Developer and involved in analysis of requirements, the design, development, integration, deployment, unit testing and maintenance activities.\nResponsible for build and release the code from clearcase.\nDeveloped JUnit test cases for all the developed modules.\nAgile/SCRUM was used as the project management methodology \nJUnit and JMock used for writing unit test cases.\nEnvironment: JEE – [JDBC, EJB 3.0/3.1, Java, XML, JMS, JMX, JAXB], Oracle 11g, SQL, JBOSS Application Server, Solaris 10/11, RHEL 5.5/7.1, JUnit, JMock.\n\t\nSoftware Technology Park of India (STPI)\t\t\t\t\tAug’ 06 – Feb’ 08\nNetworking Consultant                                                                   \nResponsibilities:\nProvide software and network consultation providing networking consultancy and last mile connectivity to STPI. Management of network bandwidth using CISCO router and switches.\nEnvironment: CISCO 26xx and 36xx series routers, RADMAX Wireless Access Point.\n\nMicrosoft India                                                                                            Jun’ 05 – Jun’ 06 \nPrincipal consultant / Technical Architect\nVirtual DOS Machine in OS is used to support legacy 16 bit application. The project was to maintain Virtual DOS Machine and developing automated test harness solution and enhancing security.\n\nResponsibilities:\nResponsibility for ensuring forward compatibility for 16 bit DOS and Windows 3.1 applications running over Windows NT Virtual MS-DOS Machine (NTVDM).\nResponsible for enhancing security software for modules that provide support for the legacy 16 bit applications. \nWorked with hyperlink component of Windows© fixing defects.\nEnvironment: C++, Windows Internals\n\nCisco System India                                                                                        Jun’ 01 – May’ 05\nSoftware Engineer\n\nResponsibilities:\nDesign and develop and maintenance of Cisco IOS device driver software.\nDesign, development of network interface driver for Cisco Internet Operating System.\nEnvironment: C, Cisco Internet Operating System, Cisco routers 7xxx series.\n",
    "extracted_skills": [
        "agile",
        "angular",
        "communication",
        "css",
        "html",
        "java",
        "javascript",
        "jenkins",
        "microsoft sql server",
        "mysql",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}