{
    "id": "resume_a34eda04-17d2-42ce-a741-dba3c58ce3bc",
    "metadata": {
        "filename": "Navneeth Resume.docx",
        "processed_date": "2025-09-24T08:45:45.275858+00:00"
    },
    "raw_text": "Navneet Gupta\nproject/ program manager (PMP® (1851131)\n\nContact: 801-770-3133*202\nEmail: richard@sonussoftwareinc.com\n\n\nSummary:\n\nPMP certified with 17+ years of rich experience in areas of software development, Product Management, I.T. Infrastructure management, production support with over 10 years in of extensive experience in Project/Program Management in Telecommunication, IT, Services, Banking and Manufacturing Organizations.\nWith a development and Agile background, provided advanced project management and support for ongoing programs and for projects across numerous functional and technical units with the company. On each program/project, I had been responsible for ensuring that the program is delivered on time, within budget, at a high level of quality\nExtensive experience of successfully managing large scale and fairly complex projects performing management functions such as Project planning, Budget Confirmation, Project Estimation, scheduling, organizing, reporting, risk management and tracking processes, ensuring the feasibility of each project.\nProven skills in all phases of PMBOK managing all the phases, design, development, testing and implementation of projects.\nManaged medium to large sized project with team size up to forty members and a budget of five million dollars. A natural team player managed using Waterfall, Iterative and Agile project management methodologies. \nManaged projects from kick-off through closure including phases – requirements gathering & analysis, design, configure & build, test & deploy. Possess good knowledge of DevOps.\nProficient in Global Service Delivery and client services management with extensive experience on Remote Infrastructure Management \nManaged cloud based projects for SAAS, PAAS & IAAS on Private and Public Clouds, Virtualization of Servers and compute storage.\nPossess very strong analytical, troubleshooting, problem solving, critical and logical skills\nExcellent Co-ordination & Communication skills with ability to collaborate with all the stakeholders throughout the project life cycle.\nStrong professional with demonstrated ability to work effectively with individuals at all levels and in all functional areas.\nDetail oriented and analytical, experienced in requirements gathering\nHighly motivated and success driven on independent and team assignments\nExtensive experience of management/development of enterprise applications using Java/J2EE technologies. Also have OCP (Oracle Certified Professional) and SCJP (Sun Certified Java Programmer).\nExperience of Database Architect/DBA experience using Oracle, DB2, MySQL & MS SQL. Also experienced in Oracle E-Business and PeopleSoft with partnership projects\nExperience in ITIL Service Delivery Using HP Service Center, Data Center Migration Business Intelligence and Data warehouse.\nStrong analytical skills to derive business requirements.\nExcellent Co-ordination & Communication skills with ability to collaborate with all the stakeholders throughout the project life cycle.\nProven track record of scope, time, cost & risk and procurement management of medium to large sized projects/program. \nStrong professional with demonstrated ability to work effectively with individuals at all levels and in all functional areas.\nHave successfully used Waterfall, Iterative, and Agile methods for project deliverables.\n\n\n\nTechnical Experience\n\n   \nEducation:\n\nBachelors of Technology from IIT Delhi, India.\n\n\nCertifications:\n\nProject Management Institute www.pmi.org USA \nProject Management Professional (PMP®) (1851131)\nOCP (Oracle Certified Professional)\nSCJP (Sun Certified Java Programmer)\n\nProfessional EXPERIENCE:\n\nGE Health Care, Barrington, IL                                                \t                 Oct 15 – Till Date\nProject Manager\n\nGE Healthcare is building a hospital operations management solution referred to as a “Wall of Analytics” (WOA). WOA is a compilation of wall display hardware and software applications that digest data, creates analytics, and displays highly valued information coming from healthcare operations source systems. Akin to a “Command Center,” executive and non-executive personnel will be presented key operational information on displays.  The information will be in the form of an analytic (key metric / performance indicators) that will be monitored for decision making and taking action.\nWorking closely with the business, gathering the requirement and helping team to convert these requirements to specs.\nCollaborate with application support and IT team to provide technical expertise in various support issues and administer all contracts in assistance with production team and recommend improvements to all management processes.\nEnsuring timely execution of projects, maintaining the risk register and work with the team to minimizing the impact arising due to risks.\nCoordinating with teams to design/build the key infrastructure components, developing migration plan, infrastructure upgrade plan, vendor management, communication plan.\nParticipate in project steering committee and escalate all issues to management for resolutions and prepare reports for all projects and maintain and update all portfolios for clients.\nDrafting business case analyses, reports, whitepapers, and other complex documents, mapping complex business processes and communicating process solutions to the client\nImproved product experience by collaborating with engineering to develop fixes requested by customers in the most cost effective manner, got DevOps implemented to reduce the time to market\nManaged regular scrum planning, daily stand-ups with the team to track the tasks, sprint reviews, sprint retrospective\nEvaluate team strengths and weaknesses, and identify action plans for improvement to bring the best out of the team.\nAuthored Computer Validation Report, which involved extensive Research and interaction with SME’s and our clients.\n\n\nTools: Microsoft Project Server, Microsoft Office, Visio, SharePoint, Java/J2EE, Jira, Scrum/Agile\n\n\nRockwell Automation, Inc. Milwaukee, WI                                                       Apr 15 – Oct 15\nProject Manager\n\nImplementation of SDE (Secure Development Environment) to protect the IP of the organization at eight development centers globally, involves coordinating with various stakeholders to build the key infrastructure components, developing Migration plan,  infrastructure upgrade, Vendor management, Communication plan for offshore and onsite teams.\nResponsibility including Project Status reporting to client team on Project progress, risks, issues, project spend, Estimate to Complete, Cost and Schedule variances.\nIt is a multi-geography project - working with team in China, India, Europe and USA.\nMonitoring staff & team performances. Producing stage plans, highlight reports, risk logs, requests for change etc.\nResponsibility also includes working with Change Control board for Change Management activities.\nResponsibility also included tracking Project resource management, Cost management and reporting financial performance measures of the project.\nCreating Detail Project Plans for estimates above 500 hours of effort. Effort less than 500 hours was required to provide Milestone plans as per Contractual agreements. Project planning, tracking and reporting was performed using Microsoft Project\nSuccessfully transitioned the knowledge and development effort to outsourced partner.  Setup the expectations/processes with the partner on delivering/maintaining the Store Easy product line going forward.\nMonitoring, tracking projects with respect to day to day delivery, demand forecasts, time over-runs to ensure timely execution of projects.\nMaintaining the Risk registers and working with the team to minimizing the impact arising due to risks. \nManaged regular scrum planning, daily stand-ups with the team to track the tasks, sprint reviews, sprint retrospective\nEvaluate team strengths and weaknesses, and identify action plans for improvement to bring the best out of the team.\nAuthored Computer Validation Report, which involved extensive Research and interaction with SME’s and our clients.\nConducted individual and group (JAD) sessions with business and technical groups.\nGathered user/business requirements by meeting with business users.\nPrepared the Requirement Specification Document using Requisite Pro for the application based on business user information.\nPrepared functional documents based on the business requirements.\nDeveloped business use cases textually. Created and maintained project matrices like Traceability Matrices.\nUsed Agile Methodology and created User Stories to facilitate development of software functionalities, user interfaces, and system architecture. \nAuthored Business Requirements Document [BRD] with project teams. Extracted, discussed, and refined business requirements from business users and SME’s.\nManaged Projects and People effectively to meet organizational goals.\nManaged regular scrum planning (2 weeks sprints), daily stand-ups with the team to track the tasks, sprint reviews, sprint retrospective\nCommunicated and documented project status and strategic recommendations to product group, clients, team members and senior management on a regular basis; escalated issues accordingly via the appropriate channels. Managed Risks and planned for mitigation\nWorked closely with end-users to gather report requirements and ensured proper testing/validation.\nSupported user acceptance testing on production data loading and new features.\nCreated scheduled ad hoc reports, and developed various reports. \n\nTechnologies: Microsoft Project Server, Microsoft Office, Visio, SharePoint\n\n\nGEICO Inc., Chevy Chase, MD                                                                          Nov 14 – Apr 15\nProgram Manager\n\nManaged a project team for Office 365 Migration from Exchange 2010 using Hybrid. Produce appropriate documentation to facilitate deliverables, including plans, detailed reviews and presentations.  Review documentation produced by stakeholders in the process to ensure quality and comprehensiveness.\nMonitoring, tracking projects, demand forecasts, time over-runs to ensure timely execution of projects\nAdherence and implementation of Incident, Problem and Change Management\nMaintaining the risk registers and working with the team to minimizing the impact arising due to risks.\nDefined and implemented the quality audit, mentoring project members to enable them to perform their activities effectively and improve the quality\nKeeping track of changes through change control board meetings and looking at key performance areas\nWorked with the vendors to drive excellence and mitigate risks.\nHanded over to offshore team to complete the migration after successful pre-pilot and pilot phase\nSet and Implement the process for updating CMDB and later involved in planning to automate it\nAccount scorecard, weekly exceptions, Utilization report, Productivity report\nPublish account review deck with all metrics and exceptions reports.\nDeveloped business use cases textually. Created and maintained project matrices like Traceability Matrices.\nWorked at different stages of the Software Development Life Cycle (SDLC) with business users, developers, and stakeholders\nUsed Agile Methodology and created User Stories to facilitate development of software functionalities, user interfaces, and system architecture. \nAuthored Business Requirements Document [BRD] with project teams. Extracted, discussed, and refined business requirements from business users and SME’s.\nCommunicated and documented project status and strategic recommendations to product group, clients, team members and senior management on a regular basis; escalated issues accordingly via the appropriate channels. \n\nTechnologies: Microsoft Project, Microsoft Office, Visio, SharePoint\n\n\nHewlett Packard, India/California                 \t    \t           \t                    Oct 07 – Nov 14\nTechnical Program Manager\n\nResponsibilities:\nWorked on three products i.e. Supervisor, AIO and Instance Generator in Information Management portfolio of Hewlett Packard. These stacks were developed on J2EE/Oracle/Microsoft/Open Source technologies.\n\nResponsible to define/prioritize the program backlog and to develop the user acceptance criteria\nTransitioned the teams from waterfall to Agile/Scrum methodology. Creating the backlogs, prioritizing the tasks and participating in Sprints/Scrums.\nWorked with teams for requirements gathering/analysis/design for features development and defect fixing.\nMaintained the risk register and work with the team to mitigate the risks on ongoing basis. Kept track of budget, forecasting based on EVM/Variances.\nRegular Interactions with clients, sales and other stakeholders to ensure deliverables are properly defined and roadmap is created to meet project deadlines.\nDrafting business case analyses, reports, whitepapers, and other complex documents, mapping complex business processes and communicating process solutions to the client\nImproved product experience by collaborating with engineering to develop fixes requested by customers in the most cost effective manner, got DevOps implemented to reduce the time to market\nWorked with various Data warehouse tools i.e. Informatica to make AIO compatible with the tools and generate cartridges.\nManaged cloud based projects for SAAS and IAAS based cloud models on private and public Clouds, Virtualization of servers and compute storage as a part of transformation process, integration of products with Amazon AWS.\nWorked with information architects and creative groups in detailing the wireframes and depicting GUI design.\nAssisted the database development team in data modeling, data structure and data table layouts required for consolidation of incongruent databases.\nRecruit and mentor team members, developing teams and leaders to ensure that business value is maximized and IT goals are achieved.\nParticipated in program management working sessions and supporting program managers in executing day-to-day project management activities\nWorked with QA refining Regression testing. \nWorked closely with end-users to gather report requirements and ensured proper testing/validation.\nSupported user acceptance testing on production data loading and new features.\nPrepared functional documents based on the business requirements.\nWorked with the team for performance optimization, deployment, support and customization planning of the product.\nInvolved in deriving the functional requirements from the business requirements for cusomers using Business Intelligence using SSIS/SSAS/SSRS.\n\nTechnologies: Java/J2EE, Data Modeling, Agile, Scrum, Jira, Oracle, MySQL, Informatica, Teradata, DB2, Microsoft Project, SSIS, SSRS, SSAS, Hibernate, Spring, Hadoop, Linux, UNIX, Nagios, Git, Jenkins, puppet\n\n\nHCL (IT Project Manager) NJ, USA\t\t\t\t\t       June 06 – Oct 07\nDisaster Recovery/Data Centre Migration (Client - Autodesk Inc.)\n\nWorked on a five phase migration including more than 250 servers. Critical success factors required a seamless transition with minimum downtime to ensure records and tools were available most of the time.  Implemented a plan that included data replication, leased transition servers and stabilization support. It involved complete Helpdesk, Services Desk, Data Center and networking tracks plan and implementation of same with consultation of all team leads/managers and ensured completion of same with end to end ownership.\n\nResponsibilities:\nManaging project deliverables and attending Sr. Mgmt review calls.\nDefining KPIs, SLA Dashboards along with client stakeholders and creating framework to publish Dashboard results in weekly/monthly meetings.\nScheduling for  migration events\nActive involvement in shortlisting appropriate team members and work with hiring group to bring them on board with help of robust training plan.\nGuiding and mentoring team for technical work inputs and continuous innovations.\nMotivating team towards value centricity model \nAchieved high scalability and fault-tolerance using prototyping\n\n\nHCL (Sr. Consultant /Database Administrator)\t\t\t                  June 04 –June 06\n(Clients - Renesas Technology America, Armstrong Inc., Deutsche Bank, Mindspeed Inc.)\n\nManaged team involved in transitioning the project from onsite to offshore.\n\nResponsibilities:\nWorked with the teams onsite as well as offshore involved in transitioning\nInvolved in the setting up the delivery centers in India.\nDeveloped and tested storage strategies and disaster-recovery plan for large manufacturing company's operational database, delivering solution that guaranteed recovery performance and high availability.\nManaged a data-integration project for financial services firm that consolidated information from accounting applications, third-party market data and internal equities/fixed income applications.\nRegular Interaction with business requirement/sales team for continuous evaluation of milestones achieved.\nDeveloped features for enhancement and change request.\nEnhanced end users' understanding of database systems by conducting pre-implementation workshops, delivering group and individual training sessions and creating user-friendly training materials.\nMaintained project schedule, minutes and progress reports.\nIdentified and managed conflict resolution between stakeholders. \n\nTechnologies: Oracle, AIX, HP-UX, Linux, SQL Server, Microsoft Exchange\n\n\nSystems America (Consultant/DBA)\t\t\t\t\t    Dec2000 – May 04\nProject: Mokume (eOperations)\n\nThe system consists of distinct and modular products, which work together in tandem to allow a global business to achieve operational efficiencies throughout the enterprise. The system automates the entire business and improves operational efficiency throughout the enterprise. System provides Modeling, Scheduling, Tracking, On-time order delivery & management, Enhanced inventory management, Performance analysis and forecasting.\n\nProject- Virtual University (VU 1.0): \n\nVU is a web based Knowledge Management Solution that can be used to create a comprehensive online learning environment. \n\nProject: AcAdmin\nA critical application intended to be used to manage various application interfaces.  \n\nResponsibilities:\nPart of team involved in requirement analysis, coding, testing.\nInteracted with business requirement team.\nCreated technical documents.\nFixed issues, performance of the application.\n\nEnvironment: Java, J2EE, Oracle 8.x/8i/9i, Windows NT/2000, SOLARIS 2.6\n\n\n\n\nPurlSoft Solutions (Analyst/Developer)\t      \t\t\t\t    Jan 98 – Nov 2000\n\nWorked on development of products for Time Report and Scheduler. The products framework focuses on e-transforming time reporting and scheduling and integrating them to an e-business organization to improve the efficiency.\n \nResponsibilities: \n\nDesign and development of Time Report and Scheduler. \nCreated the work flow framework.\nDeveloped Reference UI screens\n\nEnvironment: Java, VB, Oracle 8i, Solaris, Windows NT\n\n\n",
    "extracted_skills": [
        "agile",
        "aws",
        "communication",
        "git",
        "hadoop",
        "java",
        "jenkins",
        "jira",
        "mentoring",
        "mysql",
        "oracle",
        "problem solving",
        "project management",
        "scrum",
        "sql"
    ]
}