{
    "id": "resume_31bc71e5-946c-46d2-b958-dabfc8931984",
    "metadata": {
        "filename": "Neha Mugghala.docx",
        "processed_date": "2025-09-24T08:45:45.440605+00:00"
    },
    "raw_text": "Sourya\nSenior Java/J2EE Developer\nsny.java@gmail.com\n302.401.6767\t              \t\t\t\t\n\nProfessional Summary:\n\nHaving 8+ years of experience in working on the various phases of Software Development Life Cycle like requirements analysis, design, coding, testing, debugging and maintaining the websites.\nAnalysis, Development, Testing, Documentation, Deployment, Integration, and Maintenance of web based and Client/Server applications utilizing Java, J2EE, Spring, Hibernate, JSF, JMS, XML, EJB, JSP, Servlets, JDBC, JNDI, HTML, DHTML and JavaScript, SQL, PL/SQL, Cassandra.\nWorked with servers Jetty, web logic, JBoss and Apache's Tomcat.\nKnowledge on C and C++ with Object Oriented Concepts.\nExperience in using WebStorm, Net Beans, Atom, Eclipse IDE for Application development.\nThorough understanding and experience in stored procedures, in Oracle, SQL.\nExposure to Oracle SOA Suite, UML Rational Rose, Hibernate, and Spring Framework.\nExtensive hands-on experience in object-oriented analysis, design, modelling and programming tools in conjunction with Business Process Modelling tools such as IBM BPM, and Camunda BPM.\nWorked on MVC Architecture like AngularJS, NodeJS, and Spring.\nWorked on Log4j configuration and setup and Implementation part. High level knowledge on ELK(ElasticSearch, LogStash, Kibana) stack.\nGood experience on JBoss Drools Rules Engine.\nExperience with Testing tools JUnit, Mocha, Gulp, and Chai for enterprise Web Applications.\nExpertise in setting up Kafka cluster configuration handle large data queues.\nExpertise in design and development in micro-service architecture with Web Services which includes implementing and handling of RESTful services and authentications using RESTful Web Services.\nThorough knowledge with J2EE application platform configuration and performance optimization\nDeveloping websites using HTML, XHTML, CSS, CSS3, PugJS, VueJS, NodeJS, JavaScript, JQuery, Ajax and JSON.\nWorked on web applications that required cross browser compatibilities like Chrome, Safari, Firefox, Internet Explorer and Opera.\nInvolved in several web application development projects that required Responsive Web Design.\nExpertise in design and development in SOA architecture with WebServices which includes implementing and handling of XSDs, SOAP, WSDL files, JAX-B, JAX-WS, authentications using RESTful WebServices.\nGood Web Application debugging skills using Chrome Developers Tool and Firebug.\nGood understanding or network protocols such as TCP/IP, HTTP etc.\nKnowledge in developing applications using Agile and SCRUM methodologies.\nHave good communication skills to discuss the projects with technical and non-technical SME’s.\nSome of the attributes that would describe me would be Team player, Proactive, Quick learner, Self-Motivated and Strong interest in Front End Development.\nHave excellent analytical, problem solving, communication and interpersonal skills with ability to interact with individuals at all levels and ability to work independently and prioritize the work.\nEnthusiastic to learn new technologies and concepts, and apply them when needed.\n\n\n\nEducation:\n\nBachelors in Computer Science and Information Technology (B. Tech) from Jawaharlal Nehru Technological University, Hyderabad, India.\nSun Certified Java Programmer.\n\nTechnical Skills:\n\n   Programming Languages: Java J2SE 1.6/1.7, J2EE, JSP, SQL Server 2005, Python, MySQL, Oracle, PERL scripting language, Groovy\n   Operating Systems: UNIX, Linux, Solaris, Windows 98/95/2000/XP, Mac OS X\n   Testing Tools: Load Runner, Win Runner, Hammer, Quality Center, Quick Test Pro, Cyara\n   Modeling Tools: Rational 2000, MS Visio, IBM BPM, Camunda BPM\n   Versioning Tools: CVS, VSS, Subversion, Git (EGIT, TortoiseGIT, SourceTree), PVCS, Clear case   Frameworks: Spring 2.x, 3.x, Hibernate 3.x, Grails\n   Build Automation Tools: Ant, Maven, Jenkins, CruiseControl.NET, TFS Team Build/MS Build\n   Networking Protocols: SMTP, POP3, IMAP, HTTP, NNTP, and FTP\n   Web Technologies: HTML5, XSLT, CSS3, JavaScript, JQuery, AJAX, XHTML, XML, JSON, NodeJS, VueJS, PugJS, Bootstrap, Web Services\n   Database/RDBMS: SQL Server 2008, T-SQL, Triggers, Cassandra, DML, DDL, Oracle 9i/10g/11i, MS Access, TOAD, PL/SQL\n   Application Servers: JBoss 5.x, BEA Web Logic 10.3, IBM Web Sphere, Tomcat, IIS 6.0\n   J2EE: Servlets, JSP, JDBC, OOAD, Java Mail, JMS, JNDI, RMI, Web services, SOAP, RestFul\n  Other Tools: Jenkins, Adobe Photoshop, PuTTY, Gimp, MS Office, Firebug, Chrome Developers Tool, Packet Tracer, MATLAB\n\nProfessional Experience:\n\nAT&T, Alpharetta, GA   \t\t\t\t\t\t                         \t Aug16 – Till Date\nSr. Java Developer\nProject: IVR Application and Tools\nResponsibilities:\nInvolved in all the phases of Software Development Lifecycle including the gathering the requirements, design, development and testing the application.\nCo-ordinated and Lead the offshore team by tracking everyday status of the work assigned.\nWorked closely with other developers to help plan and implement unit and integration tests and participated in improving the existing codebase.\nLead the development of an end-to-end application for testers in the project for performing automated regression testing using a nice front-end providing the testers to view/execute/display test cases.\nServed as the focal point of contact to communicate with client and offshore resources.\nDeveloped the enterprise application using Java, Spring, Maven for major back-end functionality.\nCreated front-end application using PugJS, HTML, and VueJS. Used jQuery for creating behavioural aspects of the web page.\nDeveloped UI application using NodeJS for creating and executing test cases by consuming various RESTFul URIs to call the back-end stubs for various services.\nImplemented NodeJS Services to bind the data and provide access to the data on the server.\nDeveloped micro-service architecture based web services to facilitate communication between client and servers.\nWorked on designing and creating rules in the Drools Rule Language (DRL), and decision table.\nDeveloped workflows which can handle complex business scenarios using Camunda BPM and integrated them with Java classes.\nImplemented various cache libraries in some modules for retrieving and storing data.\nInvolved in setting up Kafka configuration by creating consumers, producers and setting up clusters to handle large data queues.\nImplemented functionalities in back-end and front-end to manipulate/package/store the data from Kafka streams into Cassandra database.\nImplementation of OAuth Framework Authorization for Web Application.\nCreated various data models for Cassandra to which handle complex JSON objects.\nInvolved in developing logging mechanism for all the existing modules.\nEnhanced the existing services in the application to micro-service architecture.\nUsed Mocha, Gulp and Chai for testing the UI application.\nWorked extensively on Collection Framework features like Map, Object, List to retrieve the data from Web Service, manipulate the data to incorporate Business Logic and save the data to database.\nInstalled and configured JBoss EAP 6.4 and Apache HTTP Server in the local environment to perform end-to-end testing of the application.\nInvolved in preparing design TSD document with Sequence Diagrams, Class Diagrams using Microsoft VISIO.\nConfigured and deployed the application onto JBoss application server using Maven build scripts to automate the build and deployment process.\nWrote JUnit, Chai, Mocha and Gulp test cases for unit, integration, and functional tests.\nImplemented Agile-Scrum methodologies for Software Development Life Cycle.\nUsed Rally (CA Agile Central), JIRA, SDP to create/update stories and tasks and to keep track of the iteration.\nPrepared project documentations and delivery artifacts for future reviews and reference.\n\nEnvironment:  Java, Spring, Drools, Oracle, REST, XML, VXML, Eclipse, Atom, WebStorm, Maven, MS Visio, Rally, Jazz, Git (EGIT, SourceTree and TortoiseGIT), Agile, Scrum, Camunda BPM, jQuery, log4j, HTML, NodeJS, JSON, Cassandra, Kafka, VueJS, PugJS,  JUnit, Mocha, Gulp, Chai, Apache HTTP Server, JBoss Server.\n\n\n  J. P. Morgan Chase, Dallas, TX\t\t                                                                         Nov 14 – Aug 16    \nSr. Java Developer\nProject: Credit Application Module\nResponsibilities:\nInvolved in Requirements gathering, analysis, design, development, Testing and Maintenance phases of the application. \nInvolved in gathering existing functionality of different products from BRD, HLAD and FDN. \nImplemented Agile development process on Software Development Life Cycle. \nInvolved in effort estimations using Fibonacci approach. \nInvolved in using HTML, DHTML, Java Script, AJAX, ExtJs, JQUERY, JSP and Tag Libraries to develop view pages. \nInvolved in preparing design TSD document with Sequence Diagrams, Class Diagrams using Microsoft VISIO. \nInvolved in doing analysis on DB Schema as per new design in DB2 from Oracle. \nInvolved in using REST API while integrating with servers. \nImplemented Java code and design as per the Arch and coding guidelines. \nInvolved in using Core Java concepts - Collections, Exception Handling, Multi-Threading and Serialization. \nStudied the existing python modules and wrote functional specification for migration team.\nUsed Spring framework to inject services, entity services, transaction management, and concerns by factory class corresponding to the use case operation executing. \nInvolved in using spring concepts - DI/IOC, AOP, Batch implementation and Spring MVC. \nInvolved in Declarative transaction management using spring AOP. \nCreated WSDLs as per wire frames, UI pages & generated client jars using JAX-WS. \nUsed Apache CXF to create SOAP based & Restful web services. \nInvolved in creating internal & external services, Entity services and handlers. \nInvolved in defining JRules that are defined for resources to show details on UI pages. \nInvolved in writing SQL queries & PL/SQL - Stored procedures, function, triggers, cursors, object types, Cursors, sequences, indexes etc.\nWorked on Single node/Multicluster setup using technology i.e. Oracle, and Cassandra.\nAssisted in migrating the exiting data center into the AWS instances. \nUsed Grails command objects for validating non persistent objects.\nImplemented AngularJS Services to bind the data and provide access to the data on the server. \nInvolved in Web sphere server configurations, Data Sources, Connection Pooling, MQ Series Queues setup for messaging and deploying the apps on different servers in different env.s like QA/IST/Production. \nImplementation of OAuth Framework Authorization for Web Application.\nInvolved in creating JUNIT test cases and ran the TEST SUITE using EMMA tool. \nRan check style, PMD defects & Find bugs and fixed them. \nUsing Jenkins AWS CodeDeploy plugin to deploy to AWS.\nInvolved in fixing defects identified in QA and IST phases. And tracked QC status as per the guild lines. \nDeveloped Authorization for rest services using OAuth 2 layer/3 layer concepts.\nSpring based application to cloud based Microservices. \nUsed Microservice architecture with Spring Boot based service through REST.\nInvolved in creating http inbound & outbound flows and orchestration using XPath using MULE ESB.\nDone with transformers, exception handling, testing & Security of mule ESB endpoint through WSSR. \nInvolved in doing Unit testing using MOKITO and also Integration testing \nInvolved in peer level design & code reviews. \nUsed SVN for version and source control. \nInvolved in capacity planning, performance tuning and monitoring of JVM. \nSupported IST, QA and UAT builds and identified issues in Smoke testing and tracked them efficiently. \nInvolved in deploying the application in Unix and to connect to see logs for fixing UAT/Production defects. \nInvolved in building the code using Maven & deployed on server.\n\n\nEnvironment: Java1.6, J2EE, Servlets 2.4, EJB 2.0, JDBC 2.0, JAXB, Spring-IOC/DI, AOP, MVC, BOOT, JSF, Python, REST API, DAO, HTML, Java Script, XML, CSS, Ajax, AngularJS, Web Sphere Application server8.0, LDAP, Oracle 10g, Log4J, Eclipse 3.1, CVS, DOJO, Ant 1.5, SOA, Mule ESB, SOAP, DB2, PL/SQL, SQL, Web Services-WSDL, OAUTH, Microservices, MongoDB, Jenkins, SOAP UDDI, SOAP UI, Axis2, AWS, REST API, JAX-RS, JERSEY, Windows XP.\n\n\n\n\n\n\n\nHealth Partners, Minneapolis, MN\t\t\t\t\t\t\t               Nov 12 – Oct 14\n\nSr. Java Developer\nProject: Health Insurance System\nResponsibilities:\nDeveloped and Implemented Web Services and used Spring Framework.\nUsed the light weight container of the Spring Frame work to provide architectural flexibility for inversion of controller (IOC).\nImplemented the caching mechanism in Hibernate to load data from Oracle database.\nImplemented application level persistence using Hibernate and Spring.\nImplemented Persistence layer using Hibernate to interact with the Oracle database, Used Hibernate Framework for object relational mapping and persistence.\nDeveloped Servlets and JSPs based on MVC pattern using Struts framework and Spring Framework.\nExpertise in developing enterprise applications using Struts Frameworks.\nResponsible for analyzing various cross-functional, multi-platform applications systems enforcing, best practices and provide guidance in making long term architectural design decisions. \nDesigned and developed Using Performance Engineering\nInvolved in the deployment of SOAP based Web-Service End-Points using Apache CXF.\nDeveloped REST architecture based webservices to facilitate communication between client and servers.\nCreated all the services to work with the various entities provided and restified the services using REST APIs.\nResponsible for build and release the code from Clearcase, Subversion and Perforce.\nGood Working experience with web/applications servers IBM Web sphere, Oracle Web logic, JBOSS, Apache Tomcat and Jetty. \nUsed Multithreading to do the application development and for running the different tasks at the same time.\nResponsible for build and release the code from Clearcase, Subversion and Perforce.\nDesigned and modified User Interfaces using JSP, JavaScript, CSS 3, HTML 5, JSON, Performance Engineering and JQuery.\nDeveloped UI screens using YUI, CSS and JQuery.\nWritten Stored Procedures and functions for common utilities using PL/SQL.\nProvided leadership for service-oriented architecture (SOA) initiative by designing and developing web service interfaces to outside vendors and to internal systems.\nWrote validation packages using PL/SQL package.\nDeveloped user interfaces using JSP, JSF frame work with AJAX, JavaScript, HTML, DHTML, and CSS.\nDeveloped AJAX scripting to process server side JSP scripting.\nDesigned and developed the UI mostly using YUI.\nInvolved in the creation of interface to manage user menu and Bulk update of Attributes using JS, EXTJS and JQuery.\nDeveloped Web based Dynamic Form Builder using DHTML, JavaScript Object-to-XML.\nDesigned and developed the UI using Struts view component, JSP, HTML, CSS and JavaScript.\nDesign, develop and test of SOA services using SOA / SOAP Web Service / Oracle Fusion Middleware.\nImplemented OAUTH 1.0 for authenticating the API clients\nWorked in Agile environment with active scrum participation.\nAgile and scrum process is used for tracking and developing the application.\nWorked on designing and creating business rules using IBM ILOG Rules Engine.\n\nEnvironment: Core Java, J2SE, Servlets, JSP, YUI, Hibernate, Spring Framework, XML, MySQL, Eclipse, REST Web Services, OAUTH, Firebird tool, Cassandra, Postgres DB, SOAP, SOAP UI, Jboss, Spring web flow, PL/SQL, Dozer frame work, DB2, JQuery, AJAX\n\nComcast, Denver, CO\t\t                                                                   \t                  Oct 11 – Sep 12\nJava/J2EE Developer\nProject: Insurance Application\nResponsibilities:\nWeb enabled the application using Servlets, JDBC, Session Beans, JMS, JSP, and EJB.\nPrepare Java/J2EE development structure for Eclipse, maven, Jetty.\nDeveloped and customized n-tier J2EE application framework using RMI.\nUsed the Eclipse as IDE, configured and deployed the application onto WebLogic application server using Maven build scripts to automate the build and deployment process.\nDeveloped and designed interfaces using HTML, JSP, Server Side components using Servlets on\nEclipse and used JPA annotations.\nMentored/trained a team of 5 juniors to mid-level developers in Java/J2EE Development using UML\nDesign documents.\nExperience on Core Java technology which includes Multi-Threading, JDBC, RMI, network programming.\nImplemented Persistence layer using Hibernate to interact with the Oracle.\nExperience in Hibernate 3.0 which includes integrating legacy databases, writing custom CRUD statements, integrating stored procedures and functions and also performed polymorphic associations.\nCreated SQL queries, PL/SQL Stored Procedures, Functions for the Database layer by studying the required business objects and validating them with Stored Procedures using DB2. Also used JPA with Hibernate provider.\nDeveloped stored procedures, Triggers and functions in Oracle 10g to process the trades using PL/SQL and mapped it to Hibernate Configuration File and also established data integrity among all tables.\nDeveloped hibernate DAO Accessor Classes using Spring JDBC Template, worked with Hibernate for object relational mapping and connection management.\nDeveloped the Presentation and Controller layers using JSP, HTML, Java Script, Business layer using Spring (IOC, AOP), DTO, JTA, and Persistent layer DAO, Hibernate for all modules.\nImplemented User interface (UI) entire application using JSP, JSTL, Custom Tag Libraries, JavaScript, XML/ XSLT, HTML, CSS and Especially YUI.\nCreated applications, connection pools, deployment of JSPs, Servlets, and EJBs in WebSphere also Soap web srvice.\n\nEnvironment: Java 1.5, J2EE, RMI, Spring Frame work, Soap, Hibernate, HTML 4.x, CSS2.x, JavaScript, JQUERY, AJAX, JSON, XML, YUI, Multi-Threading, APACHE TOMCAT server, JPA, SOAP UI, REST web services, spring web flow, Boot strap.\n\nModel Governance Systems, India\t\t\t                                                                           Feb 09- Feb 11\nJava Developer\nProject: Sales Record Application\nDescription: The project was designed to retrieve the customer and their vehicle’s information easily and effectively using Search module, the information then can be utilized for service records. The project had also a provision to allow adding the records of the new vehicle that was sold by the company to a new customer. It was developed in Java with database connectivity and used Oracle as database. It serves as good user interface where user can enter the name and details in textbox designed in swing and that information then stored in database. \n\n\nResponsibilities:  \nDesigned the application based on the architecture of the MVC design pattern.\nProject was developed following Agile and Scrum methodologies.\nRequirement Analysis and Documentation as per SDLC methodologies.\nConverted requirement into flow design diagram using MS Visio.\nPerformed data loading using spring - Hibernate.\nUsed WSDL to post the services in the UDDI.\nConfigured Hibernate's second level cache using EHCache to reduce the number of hits to the configuration table data.\nDeveloped views for JSP pages using AJAX\nExtensively used Hibernate in data access layer to access and update information in the database.\nCode development using Eclipse, HTML, JAVA, JSP, SWING, Servlet and SQL \nCreated Functional Test cases and achieved bug fixes.\nWrote SQL, PL/SQL (Procedures/Functions/Packages/Triggers) to handle business functionality.\nUsed XML SAX parser to simulate xml file which has simulated test data.\nCode review and function testing for better client interface and usability. \nParticipation in meeting with team, senior management and client stakeholders\n\nEnvironment: Java, J2SE, JSP, Servlet, SQL, Oracle9i, JDBC, Swing, Eclipse, HTML, SDLC, MS Office, Windows, AJAX, JPA annotations, SOAP web services, WSDL, UDDI, SAX, DOM\n",
    "extracted_skills": [
        "agile",
        "aws",
        "cassandra",
        "communication",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "leadership",
        "matlab",
        "mongodb",
        "mysql",
        "oracle",
        "problem solving",
        "python",
        "rest api",
        "scrum",
        "sql"
    ]
}