{
    "id": "resume_0a77feb5-6e67-4503-a799-41dec87fd702",
    "metadata": {
        "filename": "Nikhil.docx",
        "processed_date": "2025-09-24T08:45:45.568275+00:00"
    },
    "raw_text": "Nikhil \nSr. J2EE/AWS Developer\n\nE-Mail:nikhil.akula06@gmail.com\nPh: 713 931 9034\n\nSUMMARY\n\nOver 8 years of experience in the IT industry with a good command on design, development and test of client server, web based and distributed software applications by using J2SE and J2EE technologies.\nExperience in software engineering, planning, designing, implementation of cloud infrastructure utilizing Amazon Web Services and Build Release Management.\nStrong development skills in Java, J2EE, JDBC, JSP, Servlets, EJB J2EE, JMS MQ-series, JNDI, RMI, C, HTML5, XML, XSL, Java Script, DB2, Oracle, SQServer and Macromedia tools\nExperience in deploying applications using Application Servers like WebLogic, JBoss, Oracle App Server, websphere, Web Server Apache Tomcat 7 and IIS server.\nExposed to all aspects of Software Development Life Cycle (SDLC) such as Analysis, Planning, Developing, Testing and implementing and Post-production analysis of the projects.\nExperience in implementing RESTful web services and SOAP based web services Frameworks and SOA.\nExperience in MS SQL Server 2012/2008R2with Business Intelligence in SQL Server Reporting Service and SQL Server Integration Service.\n Extensive experience in design, installation and administration of Microsoft System Configuration Manager 2007-2012.\nInvolved in developing Java web based interfaces using HTML5, CSS3, JQuery, XML and JSON.\nGood understanding of Java/J2EE Design Patterns and n-tier architecture.\nHaving good understanding in XML schemas, XPATH, XSLT and XML parsing using SAX/DOM, JAXB.\nHave expertise with an in depth understanding of the wide range of AWS services like EC2, Auto-Scaling in launching EC2 instances, Elastic Load Balancer, Elastic Beanstalk, S3, Glacier, Cloud Front, RDS, VPC, Direct Connect, Route53, CloudWatch, CloudFormation, IAM, SNS.\nExperience in creating, designing, configuring and managing EC2 instance in VPCs by setting up all the resources like NAT gateway and Internet gateway depending on the requirement using AWS console, CFT and AWS CLI.\nCreated and managed security groups for Amazon EC2 instances and Network ACLs for VPC subnets.\nStrong hands-on experience with Spring IO, Spring Boot with Thymeleaf.\nExpertise in debugging with the IDEs like Eclipse, WebStrom, NetBeans.\nHave created and configured elastic load balancers with EC2 auto scaling groups.\nOptimized volumes and EC2 instances & Created multi Availability Zone VPC instances.\nCreated AMI images and shared the image with other accounts .\nPerformed configuration, deployment and support of cloud services including Amazon Web Services (AWS). \nExperience in creating JSON scrips for Cloud Formation Template based on requirements and launch stacks.\nHave a detail understanding of Cloudwatch and can monitor resources of AWS through it.\nExperience in storing sever data into S3 and have in-depth knowledge on various S3 features like versioning, lifecycle management, logging, events etc.\nDeployed and supported Memcache-AWS ElastiCache.\nExperience in Installing and configuring Continuous Integration and Continuous Deployment Tools like Jenkins\nCan configure Jenkins on EC2 servers and integrated it with AWS CodeCommit.\nExpertise in implementing the configuration management tools like Chef, Puppet and Ansible.\nGood knowledge in using REST-ful and XML based web services.\nUsed AquaStudio GUI to the Oracle 11g database for performing the database operations.\nWritten SQL queries using TOAD to unit test and developed code base.\nExpertise in source code management tools like Git, SVN.\nGood knowledge in writing complex SQL commands.\nGood knowledge on AWS databases like RDS, DynamoDB, Redshift, ElastiCache.\nExpertise in bug tracking tools like JIRA and build tools like Bitbucket.\nExperience with UI testing, Acceptance testing, Unit testing, Test Driven Development(TDD)\nExtensive experience in developing test cases using Junit/JMeter/Mockito.\nExperience in facilitating scrum ceremonies.\nA good team player with excellent communication, management, and interpersonal skills.\nExcellent logical, analytical and debugging skills.\n\nEDUCATION\nBachelor of Technology in Information Technology from Jawaharlal Nehru Technological University, India.(2010)\n\nTECHNICAL EXPERTISE:\n\nEXPERIENCE\nClient: CDK Global, Hoffman estates-IL\t                                                   May’17 – Present\nRole: Full Stack Developer\n\tCDK provide integrated technology solutions to over Auto, Truck, Motorcycle, Marine,\nRecreational Vehicle and Heavy Equipment dealers throughout the world.\nResponsibilities: \nActively involved in analysis, detail design, development, bug fixing and enhancement in Agile methodology. Involved in daily scrum and sprint planning meetings. \nAssist with creating cloud migration strategies; defining delivery architecture, creating the migration plans, designing the orchestration plans, and more. Assist in creating and executing of migration run books. \nMigration from legacy CRM to a new CRM platform.\nWorked on responsiveness of the application and explored the fixed width and fluid layouts\nusing the Twitter Bootstrap.\nUsing AngularJS created custom directives for data manipulations and to display data in\ncompany standard format in UI.\n Designed dynamic client-side JavaScript code to build web forms and simulate process for\nweb application, page navigation and form validation.\n Implemented Restful web services to perform some business activities.\nExpertly used Angular 2 Directives, Pipes, Event Binding, Data Binding, Interpolation,\nInjection etc., for building the GUI.\nDesigned and developed a web-based client using Servlets, JSP, JMS, AngularJS, JavaScript, TypeScript, HTML 5 and XML using Spring MVC Framework. \nInvolved in developing Java web based interfaces using HTML5, CSS3, JQuery, XML, VXML and JSON\nDeveloped Soap and Rest web service clients to communicate with third party vendors.\n Implemented Java and J2EE Design Patterns like MVC, Singleton, Factory, Data Access Object (DAO), and Service Locator. \nDeveloped server-side services using Java multithreading, Java, Springs, Web Services (SOAP, AXIS).\nUsed Spring framework including Spring core/IoC, Spring Web, Spring Security. \nImplement OAuth 2, SAML 2 for AAA & Single Sign On (SSO) using Spring Security\nResponsible for coding SQL Statements and Stored procedures for back end communication using JDBC.\nAll the functionality is implemented using Spring Boot, Thymeleaf and Hibernate ORM.\nUsed Spring Core Annotations for Dependency Injection Spring DI and Spring MVC for REST API s and Spring Boot for micro-services.\nExperience on AWS mobile hub\nCreated TypeScript reusable components and services to consume REST APIs using\nComponent based architecture provided by Angular 2.\nCreated Amazon ElastiCache nodes, shards and clusters in amazon ElastiCache deployment.\nExperience in Installing and configuring Continuous Integration and Continuous Deployment Tools like Jenkins\nCreated load balancers (ELB) and used Route53 with failover and latency options for high availability and fault tolerance.\nUsed Log4j for logging errors, messages and performance logs.\n Elasticsearch’s easy-to-use APIs and real-time capabilities along with the availability, scalability, and security required by production workloads\n Used Node JS for server side rendering. Implemented modules into Node JS to integrate with designs and requirements. \nExperience in using Plain Vanilla java bean.\nUsed Spring Core Annotations for Dependency Injection Spring DI and Spring MVC for RESTAPI s and Spring Boot for micro-services.\nUsing Docker, Jenkins, VMWare, RHEL, Satellite, Open Shift, Kubernetes, Artifactory, Ansible & GitLab\nImplemented MicroServices SOA and OAuth Auth Server with SAML IdP Authentication\nDeveloping Docker images to support Development and Testing Teams and their pipelines; distributed Jenkins, Selenium and JMeter images, and ElasticSearch, Kibana and Logstash (ELK & EFK) etc\nDeveloping scripts for build, deployment, maintenance and related tasks using Jenkins, Docker, Maven, Python and Bash.\nDeveloped for full text search platform using NoSQL Elasticsearch engine, allowing for much faster, more scalable and more intuitive user searches for our database of spas worldwide.\n Installed application on AWS EC2 instances and configured the storage on S3 buckets.\nDeveloped API for using AWS Lambda to manage the servers and run the code in the AWS. \n Created cloudFormation templates to automate the EC2 instance engenderment. \nUsed Amazon CloudWatch to monitor the application performance and used the logs to identify any threshold limits. \nExperience in RoboMQ integrates SaaS, Enterprise Applications &   using Microservices across networks and clouds\nImplemented an iPaaS that pursues the same API-first approach to integration platform management.\nExperience in creating SQL Server Reports, handling sub-reports and writing queries to perform roll-up and drill down operations in SSRS 2012/2008\nInvolved in migration of SSRS reports from SQL 2005 to SQL 2012/2008 and migration with DTS to SSIS 2012/2008\nAmazon IAM was used to maintain the user credentials and also involved in creating custom IAM policies to various groups defined within the organization. \nWorked with NoSQL database MongoDB and developed custom MongoDB applications specific to clients' needs. \nGitHub has been used as a Version Controlling System. \nWorked with CVS repository, for migrating the code base from CVS to SVN.\nDeveloped JUnit test cases for Persistence layer and Business layer to perform the unit level testing. \nUsed Maven and ANT for building entire application and deploy them on Oracle WebLogic server. \nExperience with messaging frameworks (ActiveMQ, RabbitMQ, Kafka)\nUsed Gradle for build framework and Jenkins for continuous build system \n\nEnvironment: Core Java, J2EE, JSP, NodeJS, Servlets, Hibernate, Agile, Scrum, JavaScript, Spring, Eclipse, Rational Application Developer, AngularJS, Spring, IBM BPM, DB2, Oracle WebSphere 8.x, Putty, Web services, XML, GitHub, Mongo DB, Maven, Jenkins, Visio, Log4j, Junit, Drools, Amazon EC2, Amazon S3, Amazon Cloud Watch, AWS Lambda, Amazon IAM, Elastic Search., ElastiCache, AWS Data Pipeline.\n\n\n\nClient: Y-USA, Chicago-IL\t\t\t\t\t\t\tJun’16 – Apr’17  \nRole: AWS Java Developer\n\t\nThe Y is a nonprofit like no other. That’s because in 10,000 neighborhoods across the nation, we have the presence and partnerships to not just promise. My role is to develop J2EE applications and deploy them. It is using or experimenting with nearly every AWS service to develop, test, build, and run its most critical workloads\n\nResponsibilities: \nInvolved in complete SDLC life cycle – Designing, Coding, Testing, Debugging and Production Support for over 4+ projects.\nWorked closely with Business Analysts in understanding the technical requirements of each project and prepared the use cases for different functionalities and designs.\nDeveloped strategy for cloud/virtualization migration and implementation best practices.\nWorked on multithreading in Web applications to deal with the asynchronous calls.\nWork in close collaboration with internal customers and teams to develop strategies that address product content and overall user experience design for Catalyst’s clients.\nDeveloped new features to meet the specifications as set out by lead developer.\nImplemented distinctive Design patterns like singleton, factory and J2EE design patterns like Business delegate, session façade, Value object and DAO design patterns. \nCreated POJO classes, Spring configuration files to use dependency injection.\nUsed PL/SQL to write Stored Procedures, Functions and Triggers. \nEfficiently handled periodic exporting of SQL data into Elasticsearch\nDesigned new classes and functionalities using various OOPs concepts for CRM application for customer service, especially using dynamic polymorphism concept.\nUsed the JavaScript dynamic functionalities for different UI components and handled the exceptions.\nInterpret IOT Integration flow development and life cycle management tools using iPaaS capabilities.\nUsed Amazon Cognito to create unique identifiers for end users that are kept consistent across devices and platforms.\nExperience in RESTful service design, documentation, and implementation experience using AWS API Gateway\nEnabling SSL Security in Web Environments for IBM HTTP Server & Web Sphere application Server. \nUsed Spring Core Annotations for Dependency Injection Spring DI and Spring MVC for RESTAPI s and Spring Boot for micro-services\nExperience in installing, configuring and maintaining webSphere commerce.\nGot experience in network performance management protocols like SNMP, Telemetry\nManage configuration of Web App and Deploy to AWS cloud server through Chef. \nNode.js used to proxy requests to eCollege Java web services, as well as store application preferences and state data in distributed mongo instances.\nDeveloped and deployed ETL components for Data Extraction, Transformation and Loading using Informatica Power Center.\nInvolved in development of Guidelines service which will route the oms request between sentinel and sentry. Developed with Jersey Restful Web services and Mongo DB.\nDeveloped single page application with Angular JS. \nDeveloped SWING Desktop Client to access Cash Services.\nInvolved in developing Java web based interfaces using HTML5, CSS3, JQuery, XML and JSON.\nWorked on JavaScript framework (Backbone, Node JS) to augment browser based applications with MVC capability. \nUsed ClearCase for source code maintenance and Clear Quest for bug tracking and maintenance.\nImported tables into physical layer of Oracle BI Admin Tool according to the documents provided. \nCreated unit and integration based tests for TDD approach and automated continuous integration and deployment. Implemented test coverage requirements.\nEnsured that agile principles and processes are properly implemented and adopted. \nSetup framework for all current and future front-end projects to use Backbone js, for framework organized module definitions \nLearned to index and search/query enormous number of documents inside Elasticsearch\nUsed GIT as version control application to maintain the update. \nConfigure Web server be able to serve WML pages.\nCreated the project from scratch using Angular JS as frontend, Node Express JS and Mongo DB as backend.\nNoSQL database modeling and design in a public cloud environment using AWS DynamoDB, Azure Document db.\nUsed BLAZE for the rules as a rules engine.\nDesigned PING & OAuth based single sign on solution for Tech Mobile App.\nInvolved in writing JDBC code to get data base connectivity. /\nWorked with source version control tool GIT to manage the code repository. \nAll the Business logic in all the modules is written in core Java.\nInvolved in creating Restful services with the JAX-WS Provider and Dispatch APIs.\n\nEnvironment: Java, J2EE, AWS, AWS IAM, AWS S3, Informatica, Spring, Struts, Hibernate, JMS, Servlets, JSP, JS Tag Libraries, Java Script, JQuery, CSS, HTML, JDBC, JNDI, Spring Security, JUNIT, MQ-Series, XML, XSLT, Eclipse, ANT, Web Sphere 8.x, Apache Tomcat server, Windows Azure Cloud, SOAP, WSDL, JAXB, Oracle, Design patterns, Ajax, UDDI, WSDL\n\n\nClient: FedEx, TX\t\t\t\t\t\t\t           Mar’15 – Jun’16 \t\nRole: Java Full Stack Developer\n\n\tFedEx Corporation is an American multinational courier delivery services company headquartered in Memphis, Tennessee. It is using or experimenting with nearly every AWS service to develop, test, build, and run its most critical workloads. FedEx is using AWS as central part of its technology strategy.\n\nResponsibilities: \nInvolved in understanding and developing the functionality requested by the clients.\nFollowing Agile methodology in development and having daily scrum calls.\nDesigned and developed the framework to consume the web services hosted in Amazon EC2 instances.\nOracle 11g was used as the database for the application which was hosted in the cloud using Amazon RDS service.\nUsed AWS SDK for connection to Amazon S3 buckets as it is used as the object storage service to store and retrieve the media files related to the application.\nDeveloped API for using AWS Lambda to manage the servers and run the code in the AWS.\nAmazon IAM was used to maintain the user credentials and also involved in creating custom IAM policies to various groups defined within the organization.\nUsed Amazon CloudWatch to monitor the application performance and used the logs to identify any threshold limits.\nUsed Azure document DB to store the data for metrics and backend reports.\nInvolved in discussion with ops team to resolve ad hoc issues.\nWorked on Hibernate object/relational mapping according to database schema.\nExtensively used Spring IoC for managing the component dependencies from the Event Handlers to hibernate and Services.\nWorked with NoSQL Cassandra to store, retrieve, and update and manage all the details of migrated applications.\nUsed SVN as configuration management tool for code versioning and release.\nWorked with CVS repository, for migrating the code base from CVS to SVN.\nWorked on Embedded Tomcat to deploy the code internally.\nUsed automated build tools like TeamCity and Jenkins.\nWriting UNIX shell scripts for the Procmon Jobs.\nUsed AquaStudio GUI to the Oracle 11g database for performing the database operations.\nInvolved with the QA testing team to ensure the quality of the developed applications.\nDeveloped front end using the JSF, JSTL, HTML5, CSS3, JavaScript, JQuery and AngularJS.\nDeveloped Junit test classes for unit testing purposes.\nInvolved in setting up Maven configuration and helping Continuous Integration (CI) Issues.\n Developed server running script for automation using the JBoss 6.3 application server\n Extensively used GIT as the version controlling Tool.\n Configured Log4j for adding the debugging information in the code base.\n Involved in debugging the defects, code review and analysis of Performance issues.\n\nEnvironment: Java, Multithreading, core Java, Spring 4.0, Hibernate ORM 4.3.0, Spring web-flow,\nSpring MVC, Spring AOP, Spring Hibernate, JSP, JSF 2.2, JSTL, HTML5, CSS3, Ajax, JavaScript, AngularJS, Node JS, XML, Web services (Soap and Rest), JBoss 6.3, Oracle11g, Amazon EC2, Amazon S3, Amazon Cloud Watch, AWS Lambda, Amazon IAM, Elastic Search, GIT, JIRA , Junit, Unix ,Log4j.\n\n\nClient: Comerica Bank, Detroit-MI                                                 \tOct’14 – Feb’15 \nRole: Build and Release Engineer\t\t\t\n\n\tComerica Bank is one of the secured financial institutions that serves huge domain of customers. Bank offers various financial and banking services to its customers. The current application is a part of online banking that allows a customer to pay bills securely as well as enroll in monthly automatic recurring bill payment. The functionalities involved in e-bill payment are Add a Payee, make a Payment, Set up Automatic Payments, Receive Bills Electronically, Request E-mail Notifications and Review Payments. The application also supports intra and inter-bank transfer of funds for a given customer.\n\nResponsibilities: \nDeveloped and supported the Software Release Management and procedures.\nPerformed all necessary day-to-day Subversion/CVS support for different projects. \nResponsible for design and maintenance of the Subversion/CVS Repositories, views, and the access control strategies. \nManage all CM tools (JIRA, Confluence, Artifactory, SVN, Maven, Jenkins, ANT, Git, GitHub, and Visual Studio) and their usage / process ensuring traceability, repeatability, quality, and support. \nManaged tools like Subversion, Jenkins, JIRA and Performed maintenance and troubleshooting of build/deployment systems. \nCreated Fuel NA's Q/A process; equipped and set up the Q/A lab.\nWrote Pom.xml for Maven application builds automation. \nExperience integrating JUnit check style code analysis and testing during the build.\nUsed Shell and Perl scripting to deploy artifacts that are built by Maven. \nManaged and performed the environment related configuration changes as a part of deployment. \nSenior Developer for a Documentation Project which involved using a combination of XSLT, Java and C to produce and render PostScript files from XML data. \nDeployed the archives to Tomcat Application Servers. \nServed as a partial administrator for Unix Machines. \nPerformed re-starts and xml configs and post deploy setups and brought application up for testing.\nImplemented & maintained the branching and build/release strategies utilizing subversion/CVS.\nUsed ANT as a build tool on Java projects for the development of build artifacts on the source code.\nAutomated the build and release management process including monitoring changes between releases.\nDeployed the Java applications into web application servers like Apache Tomcat.\nExecuted user administration and maintenance tasks including creating users and groups, reports and queries. \nWorked as a system administrator for the build and deployments process on the enterprise server.\nInvolved in periodic archiving and storage of the source code for disaster recovery.\nAdministered Hudson and responsible for creating new projects and enhancements for old projects. \nResponsible for Plugin Management, User Management, regular incremental backups and regular maintenance for recovery. \n\nEnvironment: Subversion, CVS, Java/J2EE, ANT, Hudson, LINUX, XML, Apache Tomcat, Oracle, Perl Scripts, Shell scripts.\n\nClient: ByteApha Solutions – India\t\t\t\t\t                  Jan ’13– Sep’14\nRole: Java Developer\n\nByteApha Solutions want to make your web experience as intuitive as it can be. You will be able to navigate around without any ads or cyber noise as we like to call it!\nResponsibilities: \nResponsible for designing and developing Manage Purchase Order Web Service and presentation layer  \nDesigned and developed Enterprise Eligibility business objects and domain objects with Object Relational Mapping framework (Hibernate). \nDeveloped Presentation layer components comprising of JSP, AJAX, CSS, and JQuery. \nImplemented Asynchronous Functionality using jQuery Ajax. \nDesigned and Implemented Spring Framework based Restful service for handling the AJAX requests. \nExtensively involving in writing database coding, complicated functions, Triggers, Types, Views and Packages \nDeveloped DAO API to manage the payment information using Hibernate ORM. \nUsed Log4j logging framework for logging messages with various levels written throughout the java code \nUsed Web Services for creating rate summary and used WSDL and SOAP messages for getting insurance plans from different module and used XML parsers for data retrieval. \nUsed Eclipse based STS IDE for designing, coding and developing applications \nDeveloped test cases and performed unit testing using JUnit. \nDocumented designs on confluence using class diagrams, sequence diagrams and high-level activity diagrams using UML from the requirements. \nUsed Maven script for building and deploying the application.\n\nEnvironment: Spring Framework, Hibernate ORM, JQuery, CSS, AJAX, Html5, SQL, JDBC, SOAP    Web Services, Restful services, Eclipse(STS), Web Logic, SVN, JUnit, JIRA, Maven\n\nClient: Medicon HealthCare, India.       \t\t\t\t\tJune '09–Dec '12\nRole: Java Developer\n\n\tMedicon Health Care Pvt.Ltd has won many accolades in the domestic and international pharmaceutical domain. We are engaged in manufacturing & exporting of pharmaceutical products for acute care market etc. We are a leading group of Pharma companies that is headed by an experienced management involved in the diverse field of pharma industry.\n\nResponsibilities:\nRequirement Study and Analysis\nDeveloped Use Cases, Class Diagrams, Activity Diagrams and Sequence Diagrams.\nDeveloped Java Server Pages (JSP) for the front end and Servlets for handling Http requests.\nDeployment on the Tomcat Server.\nSpecifying the data flow using XML and DTD.\nRunning Sqoop for importing data from Oracle & another Database. \nImplemented database using SQL Server.\nDeveloped GUI using JSP, HTML and DHTML.\nDesigned tables and indexes\nDeveloped web forms using HTML for the application.\nDeveloped data insertion forms and validated them using JavaScript.\nCreated Stored Procedures, Functions and Triggers using PL/SQL.\nTesting the application and troubleshoot and fixed bugs\n\nEnvironment: JSP/Servlets, HTML, JDBC, Oracle, Java Beans MS-Access, Java\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "ansible",
        "aws",
        "azure",
        "bash",
        "cassandra",
        "collaboration",
        "communication",
        "confluence",
        "css",
        "docker",
        "dynamodb",
        "ec2",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "kubernetes",
        "lambda",
        "mongodb",
        "node.js",
        "oracle",
        "python",
        "rds",
        "rest api",
        "s3",
        "scrum",
        "sql",
        "typescript"
    ]
}