{
    "id": "resume_0d29a96a-059d-4b3c-a498-20a831550095",
    "metadata": {
        "filename": "Nikki_Nimmagadd.docx",
        "processed_date": "2025-09-24T08:45:45.803464+00:00"
    },
    "raw_text": "Nikita\nniki.nimmagadda@gmail.com\n(201) 895-0814\n\nSUMMARY\n\nProven success as a Business analyst for more than 7 years, providing a well-balanced understanding of business relationships, project requirements, and technical solutions.\nExperience in all phases of the GUIDe, Software development life cycle (SDLC) and worked with various methodologies like Waterfall, Agile RUP and Agile SCRUM.\nExperienced in gathering and designing Business Requirements Documents (BRD), Business Design, Business logic and translating them into Functional Requirements Documents (FRD) to meet strategic goals. Hands on experience in Quality Assurance (QA), IT Project Coordinating, by directing and monitoring the requirements, framework conditions and progress of short-term/Long term IT projects.\nExpertise in developing QA Test plans, Test scripts and Test cases. Strong experience in conducting and leading the User Acceptance Testing (UAT). \nHands on experience in project planning and work breakdown structures (WBS).\nExperienced in Performed Root Cause Analysis for a identifying event(s) causes, revealing problems and solving them.\nParticipated in Code Reviews and proposed software solutions.\nComprehensive knowledge in Business Process Modeling, Rational Unified Process (RUP) and Unified Modeling Language (UML), and Data Mapping including Process Flow Diagrams, Sequence Diagrams, Activity Diagrams, Use Case Diagrams.\nExperienced in conducting Project Readiness Review after performing verifications and validations to the test scripts for any releases.\nExtensively involved in Market Research, Feasibility Studies, System Analysis, Risk Analysis and GAP Analysis.\nExperienced in Handling complicated Change Requests (CR) and User Conflicts.\nExpertise in broad range of technologies, including business process tools such as Microsoft Project, MS Excel, MS Access, MS Visio, technical assessment tools, and bug tracking tool like Track It and Quality Centre.\nExperienced in working with Order management Systems, CRM and Content Management.\nExperienced in testing oracle interfaces developing test scripts for Custom Trial Balance Report, Journal Voucher report, Purchase Order, Purchase Invoice and Supplier conversion process for R12. Tested reconciliation of AP, AR extraction using summary and detail reports.\nHighly motivated team player with excellent Interpersonal and Customer Relational Skills, Proven Communication, Organizational, Analytical, Presentation Skills, and Leadership Qualities.\n\nTECHNICAL SKILLS\nLanguages and Tools: UML, Rational Rose, Requisite Pro, ASP. Net, Rational Clear Case, Rational Clear Quest, MS Project, MS Visio, MS Office Suite, MS Excel, Load Runner, SQL, Java, J2EE, C#, VB.NET, C++, Mercury Quality Center (QC), Adobe Acrobat, SharePoint, Track It, Axure, iRise, Mind Mapping Software.\nBPM (Business Process Management) tools and Methodologies: Metastorm BPM, Clear Quest\nMethodologies: SDLC, Waterfall, Agile, RUP, SCRUM\nDatabases: Oracle, MS SQL Server, MS Access\nCSM Certified\n\nEDUCATION\n\nMaster’s in Business Administration\nVirginia International University, Fairfax, VA (GPA: 3.89)   \n\nWORK EXPERIENCE\n       \nBusiness Systems Analyst                                                                                               Sep 2015 – Present      \nClient: Giant Eagle\nLocation: Pittsburgh, PA\n\nResponsible for requirements gathering, analysis, detailed process flow design, user acceptance testing and rollout of new & modified feature functionality deployed on the E-commerce website applications.\nCreated and maintained Work Breakdown Structures (WBS) that contributes to the development of working schedules.\nFacilitated and participated in Joint Application Development (JAD) sessions for requirements gathering, resolving open issues and change requests. \nActively participated in Gap Analysis in order to review the performance.\nPrepared graphical depictions of Use Cases, Use Case Diagrams, Activity Diagrams, Sequence Diagrams, Process Flow Diagrams and creation of technical design (UI screen) using Microsoft Visio.\nWorked with a team of developers, system engineers and database analysts to produce test cases and scripts for the systems functional, operations, and benchmark tests.\nCreated Test Plans, Test Strategies, and Test Metrics/Logs for System Acceptance Testing, RTM in HP Quality Center 11.0. Tested, wrote and executed test plans. \nGenerated bug reports in JIRA, Bug tracking tool.\nAccumulated system requirements from various departments through surveys and interviews.  \nInvolved in prioritizing the defects and writing business requirements to resolve them. \nActively led requirements analysis and program design, and took a pro-active approach to meet scalability and extensibility in implementing projects.\nPerformed IV &V using manual validations.\nExperience in gathering requirements for the CF9, Oracle forms and BO applications.\nLead the help desk for the newly built applications and enhancements.\nAssisted PM with project planning, estimating, budgeting, resource allocation, collaboration and time capture using Clarity Project Manager.\nPerformed Gap analysis by identifying existing technologies, documenting the enhancements to meet the end state requirements.\nInvolved in mapping the data elements from the User Interface to the Database and help identify the gaps.\nExpertise in using Data Modeling Tools for creating Logical and Physical Data Models. Understood   existing data model and documented the performance of the system. \nCreated and maintained project documentation.\nSupported PM by mentoring specific projects in application of the GUIDE methodology based on the SDLC, especially from project management, requirements and architecture perspectives.\nWorked with development and testing teams to accomplish timely release objectives. \n\nBusiness Analyst                                                                                                       Jul2013 - Aug 2015\nClient: Cognosante\nLocation: McLean, VA\n                                 \nGathered and validated requirements from the client, resulting in detailed business rules, functional & non functional requirements based on interactions with process owners, stakeholders and represented them in RTM using Rational Rose and created process design using RUP methodology.\nCreated Test Plans, Test Strategies, and Test Metrics/Logs for System Acceptance Testing in HP Quality Center. Tested, wrote and executed test plans. Liaison between IT and business community.\nMaintained WBS for the project and contributed to the development of working schedules for estimating, prior to proposal date, which sufficiently illustrated the sequence of work activities and contract time.\nPerformed requirement Analysis\nFacilitated and participated in Joint Application Development (JAD) sessions for requirements gathering, resolving open issues and change requests.\nImproved and extended internal test frameworks and automated tests performing exploratory product testing and white box testing.\nWorked closely with developers and requirements analysts, program managers, and subject matter experts in the design and implementation of quality features.\nPerformed verification and validation procedures to the test results and produced the Production Readiness Review for all the environments before the release occurs.\nTracked the development of project reports through risk and issue logs, Evaluation and Findings Reports, Analysis and Findings reports and presentations.\nCreated and maintained EFRs for helpdesk audit and database server audit reports on the monthly basis.\nReviewed and analyzed existing policies, procedures, and systems, and advised on their impact and made recommendations.\nAnalyzed problems to identify significant factors, gathered pertinent data, and recommended solutions.\nCreated and maintained IV & V process documents in the share point.\nAnalyzed the findings and made recommendations to improve efficiency to senior leadership representatives.\nDeveloped methodologies to identify the training and operational capability gaps from Field Teams, Staff, Services, Coalition, and others.\nWorked in conjunction with the client and staff from three different contractors to plan, coordinate and conduct a variety of programmatic reviews.\nAssisted PM in developing Vision and Mission statements as an initial step in strategic planning \nprocess.\nAssisted PM in conducting comprehensive portfolio reviews periodically, evaluating overall performance in light of client goals, requirements and corrections.\nPrepared graphical depictions of Use Cases, Use Case Diagrams, Activity Diagrams, Sequence Diagrams, Process Flow Diagrams and creation of Technical Design (UI screen) using Microsoft Visio for representing all the Supply Chain Management function and the Logistics. \n\nBusiness Systems Analyst \t\t\t\t                                      Sep 2011 - Jul 2013\nClient: IBM \nLocation: Beaverton, Oregon\n\nGathered and validated requirements from the client, resulting in detailed business rules, functional & nonfunctional requirements based on interactions with process owners, stakeholders\nCreated and maintained product backlog/acceptance criteria and facilitated sprints. \nUsed agile methodologies to support the delivery of quality products that meet client specifications with minimum defects, on-time, and on-budget.\nActed as a scrum facilitator for sprints and operated in agile methodology.\nConducted JAD sessions with management, SME, vendors, users and other stakeholders for open and pending issues.\nExtensive experience in modeling the AS IS and TO BE ecommerce solutions.\nExperienced with elicitation techniques like interviewing the client, preparing questionnaires, brainstorming, focus groups, cost/benefit analysis and risk analysis\nUsed MS Visio for Process modeling, Process mapping and Business Process flow diagrams.\nPerformed manual front-end testing to check all functionalities of different modules. \nDeveloped strategies with Quality Assurance group to implement Test Cases in HP ALM for stress testing and UAT. \nExperienced in data ware housing projects\nInvolved in Test Planning, Test Preparation, Test Execution, Issue Resolution and Report Generation to assure that all aspects of a Project are in Compliance with the Business Requirements. And also involved in Reconciliation of the Data Analysis according to the need of the clients. \nPerformed job of contact point for all stakeholders (business, legal, compliance, development). \nTrained the future users to coordinate their activities vis-à-vis CORD system rather than ARW.\nAssisted the SA to document all custom and system modification after the SCR’s were satisfactorily solved. \nCreated and managed project templates, use case project templates, requirement types and traceability relationships and managed the concurrence of the parties involved with respect to the evaluation criterion.\nPrepared graphical depictions of Use Cases, and Mock up Screens using Microsoft Visio. \nSuccessfully conducted UAT among various projects. \nLiaison between the business users and technical team \nUsed the Data Stage Designer to develop processes for extracting, cleansing, transforms, integrating and loading data into data warehouse database.\nMaintained project documentation in the tools like SharePoint.\n\nEnvironment: JSP, Oracle, HTML, XML, HPQC, Clear Case, Clear Quest, XSL, Cobol, Rational Rose, MS Office, MS Visio, RUP, UML, Agile, MS Project, SQL, MS Access, MS Excel and MS Word.\n\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "data analysis",
        "html",
        "java",
        "jira",
        "leadership",
        "mentoring",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}