{
    "id": "resume_83e7a08a-196a-41e3-b995-962e6d8df100",
    "metadata": {
        "filename": "Pierre John.docx",
        "processed_date": "2025-09-24T08:45:47.030857+00:00"
    },
    "raw_text": "                                                                                                               \n                          Pierre John\n                             Lead Java J2EE Developer (Working Remotely)\n                         Mission, San Francisco, California, 94105\n                   E-Mail: PierreJohn14@yahoo.com\n\n\nPROFESSIONAL SUMMARY:\n\nAround 10+ years of IT experience in Web development, n –tier Enterprise Distributed Application development using JAVA, SERVLETS, JSP, Hibernate Framework, JDBC, Oracle, Javascript.\nJava and J2EE developer with in Java based technologies J2EE, JSP, Struts, Spring, JDBC, Hibernate, Apache Tomcat, XML, Servlets, Java Beans, HTML, JavaScript, AngularJS. \nExtremely good in Struts, Spring Framework, Hibernate and Web Services. \nExpertise in back-end/server side Java technologies such as web services, Java persistence API(JPA), Java Messaging Service(JMS), Java Database Connectivity (JDBC). Expertise in using SOA and Web Services Technologies and Tools like Web Services, SOAP, REST, UDDI, SOAP UI. \nExperience with Test Driven Development (TDD). \nStrong experience with Web services development (SOAP & Rest). \nFamiliar with Design Patterns like Singleton, Factory Design, MVC, Data Access Objects etc. \nAdapt in server side development skills using Apache and good knowledge of database connectivity (Data Source) for databases like Oracle, MySQL, and NoSQL like Mongo DB. \nExperience in designing, developing and deploying J2EE applications on IBM Web Sphere/Web Logic Application Servers, Tomcat and JBOSS. \nExperience in all phases of SDLC and Agile Methodology. \nDeveloped applications with Spring framework using technologies like AOP (Aspect Oriented Programming), IOC (Inversion of Control), DAO (Data Access Object), MVC (Model View Controller) and JDBC. \nExperience in using persistence frameworks like Hibernate for Object Relational Mapping (ORM). \nExperience in writing applications using Java/J2EE & related technologies such as Servlets, JSP, JDBC, Java Beans, XML, HTML, SQL, PL/SQL. \nExpertise in developing GUIs using JSP, HTML and XSL, CSS and JQuery. \nExtensive development experience on different IDE's like Eclipse, My Eclipse, NetBeans. \nExperience in Web Services Technologies like SOAP, WSDL, UDDI and Restful. \nExperience in various Agile methodologies like Test Driven Development, SCRUM, and Pair Programming. \nExperience in developing Unit testing & Integration testing with unit testing frameworks like JUnit, Easy Mock, Mockito, DbUnit and Power Mocks. \nWorked on Automated Functional Testing using Spock Framework in Groovy. \nExperience with major databases such as Oracle, DB2, MYSQL, MS Access and MS SQL Server. \nStrong knowledge in implementing Singleton, Service Locator, Model View Controller (MVC) Session Facade, Business Delegate and DAOJava/J2EE design patterns in the projects. \nExtensive use of Open Source Software such as Jenkins Enterprise; Web/Application Servers like Apache Tomcat 6.0 and Apache Struts, LOG4J for logging information and exceptions, Apache ANT for making build scripts, VSS, SVN, CVS, Eclipse 3.x, Net Beans 6.x IDE. \nUsed Swagger for API documentation. \nArtifactory repository manager; dependency manager. \nExperience in Eclipse Debugging and Defect fixing and used Edit Plus and Text Pad. \nProficient in Apache Wicket and Struts and Spring, Hibernate. \nExperienced in generating logging by Log4j to identify the errors in production test environment and experienced in Ant Tool. \nCreate OpenStack Instance servers. \nDatabase password encryption within Chef-Vault using Encrypted Data Bags. \nJenkins Enterprise open source Continuous Integration software. \nProvide designing to Low Level and High Level multiple modules and design documents. \nQuick learner and display good people skill when interacting with Business users, Functional and Technical team to meet the project deadlines. \nCommitted to enhancement of software reliability, performance and adherence to coding standards while contributing to the technical code documentation. \nExpertise in Database testing, Front-end, Functional testing, System testing, GUI applications testing, Back End testing, Stand alone and web-based applications in different domains.\n\nCERTIFICATIONS:\nSun Certified Java Programmer\n                                                                                                                           \nEDUCATION: \nMaster of Science from New York University.\n\n\nPROFESSIONAL EXPERIENCE \n\nWalgreens, Deerfield, IL (Wrking Remotely)                                                                    June 2015- till date\nLead Java J2EE Developer\n\nHelping to design, implement, and maintain multiple e-commerce/internal websites catering to customers and business users using a multi-tiered architecture. Said external and internal websites facilitate the ability for customers/business users to book and purchase products using complex business logic factoring ship sailing dates, existing Brochures, various pricing models, taxes, commissions, etc. All sites are based on a model-view-controller Struts architecture where JSPs hold presentation features, java beans and core java classes hold business logic, view controls, and stored procedure database calls. \n\nRESPONSIBILITIES:\nDeveloped the Web Based Rich Internet Application (RIA) using J2EE (Spring framework) and Macromedia/Adobe Flex.\nExtensive experience using framework APIs like Struts, Spring, iBatis and Hibernate.\nDeveloped hibernate DAO Accessor Classes using Spring JDBC Template, Worked with Hibernate for object relational mapping and connection management.\nImplemented Hibernate and Spring to replace EJBs in the earlier architecture.\nConfigured Struts, Hibernate framework with Spring MVC.\nDeveloped the application front end with HTML, JSP, Ajax, Struts Tag-libraries. Wrote custom JSP tags for role-based sorting and filtering.\nDevelopment environment included HTML5, CSS3, Java, Javascript, Angular.js, Node.js Bootstrap, Backbone.js, Cassandra DB, Play framework, RESTful Web Services and d3.js/dc.js data driven charting library. \nworked on open source (Ruby/Rails, Redis, Bootstrap, AngularJS, D3, c3Js, stubby, linux/ubuntu/centOS)\nDeveloping a set of dashboards in Splunk 6 by leveraging Underscore, D3, Jquery/UI, Backbone, and Django.\nConfigured JMS Server setup and DB Connection pool setup & deployed Returned items in Weblogic Server.\nInstalled and configured of Apache, Weblogic for QA Environment\nCo-developed dynamic Ruby on Rails/HTML5 application highlighting numerous data visualization of web metrics.\nUsing Ruby on Rails for development with backbone.js\nImplemented MVC design architecture using Ruby on Rails and MySQL\nDesigned and implemented the web application in Ruby on Rails, Node.js, HTML5 and JQuery from initial concept development to beta launch.\nImplemented web system using new technologies such as Websocket, Less and Playframework.\nUsed Scala, Akka, Play Framework and HTML, CSS, jQuery, JavaScript for the UI.\nDesigned back-end system Logging Framework using Play Framework / Apache Kafka / ElasticSearch. \nDesign and Developed using WebService using REST, SOAP, Apache CXF.\nGood exposure to RESTful and SOAP based web services.\nDeveloped the UI panels using JSF, XHTML, CSS, DOJO and JQuery.\nUsed JQuery to make the frontend components interact with the Javascript functions to add dynamism to the web pages at the client side. \nDeveloped additional UI Components using JSF and implemented an asynchronous, AJAX (JQuery) based rich client to improve customer experience.\nDeveloped Presentation layer components comprising of JSP, AJAX, Struts Action, Struts Form Beans and AJAX tag libraries.\nWrote complex reporting applications with Ext JS and Sencha Touch for Windows Azure and Amazon Web Services, Linux and Windows servers.\nIntegrate the ExtJs/Sencha framework with Oracle BPM.\nDeveloped web pages using HTML/CSS and JavaScript.\nDesigned and modified User Interfaces using JSP, JavaScript, CSS and jQuery.\nDeveloped user interface using JSP, AJAX, JSP Tag libraries to simplify the complexities of the application.\nDeveloped user interface using JSP, JSTL and Custom Tag Libraries and AJAX to speed the application.\nDeveloped Servlets and JSPs based on MVC pattern using Struts framework and Spring Framework.\nDeveloped Oracle PL/SQL Stored Procedures and Queries for Payment release process and authorization process.\nImplemented Hibernate for the ORM layer in transacting with Oracle database\nDeveloped HQL queries for CRUD.\nUsed JDBC to invoke Stored Procedures and database connectivity to ORACLE.\nInvolved in the development of SQL, PL/SQL Packages, Stored Procedures\nDesigned Use Case Diagrams, Class Diagrams and Sequence Diagrams and Object Diagrams to model the detail design of the application using UML.\nUsed Eclipse IDE for designing, coding and developing applications\nDeveloped JUnit test cases for all the developed modules.\nUsed Maven script for building and deploying the application.\nDeveloped Maven scripts for various tasks to automate the build process and for the deployment of the application in Web Sphere server\nDesigned and developed Generate PDF functionality using Spring framework and iText\nDeveloping unified Global Transaction Banking platform using Google Web Toolkit (GWT) to support a consistent web experience\nApplications developed in Eclipse IDE with Java, Google Web Toolkit, Hibernate, CSS, JBoss, HTML & Oracle DB.\nUsed Agile principles such as Scrum, Continuous Integration, Pair Programming and Test-Driven Development (TDD) as development methodology. \nDeveloped Test-Driven Development (TDD) and continuous integration using JUnit, JBehave and Jenkins.\nImplemented two Java portals. One is Crystal Report Engine and the other is Jasper Report Engine as plug-in to other web-applications depending on the user's preferences.\nResponsible for ClearCase administrative tasks (working with branching/merging, triggers, labeling etc).\nWorked on designing and creating business rules using IBM ILOG Rules Engine.\nProvide direction and execution oversight for large Agile Development projects for the FBI as an integral member of the Program Management Office (PMO).\nProvides technical assistance in identifying, evaluating and developing Agile methodologies and procedures that are efficient, effective and meet good business practice.\nIntegrate Web 2.0 sites into client's website.\nDesign and develop enterprise or application architectures and RFI/RFP delivery solutions using SOA (Service Oriented Architecture), web services, DODAF (Department of Defense Architecture Framework), and segment architecture.\n\nENVIRONMENT: Java, J2EE, Spring, Hibernate, Struts, Weblogic, SOAP, APACHE CXF, REST, JQuery, AJAX, Sencha ExtJS, JavaScript, Angular.js, Node.js, Bootstrap, Backbone.js, Play Framework, Apache Kafka, ElasticSearch,  JSP, Mongo DB, Cassandra, Ruby on Rails, Oracle, CRUD, PL/ SQL, JDBC, UML, Eclipse, Junit, MAVEN, ClearCase, Jasper report, ILOG, Agile, Scrum, TDD, Web 2.0, Continuous integration, SOA.\n\n\nCitigroup Inc, Warren , NJ                                                                                               April  2013 – May 2015          \nSr. Java J2EE Developer\n\nPROJECT DESCRIPTION:\nConcierge is used by the Citibank financial centers to support all sales, services  and the customer problems resolution functions. Concierge  provides  a 360 degree view of  the customer showing the full citi  accounts relation ship including banking, credit card loan mortgage and brokerage accounts. Concierge is used to perform accounts opening for consumer and commercial asset, liability, brokerage &retirement accounts .concierge account opening includes end to  end process comprising third party verification,  risk and anti- money laundering ,comprehensive fulfillment processing  including checkbook and card printing, rewards  program enrollment , citi mobile enrollment and all accounts opening forms (terms and condition, disclosures, tax forms). Concierge also includes full sales supports by presenting pre –approved  credit offer in account opening and servicing, sales referral processing, and sales  compensation computation. \n\nRESPONSIBILITIES:\nDeveloped and Implemented Web Services and used Spring Framework.\nUsed the light weight container of the Spring Frame work to provide architectural flexibility for inversion of controller (IOC).\nImplemented the caching mechanism in Hibernate to load data from Oracle database.\nImplemented application level persistence using Hibernate and Spring.\nImplemented Persistence layer using Hibernate to interact with the Oracle database, Used Hibernate Framework for object relational mapping and persistence.\nDeveloped Servlets and JSPs based on MVC pattern using Struts framework and Spring Framework.\nExpertise in developing enterprise applications using Struts Frameworks.\nDeveloped server-side services using JSF, Apache Trinidad components, Java, Hibernate, Spring, Web Services\nDeveloped the front end using JSF and Portlet.\nDeveloped a project in Python using Client and Worker methodologies. \nImplemented Python scripts to import raw data from web into PostgreSQL database. \nWork directly with developers to design and code Designate using python\nWrote python scripts to parse XML documents and load the data in database. \nScalable, database-driven web application development using a variety of frameworks: ASP.NET on C#, Flask on Python, and PHP. \n Used Python and Django to interface with the jQuery UI and manage the storage and deletion of content.  \nImplemented improvements to the WebSphere Commerce Organization Console and the Administration Console to display, and allow for update, new member information.\nDevelopment work is also done to the legacy system using WSAD IDE. The modified application is deployed on websphere using ANT and javascripts for use by interface project.\nImplement web service components using JiBX and Apache CXF framework.\nInvolved in the deployment of Web-Service End-Points using Apache CXF.\nDesigned and Developed WebServices to interact with various business sectors and used SOAP protocol for webservices communication.\nDeveloped Rest architecture based webservices to facilitate communication between client and servers.\nDeveloped AJAX functionalities using frameworks like JSON, DOJO and JQuery.\nExtensively worked on business, front end and persistence tier using the JSP, Spring MVC, and EXTJS/JSON.\nDeveloped mobile applications using JQuery Mobile, PhoneGap, and Sencha for Virtual Infotech Inc\nDeveloped Web based Dynamic Form Builder using DHTML, JavaScript Object-to-XML.\nDesigned and developed the UI using Struts view component, JSP, HTML, CSS and JavaScript.\nDesigned and modified User Interfaces using JSP, JavaScript, CSS and jQuery.\nDeveloped UI screens using YUI, CSS and JQuery.\nDeveloped user interfaces using JSP, JSF frame work with AJAX, Java Script, HTML, DHTML, and CSS.\nDeveloped AJAX scripting to process server side JSP scripting.\nDelivered mobile app for book reading capability with HTML5 Sencha and online services with Flash/Flex.\nDeveloped HTML5 Mobile application with HTML5, Java Script, jQuery, JSON and RESTful web service.\nImplemented User interface (UI) entire application using JSP, JSTL, Custom Tag Libraries, JavaScript, XML/ XSLT, HTML and CSS.\nHooked up the JSP plugins with spring bind and JSTL tags in the HTML pages.\nDeveloped the Servlets for processing the data on the server.\nDeveloped Java and EJB in Mainframe DB2 environment.\nDeveloped stored procedures, Triggers and functions in Oracle 10g to process the trades using PL/SQL and mapped it to Hibernate Configuration File and also established data integrity among all tables.\nWrote Stored Procedures, Packages, PL/SQL scripts are used to query the database. \nDeveloped a bulletin board module for supplier and vendor information portal. Application included forms to upload notification documents to the Supplier bulletin and maintenance of documents, complete with CRUD capabilities and email notifications.\nUsed JDBC to connect to the information model tier.\nDesigned the UML, created class, sequential diagrams using Borland Together Architecture, modified code, configured WebLogic server and project in Oracle.\nUsed CVS to maintain source and version management and used Eclipse as IDE.\nPerformed unit testing using JUNIT framework and used Struts Test Cases for testing Action Classes.\nUsed Maven to build and generate code analysis reports.\nConfigured Maven dependencies for application building processes that created Pom.xml files.\nUsed JPA 2.0 (JDBC Framework) and Apache CXF for XML generation.\nUse jPod and iText to manipulate PDF operations.\nProvided end user support for all levels of Oracle ECM users.\nWorked on proof of concept using Google Web Toolkit to create the personal card application site of American express from scratch.\nPioneer application hosting on cloud infrastructure using Amazon Web Services.\nUsed Amazon Web Services EC2 to deploy our team's projects on to the public cloud.\nDeveloped a method of providing proofs of past data possession for cloud forensics and built the prototype\nTested and build cloud EC2 and database instance in Amazon cloud;\nArchitected a customized network protocol used by client applications to communicate with cloud architectures.\nDirectory Listing and File down load services (Similar to Windows Explorer on a PC, developed using Google Web Toolkit, AJAX).\nWorked on tickets from service-now and Jira on daily basis.\nDeveloping a new Content Management System backed by subversion using java EE technologies.\nReporting using Jasper Reports through iReport Design tool.\nInstalled and configured a multi-server, clustered ILOG environment. Documented architecture and trained client administrators.\nThe integration of Breeding Technology platforms along with utilization of JRules allows Trait\nIntegration (TI) to make quicker decisions from aggregated data.\nExtensive experience in developing applications using Java and related technologies using WATERFALL and AGILE SCRUM methodologies.\nMentoring of junior members for Agile (Scrum) process & Junit testing\nDeveloped automation test cases using Java and selenium on Eclipse for web 2.0 Ajax application\nInstrumental in getting Oracle SOA platform (11g) infrastructure up and running through installation, validation and POC with System of record.\nWorked on Asynchronous messaging system using by implementing JMS through Point-Point and Publish-Subscribe MQ-Series architecture.\nWorked with NoSQL database MongoDB and worked with it to perform many different operations\nDelivered projects in Smart Analytics portfolio using Big Data technologies like Hadoop, Sqoop, Hive, Pentaho. \nInvolved researching optimum solutions for a given Big Data problem using Hadoop, Apache Spark and other related technologies.\nArchitected the “Big Data as Service” project and implemented a system architecture using Amazon API and Puppet scripts to auto deploy Hadoop clusters through website.\nBottle micro-framework implemented with REST API and MongoDB (NoSQL) as back end database.\nApache Tomcat Server  was used to deploy the application.\nDeveloped custom web forms using PHP and JavaScript.\nPerformed J2EE application deployment using JBoss application server on Windows and Linux.\n\nENVIRONMENT: Java, J2EE, Spring, Hibernate, Struts,  REST, SOAP, Python,  Django, NoSQL, PHP,   Big data, Puppet , Hadoop,  Cloud, AWS, Javascript, Jsp, Servlet, Crud, Pl/ Sql, Jdbc, Uml, Eclipse, Junit, Maven, Itext, Soa, Jsf, Websphere Portal, Web Services, Soap, Dojo, Sencha Extjs, Css, Ajax, Html5, Db2, Xml, Oracle, Jira, Subversion (Svn), Jrules, Scrum, Jms, Apachi Tomcat, Linux, Php.\n\nUS Cellular, Chicago, IL                                                                                                    Oct 2011 – March 2013\nSr. Java J2EE Developer\t\t\t\t\t\t\t\t                         \n\nProject Description:\nWorked as a Java Developer / Cloud architect and involved in deploying various applications on AWS. Implemented and controlled the flow of data to and from AWS. Designed and configured several services using AWS/Java. Evaluated applications, infrastructure and security to propose architecture solutions. US Cellular is the fifth-largest full-service wireless carrier in the United States, providing national network coverage and industry-leading innovations designed to elevate the customer experience. The Chicago-based carrier has a strong line-up of cutting-edge devices that are all backed by a high-quality network in big and small cities and rural communities, and currently. \n\nRESPONSIBILITIES:\nWorked on the Spring framework like Spring IOC and Spring DAO.\nInvolved in multi-tiered J2EE design utilizing MVC architecture (Struts Framework), Hibernate and EJB deployed on Websphere Application Server connecting to an Oracle 8i database. The Application is designed using J2EE technologies based on Spring MVC architecture.\nWorked on persistence layer using O/R Mapping tool IBatis with Oracle 10g Database.\nDesigned the front end according to specs using JSP and Servlets on server side. Configuring and Integrating iBatis with Struts. HTML Component, data table, panel, dialogue etc was used for creating HTML Pages. Extensive Javascript Library usage.\nDeveloped Servlets and JSPs based on MVC pattern using Struts framework and Spring Framework.\nDeveloped the application using Struts Framework that leverages classical Model View Controller (MVC) architecture.\nImplemented View layer of MVC architecture using JSF components.\nImplemented JSF framework in the application which is based on MVC design architecture.\nMaintained the business standards and the requirements in EJB and deployed them on to WebLogic Application Server.\nDeveloped various EJB's to handle business logic.\nUsed JBoss application server to deploy application into Production environment.\nDeployed this application which uses J2EE architecture model and Struts Framework first on Weblogic 5.1 and helped in migrating to JBoss Application server.\nDesigned and Developed the input/output data formats in XSD for the WSDL files and accordingly implementing services using Apache AXIS2 .\nDeveloped the web services by using WSDL, SOAP using SOA.\nDeveloped web presentation layer using jQuery, HTML and CSS according to internal standards and guidelines.\nDeveloped the Action Classes, Action Form Classes, created JSPs using Struts tag libraries and configured in Struts-config.xml, Web.xml files.\nDesigned and developed the web-tier using Html, JSP’s, Servlets, Struts and Tiles framework.\nWorked on the MySQL migration project .To make the system completely independent of the database being used. Used Spring IBatis to implement this.\nUsed TOAD for all database query testing and optimizations\nInvolved in configuring JNDI properties, data sources for Oracle, UDB, DB2 data bases in websphere.\nScheduled reports daily, weekly, monthly for executives, Business analyst and customer representatives for various categories and regions based on business needs using SQL Server Reporting services (SSRS).\nDesigned the UML, created class, sequential diagrams using Borland Together Architecture, modified code, configured WebLogic server and project in Oracle.\nUsed Netbeans for development and WebLogic Application Server for deploying the web application.\nCreated and Implemented Keyword Driven Framework using Selenium.\nUsed Ant for developing build scripts and deploying the application onto WebLogic.\nUsed ANT for building the application and deployed on BEA WebLogic Application Server.\nDeveloped and Deployed the Application on Websphere using ANT build.xml script.\nDefined as-is-architecture, transitional architecture, and recommended future-state architecture related to Search technologies including Google GSA, Endeca, and EMC Documentum ECI.\nAdopt Agile Methodology to plan using JIRA.\nDeveloped the user interface screens using Swing for accepting various system inputs such as contractual terms, monthly data pertaining to production, inventory and transportation.\nEntered and processed patient data into CVS's database.\nUsed VSS (Visual Source Safe) as configuration management tool.\nCreated Jobs to Schedule multiple reports in Cognos Connection.\nPerformed performance tuning to enable high performance of ILOG JRules using Sequential/Rete algorithm within Data Stage environments.\nDesigning the flow of the project using Water Fall Model.\nDeveloped an application in Java using Oracle ADF framework.\nDesign of the process flow in Oracle BPM and jBPM to evaluate the difference between the behavior of different BPM tools.\nDeveloped applications using Visual Studio 2005, C#, and a combination of Windows Services, IBM MQ Series, and ASP.Net Ajax enabled web sites.\nTroubleshooted issues concerning Apache Tomcat during deployment.\nMoved Application from Solaris to Linux RedHat for system benchmark\nE-procurement system run on Unix operating system.\nLead development and site building on Drupal-based projects. Mentor junior developers on site building and development best practices.\nDesign & creation of multiple sites using: WordPress, HTML, PHP, XML, CSS, Javascript & more.\nApplying Ruby on Rails and JQuery debugged, enhanced, extended business-to-business SAP application. Provided extensive integration and functional mocks testing.\nDesign and Develop programs in C++ to integrate as per the users requirements.\nUsed ASP.NET technology for developing the presentation layer.\nWorked with performance tuning in .Net and Reporting Services.\nInvolved in developing PL/SQL stored procs and Informatica Workflows to migrate data from Legacy Mainframe/AS400 based systems.\nJ2EE to communicate legacy COBOL based mainframe implementations.\nExpose PL/I database access layer as web service using RD/Z.\nDeveloped and implemented Legacy system programs by using COBOL, DB2, CICS, JCL, JAVA and VSAM.\nWorked with DNS team to associate the urls with DNS, Coordinartion with SAs, DBAs Load Balancer and Firewall team.\nDeveloped Java Script and Action Script, VB Script macros for Client Side validations.\nDesigned and built it based on previous Classic ASP version. Upgraded its original database from Access to SQL 2008.\nDeveloped SQL queries. Actively worked on stored procedures.\n\nENVIRONMENT: Spring, iBatis, Struts, JSF, EJB, Jboss, APACHE AXIS2, WSDL, JQuery, JSP, SERVLET, MYSQL, Toad, SQL Server, UML, Netbeans, Selenium, ANT, Xml, EMC Documentum, JIRA, SWING, CVS, Visual Source Safe, Cognos, ILOG, Water fall model, Oracle Application Development Framework (Oracle ADF), Oracle Business Process Management (Oracle BPM), IBM MQ Series, Apachi Tomcat, Linux, Unix, Ruby, Wordpress, drupal, .Net, ASP, C, C++, Mainframe, COBOL, PL/I, JCL, SQL, SAS VB, ASP.\n\n\nAetna Insurance Hartford, CT                                                                                          Aug 2009 - Sep 2011  \t       \nJava Developer\n\nProject Description:\nAetna is one of the leading insurance group, which provides health insurance products and related services, including medical, pharmacy, dental, behavioral health, group life and disability plans, and medical management capabilities and health care management services for Medicaid plans. Aetna has customers includes college students, part time employees, governmental units, labor groups and many more. \n\nRESPONSIBILITIES:\nResponsible for developing Front-end pages using Adobe 3 framework, written MXML and Action script.\nResponsible for overall design & analysis of  UI components and integration with existing J2EE, Spring and Hibernate.\nImplemented the architecture of the modules according to the MVC standards (Presentation-tier, Business-tier and Persistence-tier).\nResponsible for implementing best design patterns from Cairngorm architecture to interact with backend using Hibernate to pull out the data to  UI components.\nDesigned several  UI screens with GUI the help of  3 Builder (RIA).\nDeveloped Action Script functions for event handling, response handling and error handling.\nDeveloped  Charting components like pie charts to show the project specific performance metrics.\nDesigned and developed all required Data providers which are being used by both  General UI controls and by Charting components.\nUsed Live Cycle Data services to  get the data from the back-end system(LCD’s)\nDesigned and Developed persistence layer with Hibernate,jQuery.\nIntegrated  and Hibernate with Spring. \nConfiguration of Hibernate mapping files and configuration with Spring.\nConfigured dependency injection mechanism in applicationContext.xml in Springs\nConfigured transaction mechanism in Spring.\nDeveloped Test cases with JUnit. \nDeveloped Account Creation/Update, Associate External Customer and Password Management Modules.\nInvolved in preparing documents like Impact Analysis, Unit Test Case, Check List and Code Review Documents. Performing Peer review. \nDeployed the entire application on windows and Linux platforms. \nPromoting builds from Dev Server to Staging Server to Production Server\n\nENVIRONMENT: Core Java ,J2EE, Java, Adobe , Ajax,Java Script,Servlets,GUI,JMS, Hibernets,MS SQL Server 2005,  JDBC,JNDI,pl/sql srored procedures,Apache Ant, CSS, eclipse  and Log4j.\n\n\nVanGuard Malvern, PA                                                                                                      June 2007 - July 2009  \nJ2EE Developer.\t\n\nRESPONSIBILITIES:\nInvolved in the requirement-capturing meeting with the subsystem with the end users and Department Heads in Vehicles.\nDesigned and Developed from scratch.\nInvolved in development and design of the complete flow from the front end to the back-end for each UI existing in the current application.\nDeveloped presentation layer using for enhancing the performance of the application. Integrated  with jsp to enhance the UI. Client side validations using Struts Validation framework.\nUsed Action Script for implementing  screens. \nImplemented Hierarchical grids with complex search mechanism.\nCalling pl/sql stored procedures to display data into database.\nDeveloped the classes in java to get the PDF data from DataBase.\nDeveloped the Utility java classes in java to do Date and String manipulations. \nUsed Stored Procedures to save and get the information to/from Database.\nXML is used to create the mapping between UI fields and Value Object fields.\nXSL is used to display the data in PDF from xml file.\nUsed CSS for applying style in entire applications.\nEstimate the infrastructure/ tools and technical manpower  required for developing  and delivering the Web Solutions to the clients or partner companies\nDeveloped the customized components for Reports.\n\nENVIRONMENT: Core Java, Jsp, J2EE, Java, Spring MVC, Web Services, Hibernates, Adobe, Ajax, Servlets, DAO, PL/SQL, MS SQL Server 2005, XML,  Log4j, Jsf, CSS, eclipse, Apache, Ant .\n\n\nHCL Technologies, INDIA                                                                                               April 2006- May 2007\nJava Developer\n\nRESPONSIBILITIES:\nUnderstanding the business requirements and designed test cases for responsible modules to test the complete functionality of application.\nDesign and Execution of Test Cases manually.\nDeveloped JSP’s for front end of Echo-View.\nDeveloped User Interface using CSS,GUI, JavaScript, JSP, Servlets and JSTL\nPerformed Functional, User Interface, retesting/regression testing.\nAnalyze test results and report to management.\nReported the Bugs and attended weekly status meetings and provide detailed status report.\n\nENVIRONMENT : Core Java,Servlets,jsp,html,javascript,Java beans,Core java,Jdbc, JDBC,Oracle 8i,Windows XP.\n\n\nVisa Status: US Citizen\n",
    "extracted_skills": [
        "agile",
        "angular",
        "asp.net",
        "aws",
        "azure",
        "cassandra",
        "communication",
        "css",
        "django",
        "ec2",
        "flask",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mentoring",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "php",
        "postgresql",
        "python",
        "r",
        "redis",
        "rest api",
        "ruby",
        "ruby on rails",
        "scala",
        "scrum",
        "spark",
        "sql"
    ]
}