{
    "id": "resume_323be83a-a12c-4488-b642-8e72920fc556",
    "metadata": {
        "filename": "PM RESUME.docx",
        "processed_date": "2025-09-24T08:45:47.150527+00:00"
    },
    "raw_text": "Avinash\n408-676-6390\navinashgne@gmail.com\n\nSummary:\nOver 9+ years of Project Management experience working in the Information Technology industry. \nC level reporting and presentations \nStrong proven experience in Vendor management, Schedule and Cost Management, Client relationship management, Consulting, contract negotiations and management \nStrong PMO structuring, modeling, processes, procedures, methodologies and best practices. \nStrong technical expertise in IT Infrastructure, Application Development, Cloud Computing, familiarity with IaaS, PaaS, SaaS Azure, AWS, CLC cloud onboarding, cloud portal provisioning. Telecommunications Networks, LAN's WAN's, Fiber Optics, wireless. Data Center build outs, migrations, Consolidations, Disaster recovery sites. \nFull life cycle hardware and applications implementations working cross functionally with engineering, facilities, Operations. \nExperience in utilizing JIRA to create projects with specified workflows, screens, permissions and fields for different teams.\nExpertise in creating change management plan and utilizing the change management to control project change requests and other changes such as those changes that do not affect project triple constraints. \nProven track record of delivering high visibility, large scale initiatives for multiple Fortune 100 companies with an emphasis on Cloud and Data center technology. \nExperience in working at Information Technology, Manufacturing, and Telecommunications companies. \nExtensive experience in both client and vendor management. \nUtilizes strong verbal and written communication skills to brief C-level executives, stakeholders and clients as to all phases of project status. \nWell versed in using Team Foundation Server (TFS), Microsoft Test Manager (MTM), HP-QTP, and HP Quality Center (QC). \nManaged business and technical requirements across multiple lines of business and diverse technologies. Possesses a passion for excellence and consistently drives programs to successful completion.\nAdept at identifying issues with product design through subjective assessment and comprehensive analysis and strong pecialization in applying a sound knowledge of various technologies to ensure optimal quality\nExperience in working under SCRUM methodology as a part of Agile environment.\nEnsured all release specific test documentations are complete towards the end of a project release\nProject Management Institute (PMI) member and PMP Certified.\n\nAreas of Expertise:\nManagement knowledge, Financial management, Planning & organizing Business planning, \nProgress reports, triple constraints (cost, time, and scope) control, and Risk management\n\nSkills & Competencies:\nProgram Management \nBusiness requirements gathering, Scope definitions, executive status reporting, budgeting, and managing change control/requests \nProficient in PMBOK, SDLC, PMLC, project delivery and methodologies. \nExperience with the NYS Project Management Guidebook and updating project records in ITSM.\nProject technology, technical scope, solution design, technical architecture and documentation. \nInfrastructure Technology \nCloud, UCS, WMware virtual environments, Active directory, DNS, group policy, Microsoft Windows, Unix, \nCitrix, SAN, server maintenance and management, physical and virtual server solutions and \nconfiguration in VMware, Microsoft Server support, data center management and delivery. \nNetwork Technology \nSolution, design and deployment of WAN & LAN Enterprise Networks, wireless networks, procurement installation, \ntesting and operations and support of enterprise networks, high speed fiber, TCPIP, Cisco Routers, F5 Big IP routers, \nload balancers, switches, hubs, firewalls, intrusion detection devices (IDS). \nEnterprise Applications\nMS Office - Excel, Word, Access, MS Project, Visio & Project, AutoCAD, Visual Basic, Adobe, Remedy IMS, and \nService Station, VMware.\n\nProfessional Experience:\n\nNew York State ITS – DA Cluster, Schenectady, NY    \t\t\t\t        September 2016 – Present\nProject Manager\nManaged migration of servers from 500 Balltown Road data center to the new data center at CNSE. Managed the project from the scope of the effort, project initiation, planning, execution, monitoring & controlling, site inventory and labeling methodology, identification of application downtime tolerance, application replication strategy, data backup verifications, third-party vendor management, site preparation, move-day logistics, to site operation verification. \nManage NYConnects and Certified Residential Opportunities (CRO) Database projects.\nDaily update of project records in MS Project and ITSM. \nConsulted and negotiated with internal customers, suppliers and vendors.\nDevelop change management plan and utilizing the change management to control project change requests and other changes such as those changes that do not affect project triple constraints. \nDeveloped detailed scope statements, and document project requirements for data center consolidation project, NYConnects and CRO projects by eliciting business goals, information needs, and relative priorities from end users, subject experts and others.\nDevelop project plan, scope management plan, schedule management plan, cost management plan, communications plan, change management plan, risk management plan, and stakeholder management plan. \nDirect and manage project work, perform quality assurance, acquire project team, develop project team, and manage project team. Also, manage communications and stakeholder engagement. \nManaging, facilitating, and reporting status of Data Center Consolidation, NYConnects, and CRO projects.\nDevelop project schedules, including identifying and scheduling project deliverables, milestones and required tasks, using MS project plan as the scheduling software. \nDocument and present resource needs to Disabilities and Aging (DA) Cluster ITS management and coordinate project activities within program areas.\nVerified weekly change requests (CR's) and other maintenance items rolling to production and discussed them on the next sprint planning session. \nUtilizing JIRA to create projects with specified workflows, screens, permissions and fields for different teams.\nGenerating metrics and reports using HP Quality Center (QC) to help the team understand project’s health and progress and to set goals.\nUsing HP QC to create projects, configured board, set up access and permissions, created dashboards and filters for easy status visualization.\nUsed HP QC to plan, track and report issues and tasks on projects.\nIdentify risks and their potential impact on each project; manage contract relationships.\nProvide recommendations and make decisions on changes in the project schedule.\nPlan and conduct project analysis sessions, such as JADs, requirements analysis, and project close-out.\nDevelop and document project management artifacts such as Business Case, Charter and Scope Documents, Communication Plans, Project Schedules, etc. \nEnvironment: JAVA, Oracle, Quality Center 9.0, MS Access, TABS. \n\nMicrosoft Corporation, Redmond, WA                                      \t\t\t             November 2014 – August 2016\nSr. Project Manager\nMicrosoft Corporation is an American multinational technology company headquartered in Redmond, Washington, that develops, manufactures, licenses, supports and sells computer software, consumer electronics and personal computers and services.\n\nResponsibilities: \nResponsible for delivering projects against agreed scope, budget, schedule & customer expectations. \nSupervised, directed, and motivated teams of multi-discipline contractors and employees.\nParticipated in reviewing Business Requirement Documents (BRD) and writing test plans, test scenarios and test cases to ensure that each deliverable is based on the details outlined in the BRD\nOrganized, participated, and led project meetings, daily review meetings, and initiated conference calls to discuss issues originated while testing.\nPrepared SOW and conducted the vendor selection process for the setup of the company's network, servers and workstations\nDeveloped change management plan and utilized the change management to control project change requests and other changes such as those changes that do not affect project triple constraints \nUsed TFS to plan, track and report issues and tasks on a predefined workflow.\nTracked, reviewed, analyzed and compared defects using Quality Center.\nMonitoring project risks and scope creep to identify potential problems and proactively identifying solutions to address them in advance.\nDeveloped program level release plan, & developed project plans\nDeveloped detailed scope statements, and documented project requirements for complex projects by eliciting business goals, information needs, and relative priorities from end users and subject experts\nEscalating promptly any issues that may impact operations.\nManaged project risks using MS Projects\nProducing stage plans, highlight reports, risk logs, requests for change etc\nProviding strategic direction during the implementation stages.\nPrepared economic justification for projects, reviewed scope documents with the project managers to define and develop the design basis and scope of work for projects\nManaging client expectations by ensuring the delivery of the highest quality service\nPerformed User Acceptance Testing (UAT)\nActing on client feedback.\nMonitoring staff & team performance.\nEnvironment: SAP ERP 6.0, Java, Quick Test Professional 10.0, Frog logic Squish, Quality Center 9.0, TFS, MTM. \n\nVerizon Communications, Inc., San Jose, CA                \t\t\t           December 2012 –  October 2014\nProject Manager\nVerizon Communications is an American broadband telecommunications company and the largest U.S. wireless communications service provider as of September 2014\n\nResponsibilities:\nAnalyzed Business Requirements Document (BRD), Functional Specifications Document (FSD), and Use Cases, prepared Test Strategy and Test plan for UAT testing\nInteracted with Functional and Technical Leads/Developers for understanding the requirements. \nInvolved in task creation, task estimation, task distribution, task prioritization and communication among Onsite and Offshore Team Members.\nAccountable for managing large, cross-functional infrastructure projects. \nDesigned, managed, and delivered effective change management plan for changes impacting the project\nDeveloped metrics and reports using JIRA to help the team understand its health and progress and to set goals.\nUsed JIRA to create projects, configured board, set up access and permissions, created dashboards and filters for easy status visualization.\nUsed JIRA to plan, track and report issues and tasks on a predefined workflow.\nResponsible for initiating, planning, executing, controlling and closing multiple large technical projects that address the operational needs of multiple departments to drive and deliver specified requirements, budgets, quality assurance, risk management, vendor management, customer management, supplier involvement throughout the project lifecycle. \nFacilitated strategic planning with internal customers for deployment of infrastructure services and products. Proactively communicate with, inform and influence others to achieve success for assigned projects and programs. \nManaged, defined and coordinated project scope and objectives to development teams, Developed project plans and design objectives and project timelines. \nDeveloped and deliver presentations to management, senior leadership and other stakeholders.\nMaintain timely and accurate documentation in support of project analysis and daily operations. \nOversee the migration and implementation of tier 1 enterprise data center. \nProject Manager for the implementation of over 1300 applications and hardware. \nAdministered and maintained customer expectations through the project lifecycle and ensured PMO best practices and methodologies that all projects meet established standards.\nInvolved in all standards ERP SDLC activities for Functional Testing, System Integration Testing, User Acceptance Testing, Preparation of Training material, and conducting actual User testing\nPublished daily, weekly, and manual status to show the progress of the manual testing effort.\n\nHughes Network Systems, Germantown, MD               \t\t\t       September 2008 – December 2012\nProject Manager\nHughes is the world’s leading provider of broadband satellite services, products, and managed network solutions.\n\nResponsibilities:\nParticipated in the analysis of Business Requirement Document (BRD) and documenting Business Use Cases \nParticipated in the work-scope meetings and peer review meetings to evaluate Use Cases with Business and Design team \nManaged teams of 10 SAP Analysts, 5 SAP Developers, 5 QA Testers, and network and Infrastructure engineers. \nCreated project planning artifacts and adhered to the artifacts during project execution, monitoring & controlling, and close out. The artifacts included but not limited to project management plan, schedule management plan, cost management plan, risk management plan, scope management plan, change management plan, etc. \nRegulated operational issues and Infrastructure projects including capacity and resource planning. \nUsed Land Desk Service desk for ticketing. \nMigrated other subsidiaries into a single help desk organization. \nEstablished a global enterprise IT infrastructure strategy moving forward. \nUtilized MS Project, Word, PowerPoint, Visio, Excel.\nMember of the Change Approval Board for all operational changes to the environment. \nEstablish and structure Portfolio projects and resources. \nManaged all PMO organization activities, ie. Funding, prioritization and kicked off for implementation. \nOversaw infrastructure environment consisting of 12 offices on the mainland and Hawaii. \nInitiated projects of entire infrastructure upgrade from Windows active directory 2003 to active directory 2012. \nBuilt out Business continuity and disaster recovery network. \nManage the integration of multiple networks to provide a single global network infrastructure for the company. \nTrain and mentor young engineers who want to pursue a career in management and project management.\nCreated test cases, test scenarios in HP Quality Center and ensured traceability to Business Use Cases and according to the application. \nStepped in when requirements were not moving forward and mentored analysts on documentation, facilitation and agile processes.\nOrganized and attended daily, weekly, and monthly status meeting provided daily, weekly, and monthly reports that included project metrics and existing, prior, and future status reports. \nPrepared status reports and maintained data of all tests conducted on systems.\n\n\n\n\n",
    "extracted_skills": [
        "agile",
        "aws",
        "azure",
        "communication",
        "java",
        "jira",
        "leadership",
        "oracle",
        "project management",
        "scrum"
    ]
}