{
    "id": "resume_b2985fde-06c5-43ca-bbf2-23234689a44d",
    "metadata": {
        "filename": "Prashant Chawda_resume.docx",
        "processed_date": "2025-09-24T08:45:47.498868+00:00"
    },
    "raw_text": "Prashant Chawda, PMP, CSM\nMobile: +1-770 456 5746\nnagaraju@paramountsoft.net \nSenior Project Manager\nProfessional Experience:\nAround 19 years of industry experience in various functions of software includes program management, extensive customer support/stakeholder management skills with strong technical acumen. \nResult-driven PMI certified professional and Certified ScurmMaster with 10 yrs of extensive project management experience and proven track record in increasing productivity, quality and customer satisfaction.\nA passion for excellence and a tenacious leader for results is a key attribute.           \nCore competencies include:\n\n\nTechnical Skills:\n\n\nEducation:\n\nBusiness Administration \t\t\t\t\t\t\t\t\t      2007 - 2008\nIndian Institute of Management, Calcutta (IIM-C) \n\nBachelor of Engineering (Electronics & Instrumentation), \t\t\t\t\t\t\t    1995\nGulbarga University  \n\nTrained on Scaled Agile Framework (SAFe)\t\t \t\t\t\t\t\t    2015\n\nBSI ISMS Auditor training \t\t\t\t\t\t\t\t\t\t    2012\n\nCertifications:\n\nCertified Scrum Master from Scrum Alliance (CSM) - 2015\nCertified Project Management Professional from PMI institute (PMP) - 2005\nCertified Project Management Professional from Brainbench certification body - 2005\nTavant Management Team: Individual Excellence Award for ‘Accountability and Execution’ – 2006 & 2009\nCertificate of Appreciation for Outstanding delivery from client (NACCO) - 2014\nCertificate of Appreciation for Outstanding Performance at First Indian Corporation (now CTS) - 2005\nCertified BSI 27001:2005 Information Security Management System Internal Auditor - 2012\n\nProfessional Affiliation:\n\nMember, Project Management Institute (US).\n\nExperience Summary:\n\nFirst Guaranty Mortgage Corporation\t\t\t\t\t\t\t            Jun16 - Present\nSenior Program Manager\n\nResponsibilities:                                    \nExcellent stakeholder management skills with a shared vision, consensus building and customer relationship through constant & proactive engagement to maximize business objectives. \nEnhance team’s delivery capability by monitoring their work and providing guidance in understanding the requirements and resolving issues.\nFocus on value delivered to the customer and constantly work with client facing counterparts. \nModerated meetings at client side with various stakeholders participating. \nEncourage a work culture to build self-driven teams to pro-actively share, load and constantly support each other in day-to-day activities.\nFollowed Agile process by task allocation/management using Microsoft Team Foundation Server, sprint capacity planning and creating burn-down chart to facilitate planning of the sprints. \nConducted demos after every sprint and retrospective meeting as continuous improvement.\nIdentifying risks / issues and building mitigation / contingency plan.\nMonitor and report project progress by: Meeting business requirements, making deliveries as planned, Identifying and managing project risks / Issues.\n\nACT, NACCO Materials Handling\t\t\t\t\t\t\t\tSep12 – May16\nSenior Project Manager,            \n\nResponsibilities:                                                                           \nManaged multiyear, multimillion, high visibility, large and complex application project spanning across different countries (US, EMEA, Canada)\nHandled large fixed bid account involving multiple large fixed bid projects executed in parallel includes new implementation, maintenance projects, development of 120 analytical reports on Cognos platform\nManaged project managers with peak team size of 60+ team members\nInvolved in defining product roadmap for growing account and practice\nP & L management to keep cost under control and executed on all SLA metrics \nGrew the revenue from $0.5M to $4M+ in a span of 2 yrs by developing strong customer relationship and help reduce sales cycle for the new projects\n\nAccomplishments: \nAdapted automation to reduce headcount thus resulting in cost saving of $150K over an year.\nAdapted innovative means of product development by developing tool to validate data for data migration process reducing turnaround time from 15 days to 8 days thus increasing productivity.\nMargin expansion done by delivering CR’s worth $300K over 1.5 yrs thus increasing overall margin for one of the projects.\n\nAwards:\nCertificate of Appreciation from Customer for outstanding delivery.\n\nTavant Technologies, Bengaluru  \t\t\t\t\t\t\t             Jan10 – Aug12\nSenior Project Manager,                                                    \nClients: Wolters Kluwer Financial Services, Land ‘O’Lakes, Ingersoll Rand, HSP\n\nResponsibilities:                                                                           \nResponsible for handling multiple customers for various accounts\nProgram execution of a cluster of 12 projects by managing teams onsite and offshore\nArchitected technical/ commercial proposals / RFP by teaming up with Practice director.\nCreated / reviewed / modified SOW’s / proposals for customer approval / signoff.\nSuccessfully delivered various mobiles projects for Android and  IOS applications using various technologies like Objective C, Titanium framework (Appcelerator), Sencha 2.0\nHandled mobile development projects designed for both iPhone and iPad \nDelivered solutions using various technologies like Microsoft based technologies, Java/J2EE, mobile technologies and host of other proprietary tools and technologies to various clients in various domains.\n\nAccomplishments:\nKey team member to execute the project management processes on the lines of PMI across the organization. Mentored emerging new managers\nPioneered new practices to increase organizational execution\n\nTavant Technologies, Bengaluru\t\t\t\t\t\t\t              Jan07 – Dec09\nProject Manager,                                                                  \n\nResponsibilities:                                                                           \nHandled complex projects through their entire lifecycle \nIdentified and helped deploy open source tools for cost optimization resulting in 90% reduction in licensing cost\nInvolved in customer presentation/demos during customer visits for new prospective clients.\nAgile process was followed for managing / allocating tasks using JIRA tool, used sprint capacity planning and burn-down chart to manage sprints. \nEnsure 100% compliance of the SEPG processes\nAccomplishments:\nResponsible for setting up the account from scratch starting with one project and then grew the account to 7 projects in a span of 1 yr by successful deliveries resulting in being promoted to next level\nAwards:\nTavant Management Individual Excellence Award for ‘Accountability and Execution’ – 2009.\n\nTavant Technologies, Bengaluru\t\t\t\t\t\t\t             Nov05 – Dec06\nAssociate Project Manager,                                               ,   \n\nResponsibilities:                                                                           \nResponsible for complete end to end delivery of the projects, that includes,\nScoping, planning, scheduling, tracking and status reporting.\nEstimation and budgeting, change management, metrics collection.\nIdentifying risks / issues and building mitigation / contingency plan.\nApplication process review audits and configuration audits.\nLead the team through a challenging project, handling HR issues and conflicts in the process \n\nAccomplishments:\nWas one of the highest CSAT and ESAT rated managers in the organization.\nSuccessful releases of projects resulted in a satisfied customer which in turn resulted in customer providing me an opportunity to handle additional projects for the same account.\nAwards:\nTavant Management Individual Excellence Award for ‘Accountability and Execution’ – 2006.\n\nFirst Indian Corporation, B’lore (Now part of CTS),  \t\t\t\t\t             Mar04 – Sep05\t\nTeam Lead, \t                             \n\nResponsibilities:                                                                           \nWorked in supervisory role as technical lead for team, point of contact for both offshore and onshore teams.\nLead multiple teams in the areas of ,\nApplication development, UI automation and Quality assurance\nAccomplishments:\nIncreased project revenue through customer satisfaction, developed management skills and enhanced technical leadership\nAwards:\nCertificate of Appreciation for Outstanding Performance.\n\nIBM Global Services India Ltd, B’lore,  \t\t\t\t\t\t\t Oct02 – Mar04\nSenior Software Engineer\n                              \nRequirements management, design document and application development \nAdherence to SLAs in providing 24/7 production support, hot fixes with bonus/penalty implications.\nAssign and track tasks, plan delivery schedules and code releases to production. \n\nMisys, B’lore\t\t\t\t\t\t\t\t\t\t\t  Jul01 – Oct02\nSoftware Engineer, \t\t\t                 \t                     ,  \nApplication development using Java/J2EE technologies, Servlets with iPlanet App. Server, JBoss\n\nHCL InfoSystems Ltd, Chennai,  \t\t\t\t\t\t                         Sept00 – Jun01\nConsultant,\nApplication development using Java/J2EE technologies with weblogic App. server\n\nPentasoft Technologies Ltd, Chennai,  \t             Jan97 – Aug00                       \nAssistant Consultant,\t                        \nApplication web development using technologies like Java, Servlets, JavaScript and HTML \nApplication development using COBOL, IBM Mainframe technologies on ES/9000, S/390\n\n\n",
    "extracted_skills": [
        "agile",
        "html",
        "java",
        "javascript",
        "jira",
        "leadership",
        "project management",
        "scrum"
    ]
}