{
    "id": "resume_e8b19a70-1d6d-49be-b349-8f162a4cd0ad",
    "metadata": {
        "filename": "Raja Santhosam_PM Scrum Master.DOCX",
        "processed_date": "2025-09-24T08:45:48.119667+00:00"
    },
    "raw_text": "\n\n\t\t            \t\n                 RAJA SANTHOSAM\n===============================================================================================                  \nPROFESSIONAL SUMMARY:\nDynamic, result oriented technical Certified Scrum Master®, Product Owner® & Lean Six Sigma Green belt with 13 years of software experience in Business Analysis, Data Warehousing, Business Intelligence and Project Management in Investment banking, Trading, Treasury services, Wealth management and Risk management\nAcquainted with processes related to Requirement elicitation, Business & system analysis, Application Documentation & development and Software project planning, execution & monitoring.\nServed as Agile coach for business and software delivery teams, trained individuals to adhere to Scrum principles, guided the teams to transition from Waterfall to Agile methodology.\nTrained on  principles of Scaled Agile Framework (SAFe)\nExtensive experience in developing Business Requirement Documents (BRD), FRD), Software Requirements Specification (SRS), Requirements Traceability Matrix (RTM).\nProficient in developing Business Process Flows, graphical depictions of Use Cases including Use Case diagrams, Activity diagrams, Sequence diagrams, Class diagrams and Collaboration diagrams.\nStrong communication skills in engaging Project Sponsors, Business stakeholders, subject matter experts and Business Users in gathering the intricate workings of business processes.\nPerforming extensive analysis on all the LOBs reporting applications to design a tool that supports all of them\nInvolved in development, testing, and supporting of business intelligence, analysis and reporting solutions\nCollaborating with the visual graphics team to design site maps, process flow diagrams, wireframes, prototypes\nWorking closely with the project sponsors, business users and acted as a liaison between the business user groups and the functional, Technical, QA and Support teams\nAssisting the development team in understanding the functional and technical requirements and do the development as per the requirements\nWorking with the QA team to help them understand all the requirements and assisting them in developing QA test cases\nProviding periodic status reports to the stake holders, updating them with the current status of the project and highlight any issues or risks\nPerforming BA functional testing after the development to make sure the functionalities were developed as required and data consistency and accuracy are maintained\nWorking with project team members, clients and vendors to coordinate activities, provisioning, environment setup, installation, and integration testing\nCoordinating development and testing activities while making sure the deliverables confirm to requirements\nAllocating resources to various departments and managers as per their needs and requirements\n\nEDUCATIONAL QUALIFICATION:\n\nMaster of Business Administration (HR & Marketing), 2007-09, Anna University, Chennai, India.\nBachelor of Engineering (Electronics & Communication), 2000-04, University of Madras, Chennai, India.\nCertified Scrum Master® from Scrum Alliance License No: 000491155\nCertified Scrum Product Owner® from Scrum Alliance License No: 000491155\nCertified Lean Six Sigma Green Belt from IASSC License No: GR766001071RS\nTrained on PMP and planning to take up the exam tentatively by Jan 2018\n\n\nTECHNICAL SKILLS: \n\n\n            \n PROFESSIONAL EXPERIENCE:\n                   \n\n                   Mphasis Corp.                                                                                                                 July 2017 - Current\n                   Client: JPMorgan & Chase – Edison NJ\n                   Role: Project Manager\n\n                            Project Description: \n      Resiliency Data Management System will enable firm to gain greater insight into areas impacted at the time of disruption and the ability to manage the resiliency proactively across the organization from a single vantage point. The element business impact analysis, business plans, application plans and their components including the recovery scenarios are managed in RDMS enables relational comparisons of data across modules through analysis and reporting.\n\n      Roles and Responsibilities:\nCreate, maintain and update Project Plans using MS Project\nCoordinate with Development team and Business users to track milestones\nEnsuring completion of activities by the internal teams, as assigned\nParticipate in Internal UAT Testing and guide the testing team in identifying and report the defects\nParticipate in preparing UAT Test Cases and UAT Test Scenarios\nGenerating reports and dashboards as requested by the Business Users and Senior Management\n\n                  \n\n                   Sigma Info solutions Inc - Irvine, CA                                                                       March 2017 - May 2017\n                   Role: Senior Scrum Master / Project Manager\n                   \nRoles and Responsibilities:\nAct as client facing liaison and maintain customer management\nManaging large divisions, major projects, important initiatives, handling software development and related activities\nInitiating the design, development and implementation of service levels required to increase customer satisfaction and resolve business process issues for the identified customers\nEnsure build phase of projects are delivered on time with high quality and within the allocated budget\nProvide management reports on assigned customers / projects.\nWork closely with the business development team to gather and analyze data for sales forecasting, project planning and tracking using tools and reports\nEnsuring completion of activities by the internal teams, as assigned\nManage backlog for multiple projects\nInteracting with clients for status updates\nResearching and preparing presentations for clients and internal teams\nWork with Executive team to develop dashboards focused on key performance indicators\nDrive high level of awareness about process and tools amongst the teams/company\nEnsures that customer complaints are identified, recorded and dealt with in an appropriate manner\nMaintain customer relationships and ensures client satisfaction\nResponsible for team development including ongoing training, skill building, deployment, retention and career growth\n\n                   \n\n                   TRN Systems Inc                                                                                                         May 2016 - Feb 2017\n                   Client: Bank of New York Mellon - Jersey City, NJ\n                   Role: Senior Scrum Master\n            \n            Bank of New York Mellon – Jersey City, NJ                                                          April 2012 - April 2016\n     Role: Scrum Master / Lead Business Analyst\n\nProject Description: \n       The Purpose of the Project is to create a Warehousing solution for Broker Dealer Services of Bank of New York Mellon on Oracle Platform using Informatica ETL Tool. This project aims at consolidating the information from the various Legacy Systems Repo, GSCX and MCS which are running on Sybase, Mainframes and SQL Servers onto the Oracle Warehousing platform. It also involves creating an ETL Frame work for the Automation of ETL Jobs, Data Reconciliation between the Source and Target Systems and Alerting Mechanism.\n\nRoles and Responsibilities:\nAs a Scrum Master, performed the day to day activities in delivering the Project.\nRequirement analysis, design and Development of ETL mappings and Processes on Informatica Power Center and UNIX.\nWorked with business analysts to identify the appropriate data elements for required capabilities.\nPerforming gap analysis between the current state and future for the business processes, data warehouse and Business Intelligence/Reporting environment. \nDocumenting the requirements in Business Requirement Document (BRD) and converted them to Functional and Software Requirement Documents (FRD) and Software Requirement Document (SRS) to user stories for the understanding of the development team. \nServed as Agile coach for business and software delivery teams; trained individuals to adhere to Scrum principles.\nAssisted the Product Owner in compiling and prioritizing the Product Backlog on JIRA using prioritization technique MOSCOW. \nFacilitated all the Sprint Ceremonies: Backlog Refinement / Grooming, Sprint Planning, Daily SCRUM, and Sprint Review / Retrospective. \nTime boxed Daily SCRUM meetings and resolved all impediments faced by development team. \nBuilt and coached high performing development teams leveraging data, coaching individuals and reinforcing Agile Manifesto.\nMentored and coached the team grow into a self-managing entity. Encouraged collaboration between the SCRUM team and product owner. \nMaintained and monitored SCRUM Artifacts-Sprint Backlog, Sprint Tasks, and Sprint Burndown Charts using JIRA.\nExtensively worked with multiple cross functional and distributed teams on Scrum of Scrums.\nAnalyzed and understood the business users' requirements for information and communicated them to the rest of the data warehouse team. Assisted Data Warehouse Data Analyst in analyzing existing reports. \n Extensively worked in Data Requirement Analysis and Data Mapping for ETL process. Acted as consultant to the ETL and front-end programmers. \nAnalyzed the existing reports of the reporting system in the database. Checked the consistency of the data after ETL process using RDMS Microsoft SQL server queries for documenting and retrieving data from database. \nThe project involved developing mappings for moving data from heterogeneous sources to Staging Area (STG) and then to Data Warehouse (DWH) \nPrepared Test Plans for Unit test and System Integrated testing of Informatica Session and Workflows.\nCreating the deployment documents and migrating the code to the production environment.\nInvestigating and fixing the bugs occurred in the production environment and providing the on-call support\nGenerating the Reports and Dash Boards using Tableau for the Business Users and Senior Management.\n\nEnvironment: Informatica Power Center 9.1/8.6, UNIX, Oracle 11g, SQL, PL/SQL, SQL Developer, Metadata Manager, Oracle Designer, MS VISIO, JIRA, IBM Mainframe\n\n\n\nBank of New York Mellon - Chennai, India                                                               Jan 2010 - April 2012\nRole: Scrum Master / Lead Business Analyst\n\nProject Description:\n\n      This Migration project is initiated to enhance the Pershing’s Ability to meet the regulatory requirements set by US Regulatory. This Project aims at migrating the existing Pershing Applications which were running in Oracle to New BI platform Teradata for high performance and scalability. This EDW serves all the Reporting needs of Pershing Internal andExternalCustomerswith6YearsofData. \n\nRoles and Responsibilities:\nInvolved in all the phases of the SDLC requirement gathering, design, development, Unit testing, UAT, Production roll-out, enhancements and Production support.\nInteracting with the business representatives to understand the requirements and determine the best approach for timely delivery of information. \nEnsuring timely deliveries of work items to the Client.\nInvolved in Implementing ETL standards and Best practices.\nReview of Data Model and validating its feasibility to physical implementation.\nAssisted the Product Owner in compiling and prioritizing the Product Backlog on JIRA using prioritization technique MOSCOW. \nFacilitated all the Sprint Ceremonies: Backlog Refinement, Sprint Planning, Daily SCRUM, and Sprint Review. \n Time boxed Daily SCRUM meetings and resolved all impediments faced by development team. \n Mentored and coached the team grow into a self-managing entity. Encouraged collaboration between the SCRUM team and product owner. \nMaintained and monitored SCRUM Artifacts-Sprint Backlog, Sprint Tasks, and Sprint Burndown Charts using JIRA.\nAnalyzed and understood the business users' requirements for information and communicated them to the rest of the data warehouse team. Assisted Data Warehouse Data analyst in analyzing existing reports. \nExtensively worked in Data Requirement Analysis and Data Mapping for ETL process. Acted as consultant to the ETL and front-end programmers\nCo-ordinate with the QA team in various testing phases by resolving the defects and ensuring smooth execution of the test plans.\nCreating the deployment documents and migrating the code to the production environment.\nInvestigating and fixing the bugs occurred in the production environment and providing the on-call support\nGenerating the Reports and Dash Boards using Tableau for the Business Users and Senior Management.\n\nEnvironment: Informatica Power Center 9.1/8.6, UNIX, Oracle 11g, SQL, PL/SQL, SQL Developer, Metadata Manager, Oracle Designer, MS VISIO, JIRA, IBM Mainframe.  \n            \n            \n\n              Wipro (AT&T) – Chennai, India                                                                                May 2004- Dec 2009\nRole: Technical Lead\n\nRoles & Responsibilities:\nSupport mission critical production application responsible for enterprise wide pricing of products\nProvided application support for all production issues in the MDS (Market Data Service) environment from initial client contact through to resolution \nPlanning, coordination and execution of production deployments, system upgrades and emergency bug fixes \nReduced client disruptions through prioritization of production impacting issues and by providing root cause analysis to identify and prevent similar issues in the future \nBuild and maintain relationships with clients to become their first point of contact when they are in need of assistance \nManaging daily production data warehouse administration, troubleshoot and resolve highly complex application and data load production problems, managing user access to the Teradata database and Business Objects account and universe, 24x7 on-call rotation, project implementation and planning. Delivered exceptional 24x7 on-call rotation; supporting applications, extracts, control-M data batch load to various activities owned by the Data Warehouse production environment\nManaged off-shore/on-shore model multicultural team environments, providing support / guidance to the development teams during the analysis, design, development, and testing processes and deployment of project\nPerformed On-Call rotation including weekend support for releases, upgrades, Disaster Recovery (DR), Quarterly Maintenance Windows (QMW) tests and related activities\nDocument and improve new and existing processes and procedures for global team in order to comply with internal and external regulations\n\nEnvironment: Informatica Power Center 7.1.4, Teradata, PL/SQL, Oracle 9i, SQL Server, MS-Access, Windows XP/2000\n\nREFERENCE: \nAvailable on Request. \n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "jira",
        "microsoft sql server",
        "oracle",
        "project management",
        "scrum",
        "sql",
        "tableau"
    ]
}