{
    "id": "resume_1844dbec-f26a-4cb4-8bd7-a4440632403a",
    "metadata": {
        "filename": "Rajesh_k.docx",
        "processed_date": "2025-09-24T08:45:48.294663+00:00"
    },
    "raw_text": "\nRajesh k.\nPHP Developer\n\nDallas, TX 75201\n\nitconsultant2897_kop@indeedemail.com - 602 507 7891\n\n\nWORK EXPERIENCE\n\nSr Software Engineer\n\nCloud4c Services Pvt Ltd -\n\n2014-08 - 2017-07\n\nCloud4C is a global Managed cloud services provider with presence in 15+ countries across Globe. Worked as Sr Software Engineer involved in two full life cycle projects and couple of maintenance projects.\n\nDeveloped on-demand cloud computing platform which allows the individuals, companies to create and manage cloud instance. Integrated Hyper-V, Vmware API's to automate the cloud instance operations. Developed scheduler module which will allow users to schedule the instance up-time on daily basis.\n\nGathered requirements from the product owners and managed team- worked as a team coordinator, along with development.\n\nDeveloped Virtual machine utilization and status report and notify concerned department in predefined time intervals.\n\nDeveloped monthly, quarterly and annual Net & Gross sales reports and scheduled cron jobs to generate and list them in the application.\n\nDeveloped internal portal using QRADAR rest api's. This will provide ease of access to team in tracking and filtering the offenses/events based on domain. Provide customer specific offense summary report.\n\nDeveloped customer specific asset management portal using Laravel framework.\n\nCollaborated with the team by involving in daily scrum calls and weekly meetings in agile environment.\n\nPerforming Code Review and handling SVN code repository.\n\nWindows, Linux, PHP, MySql, PostgreSql, Apache, Codeigniter, Laravel, Slim Framework, JavaScript, HTML, Bootstrap, JQuery, AngularJS, Angular 2, GIT\n\nSr Software Engineer\n\nExpos2 Inc\t-\tTalent, OR -\n\n2011-04 - 2014-08\n\nExpos2 Inc provides virtual expos management platform. Expos2 began producing physical conventions over 25 years ago and focused this industry experience on its virtual platform in 2005. Worked as Sr Software Engineer involved in two full life cycle projects and migration 20 years old physical expos application to PHP based application.\n\nDeveloped and involved in all stages of physical and virtual expos software's.\n\nKey role in live event support and resolving issues during the live event\n\nIntegrated Adobe Connect and WebEx meeting APIs.\n\nDeveloped Rest API's for the Flash and flex based UI versions of virtual expos.\n\n\nInitiated migrating complete application to Codeigniter Framework to make code more manageable and ease to develop new modules.\n\nWorked for existing customer support management application developed using symfony.\n\nWritten PHPUnit scripts for testing quality of programs.\n\nIntegrated PayPal and Google Checkout payment gateways.\n\nActed as build master for our GIT repository management, and managed bi-weekly scrums which include tracking each team member's tasks.\n\nMac OSx, PHP, MySql, Apache, Codeigniter, Symfony, HTML, CSS, JavaScript, JQuery\n\nSoftware Engineer\n\nOpen Origin IT Solutions Pvt Ltd -\n\n2006-11 - 2011-03\n\nOpen Origin is software service providing company. Worked as Software Engineer and Involved in two full life cycle software development.\n\nDeveloped web based Oil marketing platform, which is marketplace to buy and sell heating oil in real-time.\n\nInvolved in Function Requirements preparation and gathering requirements from business team members.\n\nDeveloped online shopping application by customizing the open source OSCommerce application.\n\nIntegrated Authorize.net payment gateway.\n\nDeployed and customized WordPress application.\n\nDeveloped various automation jobs in PHP, to pull data from different systems and dump them into MYSQL database which allows the further analysis of data and generate reports.\n\nWindows, PHP, MySql, Apache, Wordpress, OSCommerce, HTML, CSS, JavaScript\n\n\nEDUCATION\n\nBachelor's Degree in Electronics and communications in engineering\n\nJNTU\n\n2005\n\n\nSKILLS\n\nCSS, HTML, JavaScript, MySql, PHP\n\n\nADDITIONAL INFORMATION\n\nTechnical Skills\n\nProgramming PHP 4, PHP 5, PHP 7, Java Script, Shell Scripting Databases MySQL, MSSQL, PostgreSQL, SQLite\n\nMVC Frameworks & CMS PHP: CodeIgniter, Laravel, YII, Zend Framework, CakePHP, Wordpress, Drupal, Smarty Template Engine.\n\nWeb Technologies HTML, CSS, JavaScript, AngularJs, AJAX, JQuery, Bootstrap, NGINX, UNIX, JSON, XML, YAML, XSLT, Web Services (SOAP, RESTful)\n\n\nIDE's & Version Control Systems NetBeans, Sublime, Eclipse; SVC, CVS, GIT, GitHub Payment & Third Party API's authorize.net, Google Checkout, Paypal\n\nOperating Systems & Cloud Windows, Macintosh, UNIX, LINUX, Google Cloud, AWS\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "css",
        "git",
        "google cloud",
        "html",
        "java",
        "javascript",
        "mysql",
        "php",
        "postgresql",
        "rest api",
        "scrum",
        "sqlite"
    ]
}