{
    "id": "resume_66df2326-30a9-4617-b736-1f1c21f0e440",
    "metadata": {
        "filename": "Ramteja Motupalli.docx",
        "processed_date": "2025-09-24T08:45:48.846125+00:00"
    },
    "raw_text": "--------------------------------------------------------------------------------------------------------------------------------------\n\n\n8+ Years of experience in Business Analytics and Operational experience in Enterprise Application, Banking, Health Insurance Management and Healthcare Management.\nProficient in using Waterfall & Agile Scrum Methodologies in performing the roles as a BA and Scrum Master.\nExperience in Project Management activities of planning, scoping, monitor and control using tools such as Rally, JIRA, SharePoint and HP ALM-QC for requirements management and change management processes\nThorough understanding and implementation of Agile and Waterfall methodologies, and Lean Six Sigma implementation techniques\nEnterprise application deployed as SaaS.\nKnowledge on IBM info sphere for Master Data Management.\nProficient generating and reviewing system process flows and sequence diagrams\nPlanned sprint/standup sessions, retrospective, maintain backlogs and sprint grooming/review sessions.\nFacilitated requirements elicitation sessions to ensure comprehensive collection of requirements with stakeholders\nExpertise in identifying, developing and documenting Business and Functional Requirements Specifications (FRS), User Stories, User Requirements Specification, System Requirements Specifications (SRS), Non-functional requirements and Supplementary Specifications\nContact Center or Call Center technology experience with IVR.\nStrong understanding of Interactive Voice Response (IVR), Computer telephony integration (CTI), Automatic Call Distributor (ACD), call routing and queuing, Softphone and call analytics and reporting platforms.\nConducted interviews, workshops and requirement elicitation sessions with end-users, clients, stakeholders, development groups and Subject Matter Experts (SMEs)\nWork with both the Robotic Process Automation (RPA) Lead Analyst and the customer to define automation requirements\nExperience in portfolio of applications that support major technology programs and the built out of contemporary applications. These applications are focused on telephony, voice analytics, application/phone integration, soft phone, web services and UI development.\nPerformed Enterprise level Business Impact Analysis (BIA) to identify critical business continuity action plans and the related infrastructure interdependencies, single points of failure, and formulated recovery strategies\nKnowledge utilizing Oracle OSS/BSS platforms preferable\nActed as a Scrum Master for multiple teams to create Sprint Backlog, organized Sprint planning meeting, Daily Sprint Meeting, Sprint review meeting and Sprint retrospective meeting.\nComfortable generating high and low-level system architecture diagrams and design documentation\nActed as a SME/BA for Mobile Web and Apps (iOS, Android and Tablets) for retail and flight operations \nHands-on experience with Web-services for data validations, input parameter validations, assertions on Json and XML files\nAbility to identify system and business process gaps and inefficiencies and provide solution workarounds, as well as business process enhancements to resolve those inefficiencies\nExperience with Web-services testing SOAP, WSDL and Restful web services\nExperience in Micro Service in Enterprise Application. \nExperienced in creating graphical representations of complex business processes\nAided in testing efforts to ensure that test plans and test cases were developed and that requirements trace to tests\nHave worked on backend databases for validating date in MS SQL server and Oracle\nWell-versed with test planning, and test execution including defect tracking/reporting\nArticulate difficult concepts through clear and concise verbal and written communication\nSkilled in conducting Risk analysis, GAP analysis, JAD sessions, User Acceptance Testing (UAT), Root Cause analysis, and Fish Bone analysis.\nKnowledge on PCI DSS for transactions.\nKnowledge of integrated, global call center technologies to support IVR, CRM, CTI integration and skills-based routing in a Customer Interaction Platform environment\nDefined and executed IVR, Chat, and Email channel solutions from concept to rollout. Measured results and enhanced to improve customer and shareholder metrics\nPrior experience in research, writing, literature reviews, office management, employee recruitment, and training\nMaintained cooperative and a productive work relationship across business functional areas to resolve issues and identified notable members for a project team\n\nTechnical Skills:\n\n\n\nCertifications:\n\nCertified Scrum Master from International Scrum Institute (SMAC)\nBusiness Process Management – UIS \nIT Project Management – UIS \nBusiness Intelligence – UIS \n\n\nExperience:\n\nBroadSoft Inc – San Jose, CA\t\t\t\t\t\t\t             \t\n(September 2017 –  Current)\nBroadSoft Inc. worked as Business Analyst / Product Manager\n\nProject Description:\nBroadSoft CC-One provides contact center solutions for the customers like Office Depot and Guthy Renker etc. It provides Omni-channel communication like SMS, Chat, Email and twitter to increase efficiency of the Call centers for better service.\n\nInitiated daily meeting with Infrastructure, Engineering, CSM and Technical Support team members to keep update on the migration and roadmap going further.\nResponsible for writing the release notes and updating the PRD (Product Requirement Document) for the future release.\nInteracted with Technical Support team and helping them resolve their support issues on Enhancement requests from customers.\nUnderstanding the product and its configuration setup as end-user perceptive from CSM (Customer Success Management)\nAs part of migration, I was responsible to maintain the list of changes that is being migrated.\nInvolved with CSM’s to understand more about the product as end-user. \nWorked on RFP (Request for Proposal) to assist Sales Engineers.\nknowledge in Micro Services in Enterprise Applications.\nDelivered business value by creating business logic and operating it so it can provide a service to some users\nIdentified Customization’s of customer requests as part of migration and discussed with Engineering and Operations team.\nGiving Demo on product to the sales engineers.\nAttended boot camps which gathers all the customers around the world to provide insights and recent migration changes for the current release and the roadmap for future releases.\nAs a part of migration, I was also responsible for testing the new features and assisting the QA team.\nExperienced in JIRA tool for tracking the issues.\nResponsible for ensuring agreed targets and conditions are met on behalf of a company or organization\nAbility to handle delivery and business stakeholders\nAbility to anticipate and build contingency plans\nDefined the functionality, usability, reliability, performance and support requirements for Robotic Process Automation (RPA) applications as a business subject matter expert. \nProcessed needs for RPA, delivering innovative automations, automation analysis, solution design, and automation development and deployment.\nContact Center or Call Center technology experience with IVR.\nDefined and executed IVR, Chat, and Email channel solutions from concept to rollout. Measured results and enhanced to improve customer and shareholder metrics\nWork with both the Robotic Process Automation (RPA) Lead Analyst and the customer to define automation requirements\nExperience in portfolio of applications that support major technology programs and the built out of contemporary applications. These applications are focused on telephony, voice analytics, application/phone integration, soft phone, web services and UI development.\nMaster in strategic business process modeling, traceability and quality management techniques.\nMaking decisions at the appropriate time, considering the needs of the situation, priorities, constraints and the availability of necessary information.\nExpertise in handling projects and teams independently and having good knowledge on supply chain management and warehouse centers.\nStrong understanding of Interactive Voice Response (IVR), Computer telephony integration (CTI), Automatic Call Distributor (ACD), call routing and queuing, Softphone and call analytics and reporting platforms.\nGood at resource and client/customer, process and time management.\nKnowledge of integrated, global call center technologies to support IVR, CRM, CTI integration and skills-based routing in a Customer Interaction Platform environment\nHave good exposure in analyzing the impact and good in planning resources for automation.\n\nCapital One - Chicago, IL\t\t\t\t\t\t\t             \t\n(October 2016-  Aug 2017)\nRole:     Sr. Business Analyst\nProject: Justice Conversion/Launch and L&T Conversion/Launch\n\nProject Description:\n\nJustice is a retail store which is targeted towards tween girls market. As part of this project, converted over 200K credit card accounts from ADS (Alliance Data Systems Corporation) to Capital One WHRIL system. As part of this partnership launch, built application, account and statements report to send to 3rd party vendors TSYS and Epsilon.\nLord and Taylor is an oldest luxury department store in the United States. As part of this project, converted over 1.5 MM credit card accounts from GE Synchrony to Capital One WHRIL system. Along with the conversion, new capabilities were added to the WHIRL system to support L&T, one of the enhancements was to differentiate customers and re-issuing Premier Credit Card with more rewards if the total purchase transactions are more than $1200 per year.\nInteract with the business Users on the Business requirements and converting them to technical design specifications.\nExecuted the project in Agile methodology.\nGathered business requirements by conducting detailed discussions with business users, stakeholders, and Subject Matter Experts (SME’s).\nKnowledge working with IBM Info sphere. \nExperienced in creating graphical representations of complex business processes\nI was responsible to identify most valuable reports by analyzing the data and their relationships.\nDeveloping new software components.\nKnowledge on mainframes vs. servers.\nInteract with Subject matter experts, Product owners and other stakeholders on prioritizing the user stories.\nInteract with multiple vendors during the project.\nExperience on sever configurations. \nReview the work done by the team and collaborated with team using confluence.\nExperienced in graphical user interface mockup and website wireframe builder application. \nSupport the E2E testing during SIT and UAT phases which involves multiple vendors and multiple applications.\nProvide demo to the Business on the functionality/product developed.\nEnsure Quality Deliverables.\nClear the impediments which team is facing.\nProvide post production warranty.\nDefined the functionality, usability, reliability, performance and support requirements for Robotic Process Automation (RPA) applications as a business subject matter expert. \nProcessed needs for RPA, delivering innovative automations, automation analysis, solution design, and automation development and deployment.\nResponsible for the quality procedures to be followed and documented correctly.\nDocument the project deliverables in Hand over document and provide the necessary inputs for the production support team to take over.\nConducted training sessions to the end users for using the OBIEE Analysis, Dashboards and various OBIEE Reports\nPrepared the training material on how to use the OBIEE Tool to generate the Reports/Dashboards\nTrained the End users and got feedback to incorporate the Business Terminology in the OBIEE Tool.\nAbility to identify system and business process gaps and inefficiencies and provide solution workarounds, as well as business process enhancements to resolve those inefficiencies\nEnvironment: Agile Scrum, UML, XML, MS Office, MS Visio, OBIEE 11g, Oracle 10g/11g DB, SQL, Endeavor, QC, SOAP UI and HP ALM QC 11.0.\n\n\n\nMercy Hospitals – Philadelphia & Maine                      \nApril 2015 – Sep 2016\nAssistant Manager – Business Analytics\n\nProject Description:\n\nMercy of the top integrated health care supply chain organizations in the nation. Learn, grow and advance with an industry leader.\n\nProjection of cash by using Waterfall Model.\nWorking on the EDIs (Electronic Data Interchange) and providing final output to operation team.\nWorking on patient eligibility requests (270) and the responses to it (271)\nAnalyzing the Remittance Advices received from insurance companies in the form of 835 responses.\nProviding the results of 835 responses to the operations for quick resolution of claims.\nPreparation of presentations for the monthly client meetings which includes the trends and analysis done throughout the month.\nHands on experience on Balsamiq mockup tool.\nProficient generating and reviewing system process flows and sequence diagrams\nApplying the Denial Management strategies for quick resolution of the claims pending for payment.\nWorking with the coding and billing teams to ensure the accuracy of data mentioned on the claims\nPrepared Data flow diagram and business process models that would comply with ICD-9 CM.\nInvolved in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Medicaid Claims\nAnalyzed System flows of various department of the hospital\nDesigned project protocol in collaboration with multi-disciplinary team including physicians\nFound various trends related to bulk denials from insurance companies and resolved them\nCredentialing of the providers with payers for various departments and physicians\nCredentialing of providers helped increasing the speed of collections\nExperienced in HIPPA compliance rules and PHI (Protected Health Information)\nFollowing up with the federal insurance companies (Medicare & Medicaid) for bulk resolution of claims pending for payment.\nManaged Test’s using Test Rail.\n\n\nUPS - Louisville, KY\t\t\t\t\t\t\t\t  \n(May 2013 - Feb 2015)\nBusiness Analyst / Scrum Master\n\nProject Description:\n\nUPS is the world's largest package delivery company and a leading global provider of specialized transportation and logistics services. UPS implemented a mobile (Android and iOS) project for its crew- 1st and 2nd officers to bid their flight schedules, reserve trips, check for the flight schedules and the history.\n\nElicited requirements using document analysis, requirement workshops, brainstorming, interviewing,\nQuestionnaire/Surveys and focus groups\nExperienced in creating graphical representations of complex business processes\nExperienced in graphical user interface mockup and website wireframe builder application.\nPerformed GAP analysis by working closely with the clients to understand their current state of information availability in and defined future needs based on analysis of business requirements.\nHands on experience on Balsamiq mockup tool.\nCoordinated with Crew scheduling team/schedulers in loading and build trips and legs for Pilots bidding process.\nConducted JAD sessions and captured meeting minutes for staff/client meetings and distributed meeting notes\nCreated product backlog, release backlog, and sprint backlog during client implementation for Agile projects. \nPerformed daily data queries and prepared reports on daily, weekly, monthly and quarterly basis using Tableau\nWorked with PM, Dev Lead, Product Lead, scrum masters to develop test schedule and provide inputs to the overall project schedule.\nKnowledge on Oracle OSS/BSS platforms.\nSchedule, coordinate and communicate with all the facets of enterprise infrastructure for conducting quarterly Table Top drills for the applications in case of a disaster.\nMaintained and updated the Disaster Recovery Business Continuation Plan\nDeveloped Use-Cases and User Stories and followed the Acceptance Criteria of the requirements and updated in JIRA\nResponsible for preparing test plan documents, and wrote Test Cases based on the user stories and documented in JIRA\nPerformed UAT on various native features on mobile devices and tablets using simulators and emulators\nInvolved in testing applications on various generations and versions for iOS, Android, Blackberry and Windows platforms\nLed the Defect Management process and prepare status reporting of the system/ Integration and regression test execution.\nProvide operational metrics to management, PMO and support teams on aging tickets, stalled tasks and to highlight bottlenecks as well as identifying opportunities to increase efficiencies.\nCreated and ran functional and load tests on schedules, flights, crew and trip APIs on the web services prior to implementing using Soap UI\nKnowledge working with IBM Info sphere. \nI was responsible to identify most valuable reports by analyzing the data and their relationships.\nInvolved in writing SQL queries and database checkpoints to verify data quality, calculations and reviews.\nDeveloped timelines for project delivery, and managed projects and resources to successful completion.\n\n\nThompson Reuters – Hyderabad, INDIA\n(May 2010 – Apr 2013)\nBusiness Analyst and Report Developer\n\n\nProject Description:\n\nThomson Reuters provides professionals with the intelligence, technology and human expertise they need to find trusted answers. We enable professionals in the financial and risk, legal, tax and accounting, intellectual property and science and media markets to make the decisions that matter most, all powered by the world's most trusted news organization.  Service permission system was one the crucial application which validates and authorizes the orders on Reuter’s products. As a part, we are responsible for developing the new software components and does the production support for the existing application.\n\nAnalyzing the Business requirements from clients for the new application, requirements to perform Design, document, develop, test and implementing it accordingly.\nProvide the estimations for the new work orders received.\nMaintain & Support the existing software by handling technical issues or enhancements raised by the client. \nAs a reviewer, was responsible for reviewing tasks done by team members and peers and make sure the quality product/Solution is deliverable to the customer.\nResponsible for the quality procedures to be followed and documented correctly.\nCo-ordinate with client for business concerns.\nCoding and unit testing the new software components.\nExperienced in graphical user interface mockup and website wireframe builder application.\nFix the defects raised as part of the SIT and UAT phases.\nResolve any impediments for the team for smooth progression of the project.\nEnsure all quality procedures are followed. \nComfortable generating high and low-level system architecture diagrams and design documentation.\nImplement the new components in production and provide production support in the warranty period.\nAble to develop the SQL Queries to be executed at database to compare the OBIEE Reports for matching the outputs\nGot Pleasant Experience in developing the Discoverer Reports using Discoverer Plus/Viewer\nUsed the SQL Inspector to generate the SQL Query in Oracle Discoverer and compared to validate the conditions generated are as per the requirement\nHands on experience on Balsamiq mockup tool.\nUsed the OBIEE Usage Tracking to validate the SQL Query generated for the OBIEE Report \nDeveloped manual SQL scripts to compare OBIEE and Discoverer Reports Output\nImplement the new components in production and provide production support in the warranty period.\nResolve all the production incidents within the specified as per SLA.\nDocument the new projects implemented in production for future reference.\nTrain new members in the project.\n\n\nAcademic Background: \n\nMaster’s in Management Information Systems\nUIS – Springfield, Illinois-USA\n\nBachelor of Technology – Electronics and Communications\t\t\t\nJawaharlal Nehru Technological University, Hyderabad, India\n\n\n\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "confluence",
        "jira",
        "oracle",
        "project management",
        "scrum",
        "sql",
        "tableau"
    ]
}