{
    "id": "resume_e11e9331-a9d4-4933-9ebd-a1e31a28bb51",
    "metadata": {
        "filename": "RAMYA BUSINESS ANALYST RESUME.docx",
        "processed_date": "2025-09-24T08:45:48.935472+00:00"
    },
    "raw_text": "Ramya\nBusiness Analyst \nRamya003.m@gmail.com\n7328440463\n\nTECHNICAL\nSUMMARY:\n\nSeven years of Business Systems Analyst experience in the field of Financial Services & Banking and Capital Markets.\nIntensive experience writing Business Requirement Documents (BRD), Functional Requirement Documents (FRD), User Requirement Documents and helping developers with creation of Software Requirement Specifications (SRS). \nWide-ranging experience using different methodologies such as Agile, SCRUM, RUP (Rational Unified Process) & Waterfall.\nInvolved in facilitating meetings, revise sessions, Discussion groups and JAD sessions to analyze the business requirements to its depth and reach team consensus. \nProficient in developing Business Process Diagrams, such as Use Case diagrams, Data Flow diagrams, Process Flow diagrams using MS-Visio and UML.\nExperience with Rational Requisite Pro to create and manage requirements and managing defects.\nGood knowledge of designing Sequence and Activity diagrams using Rational Rose.\nExcellent knowledge of project management – MS Project 2003, experience in Planning, Scheduling, Task Allocation.\nExperience in writing test plans, defining test cases, developing and maintaining test scripts.\nKnowledge of testing the functional and technical requirements. Functional, Regression Testing and Integration Testing for Web based and Client/Server applications.\nExperience with Data Analysis using Oracle as a backend and using SQL Queries.\nExperience in Defect Tracking Process-Test director for executing and reporting bugs to the QA team and UAT.\nWorking Knowledge of Reporting tools such as Business Objects.\nExcellent problem solving, team building, judgment and decision making skills.\nStrong communication and time management skills, proven ability to work under Pressure and team-oriented environment.  \nExcellent analytical, interpersonal, collaborative, diplomatic, and documenting skills.\n\n\nTECHNICAL\nSKILLS:\n\n\nEXPERIENCE:\n\n\n02/16-Present \tMaster card, Missouri\nBusiness Systems Analyst\nMastercard operates the world’s fastest payment processing network, connecting consumers, financial institutions, merchants, governments and businesses in more than 210 countries and territories.\nResponsibilities:\nInteracted with business owners to identify business system needs, evaluated solutions for business problems and proposed alternate methods to increase efficiency.\nAnalyzed and documented information system requirements and the corresponding impact on business processes.\nResponsible for defining the scope and implementing business rules of the project, gathering business requirements and documentation. \nResponsible for writing Functional Requirement Specifications (FRS) and User Requirement Specification (URS). \nAnalyzed Business Requirements and segregated them into high level and low level Use Cases, Activity Diagrams /State Chart Diagrams using Rational Rose according to UML methodology thus defining the Data Process Models.\nSuccessfully conducted JAD sessions, which helped synchronize the different stakeholders on their objectives and helped the developers to have a clear-cut picture of the project.\nResponsible for maintaining the minutes of all the requirement gathering sessions.\nIndependently manage project scope, risks and manage project meetings as needed to drive projects to completion.\nResponsible for interacting with the developers to explain the proposed changes and understand the system requirements to handle these changes.\nCoordinated with the test team to check the weekly status and report the same to the project manager.\nFormulated comprehensive test plan based on requirements and develop test scenarios based on use cases.\nPerformed regression, functional testing, stress testing, performance testing, user interface testing, User Acceptance and system testing. \nEnvironment: RUP, UML, MS Project, MS Visio, Rational Requisite Pro, MS Office, SQL & Windows 2000/NT\n\n11/14-1/16\n\t Horizon BCBS, New jersey\n\tResponsibilities:\nReviewed Business requirements, IT Design documents and prepared Test Plans for all assigned project releases.\nExperience in Preparing Design Specification documents based on functional requirements and also involved in the preparation of Technical Design Documents. \nAssisted Program Manager on large projects and coordination of key project activities in support of quality objectives. \nWorked as a SQL developer to support business applications using Oracle SQL and PL/SQL. \nBuild and maintain SQL scripts, indexes, and complex queries for data analysis and extraction. \nCreate stored procedures, functions, packages, triggers using PL/SQL Developer.\nPL/SQL coding for Exception Handling and Duplicate Data maintaining. \nProficient working experience in Oracle utilities such as Export / Import. \nExtensive data cleansing and analysis, using pivot tables, formulas (v-lookup and others) Data validation, conditional formatting, and graph and chart manipulation. \nExecuted test cases, identified defects and followed through to resolution in JIRA.\nUsed SQL Dimensional Data Modeling, Star Schema modeling, Fact and dimensions tables including Physical, Logical data modeling.\nBlended data from multiple databases into one report by selecting primary key’s from each database for data validation.\nCombined views and reports into interactive dashboards in Tableau Desktop that were presented to Business Users, Program Managers, and End Users.\nBuilt and maintained SQL scripts, indexes, reports and queries for data analysis, data mining & cleansing and extraction.\nEnvironments: Rational Rose, MS Office Suite, Oracle9i, JIRA, Web Services, Tag Libraries, UML, CSS, MQ Series, SQL, PL/SQL, Tableau 10,9x, ETL(Informatica 9x), XML, HTMLC, C++, Windows XP/2000/NT, Linux, UNIX, TOAD.\n\n\n\n1/13– 10/14\tPNB, Mumbai, INDIA\n\tJr. Business Analyst\nPNB’s online bank service enabled customer’s to personalize their user interface and access updated account information. The goal of the project was to add new functionality to the existing online banking system that would allow the customers to transfer funds and make online bill payments.\n\tResponsibilities:\nAnalyzed business needs, created and developed new functionality supporting in-house development projects.\nDeveloped business papers, gathered business requirements, and compiled them to help the design of a viable online banking system.\nActed as a primary liaison between the business users and the internal users.\nAnalyzed existing systems and revised them as needed.\nGathered and documented business requirements. Designed and developed sequence diagrams and models.\nFormulated logical statements of business requirements research and evaluated alternative solutions to recommend the most efficient and cost effective solution for system design.\nProactive management of client expectations of the marketplace.\nEnvironment: UML, Oracle, Rational Suite MS-Project & MS Visio.\n\n2/11-12/12\tWINIT SoftwareRole, Bangalore,INDIA \n\tProject Analyst\nResponsibilities:\nConcentrated and involved more in System Integration testing.\nReviewed Business requirements, IT Design documents and prepared Test Plans for all assigned project releases.\nResponsible for the reconciliation, analysis and management reporting for Payroll balance sheet and income statement accounts.\nUsing Excel pivot tables to manipulate large amounts of data in order to perform data analysis. \nManage and maintain spreadsheets to ensure accurate data availability for managers and decision-makers \nVLOOKUP formula development, Pivot Table generation, and Pivot reporting. Modify spreadsheets to achieve analytical goals. \nFormatting spreadsheets and workbooks for print, document reproduction, and presentations. \nCreate spreadsheets to upload required data into financial systems.\nExtensive Excel work using pivot tables and complex formulas to manipulate large data structures. \nConducted JAD sessions for effective communication of views between stakeholders and gathered business requirements, \nEnsured that all the artifacts are in compliance with corporate SDLC Policies and guidelines, prepared BRD and converted into functional specifications using requirement management tool.\nCreated UML diagrams such as use case diagrams, activity diagrams, and sequence diagrams.\nProvide technical and procedural support for User Acceptance Testing (UAT).\nCreated functions, procedures and triggers in PL/SQL.\nSupervise development of SQL-queries/procedures for database and backend testing.\n\nEnvironment: Rational Rose, Rational Requisite Pro, Clear Quest, MS Office Suite, MS Visio, SQL Developer, JAVA, J2EE, JavaScript, HTML, DHTML, MS SQL Server\n\n\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "css",
        "data analysis",
        "html",
        "java",
        "javascript",
        "jira",
        "oracle",
        "problem solving",
        "project management",
        "scrum",
        "sql",
        "tableau"
    ]
}