{
    "id": "resume_efa0c9af-09e4-4e9e-8cfa-a442979fda9c",
    "metadata": {
        "filename": "Rashmitha R.docx",
        "processed_date": "2025-09-24T08:45:49.411742+00:00"
    },
    "raw_text": "\t\t\t\t\t\t\nRashmithareddy\nEmail: rashmitha.java134@gmail.com\nTel:  469-443-4710\t\t\t\t\t\t\tJava Lead /Developer\n\nPROFESSIONAL SUMMARY\t\n8+ years of IT experience in various web-based, Enterprise, Client/Server and Distributed applications using Java/ J2EE.\nHave 3 years of experience in e-commerce industry.\nHave 1 year Experience in Treasury industry. \n8+ years of experience in Java concepts including Polymorphism, Inheritance, Exception handling, Collections framework, Serialization, Multi-threading, Design patterns, Synchronization etc.,\n8+ experience in designing and developing applications using J2EE technologies including Servlets, JSP, JSTL, JSF, EJB, JNDI, Swing, Struts, AJAX, Hibernate, Spring, Web Services, XML, JDBC, HTML, HTML5, CSS, CSS 3, DHTMLX and JavaScript.\n5 years of experience in Agile/SCRUM development environment.\n5 years of experience in various modules of Spring framework like Spring IOC, Spring AOP, Spring MVC, Spring Batch, Spring ORM, Transaction Management, Spring Security \nExpertise in implementing the persistence logic using JDBC, JPA, Spring JDBC, Hibernate 2.x/3.x/4.x/5.x and iBATIS framework.\nExpertise in Application development using Struts framework including Struts Action, Struts tags, Interceptors & Validations.\nExtensive experience in Heroku Cloud Platform including organization creation, app creation, Dyno scaling, DNS configuration, SSL configuration, SSO configuration, choosing best add-ons etc.,\nExtensive experience in working with Oracle, SQL Server, MySQL, DB2 Relational Databases.\nExperience in working with NoSQL databases like MongoDB, Cassandra, Graph DB (Neo4j).\nExperience in writing SQL queries, PL/SQL. Joins, Stored Procedures and Database Triggers.\nExperience in using Ant, Maven build tools and performing unit test by writing Junit test cases using Junit Frameworks like Mockito, JMock.\nExperience in generating logging by Log4j to identify the errors in production test environment and experienced in Ant, Maven and Gradle tools.\nVery good experience with multiple servers like IBM WebSphere, IBM WebSphere ESB (Enterprise Service Bus), WebLogic Server, Apache Tomcat, Jboss.\nExpertise in implementing Service Oriented Architecture by using SOAP and RESTful web services.\nImplemented SOAP based web services by using various API like Axis 2, Apache CXF, JAX-WS Strong knowledge in using WSDL and UDDI. \nWorked with Jersey, CXF API to implement RESTful web services, strong knowledge on JAX-RS annotations.\nExperience in using DOM4J, JAXB, JAXP parsing and XML Bean to process, validate, parse and extract data from XML files.\nWorking Knowledge and practice in Amazon Web Services (AWS).\nExperience in designing and developing use cases, class diagrams and sequence diagrams using UML, Rational Rose.\nExperience in versioning tools like GitHub, Clear case, SVN and CVS.\nExperienced in creative and effective front-end development using JSP, JavaScirpt, JQuery, D3 Js, Angular Js, Node JS, Backbone Js, Bootstrap, Ext Js, React JS, Ajax, CSS& CSS 3.\nExperienced in using Messaging Services like JMS, MQ Series.\nExperienced in Unix and Shell Scripting.\nExperienced in Programming with Big Data Frameworks: Apache SPARK, Lambda architecture, leveraging Apache Kafka. \nFamiliarity with Rules Management System (e.g. Drools, IBM Lombardi).\n\n\nTECHNICAL SKILLS:\n\n\nEDUCATION\t\n\nBachelor of Technology – Bachelors in computer science \nUniversity - Osmania University \nPassing year - 2009\n\n\nPROFESSIONAL EXPERIENCE:\n\nCisco Systems ,SanJose,CA\t\t\t\t\t\tSep 2016 - Dec 2017\nRole: Java/J2EE IT - Technology Lead ( Full Stack Developer)\n\nThis is a web-based unified commerce application which enables customers and partners to create estimates/quotes for the renewal of current software subscriptions and technical services. This application provides rich interface to Cisco partners/customer to search multiple product lines, existing quotes/orders and contracts. \n\nResponsibilities:\n• Involve in Programming, testing, debugging, implementing, and maintaining of Java EE client/server distributed application to meet the organization's needs. \n• Design application modules, base classes and utility classes using core java \n• Design and implement customized exception handling to handle the exceptions in the application. \n• Involve in developing code for obtaining bean references in spring framework using Dependency Injection (DI) or Inversion of Control (IOC) using annotations. \n• UseSpring validation and write validation rules. \n• Design the front end using JSP, Angular, CSS and Html as per the requirements that are provided. \n• UseJenkinswith Maven for continuous integration \n• Primarily focus on the spring components such as Dispatcher Servlets, Controllers, Model and View Objects. \n• Develop Business components using Java Objects and used Hibernate framework to map the Java classes to the database. \n• Designing data schema and development of SOAP web services with Axis implementation and REST web services with JAX-RS \n• Using RESTful web services (JAX-RS) to retrieve credit history of the applicants. \n• Created RFP (Request for Proposal) micro service to provide RESTful API utilizing Spring Boot with Spring MVC. \n• UseHibernate, object/relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with a SQL-based schema. \n• Used Spring Boot for Dependency Injection and integrated with Hibernate DAOs. \n• Developed Hibernate DAO classes and with the spring frame work manager classes retrieve and save the data from the database. \n• ImplementSpring ORM with Hibernate taking advantage of Java features annotation metadata, auto wiring, and generic collections using plain JPA specification that is used to implement the DAO layer with Hibernate Entity manager's Session Factory, HQL, and SQL. \n• Develop payment flow using AJAX partial page refresh, validation and dynamic drop down list. \n• Use MyEclipse IDE, configured and deployed the applications onto Apache Tomcat. \n• Implement version controlling using SVN. \n• Implementlog4j for logging purposes and debug the application. \n• PrepareJunit test cases and executed the test cases using Junit in eclipse. \n• Participate in scrum meetings and design review meetings \n\nEnvironment: J2EE, JSP, Angular, Jdk 1.6, UML, Eclipse, Oracle WebLogic Application server, JSP, SOAP, REST, JAX-WS Spring, Spring MVC, Hibernate, Spring Boot, Micro Services, XML, CSS, HTML, Junit, SVN, Log4j, Oracledatabase, Jenkins, UNIX, Maven, Agile Scrum.\nProject 2: Technology Invoice Processing System:\n\n\nPPG Industries, Pittsburg, PA\t\t\t\tSep 2015 – Aug 2016\nRole: Java/J2EE Developer IT - ( Full Stack Developer)\n\nPPG Industries is an American Fortune 500 company and global supplier of paints, coatings, specialty materials, chemicals, glass, and fiberglass. PPG operates in more than 70 countries around the globe. This is a retail Domain project is to implement a web application for customer login, purchase and payments for products, Generate Quotes and reports.\n\nResponsibilities:\nInvolved in the detail design of the modules according to the J2EE standards.\nImplemented the application using Agile development methodology.\nImplemented the application modules using Spring Core layer(IOC), Spring Security, Spring AOP, Spring ORM, Spring Batch, Spring Transaction Management in order to develop the application.\nBuilt an Application and deployed in the AWS Cloud.\nUsed Git as application repository and for deploying to Heroku.\nWorked on Logplex for viewing log entries in application deployed in Heroku.\nPerformed actions such as creating database, fork database in Heroku.\nImplemented Spring Services and business operations Dependency Injection.\nUsed spring boot annotations for entire configuration and free of xml.\nUsed multithreading and synchronization to allow concurrency.\nDeveloped Action classes, Form bean classes and Struts configuration file using Struts framework\nUsed Eclipse IDE for coding, debugging and testing the application modules.\nUsed different user interface technologies JSP, HTML, JSTL, EL, CSS 3, JavaScript, JQuery, Angular js, React JS and JSON for developing the GUI of the application.\nUsed npm/node js for the angular dependencies and for building the API services.\nUsed Jasmine for Unit testing the angular js application.\nUsed Object/Relational mapping tool Hibernate (persistency) to perform data base activities and transactions.\nImplemented Hibernate POJO Classes, Hibernate Configuration file and Hibernate Mapping files\nUsed Transaction Management to ensure data integrity and consistency.\nImplemented and worked on order processing, payments and reports generations in the application\nUsed different design patterns like MVC, Singleton, Data Access Object, Value Object etc.\nUsed Java Messaging Services (MQ Series and JMS) for developing messaging services to interact with different application modules.\nImplemented SOA using Web Services and its frameworks Apache Axis, SOAP, WSDL and JAX-RS API.\nImplemented Restful web services to perform some business activities.\nCreated independent services using spring and microservice architecture.\nUsed Oracle &Postgres as data base system.\nCreated stored procedures, Triggers, fucntions according to the application requirements.\nDeveloped stored procedures and triggers with PL/SQL.\nDeveloped Cassandra CQL queried for performing the DB operations.\nCreated Cassandra custom datatypes and collections.\nImplemented SQL injection security checks, html sanitization and other security mechanisms.\nAdvanced password security using PBKDF2WithHmacSHA1 algorithm.\nInvolved in performance tuning, query optimization, maintaining coding standards and resolving JVM issues.\nDeveloped Maven and ANT Scripts to do compilation, packaging and deployment in Web Sphere app server.\nDeveloped Junit test cases to unit test the business logic.\nUsed ApacheKafka for pub-sub and broadcast.\nProgramming with Big Data Frameworks: Apache SPARK, Lambda architecture, leveraging Apache \nKafka.\nConfigured JNDI resources, Data Base resources, MQ Series and other configurations on the Application Server.\nInvolved in the SIT, UAT, Cutover and Hyper care activities and solving productions issues and doing Root Cause Analysis & troubleshooting operational issues.\nEnvironment: Java 1.7, J2ee, AWS,  JSP, Servlets,Multithreading, Struts, Spring, Hibernate, Web Services, SOAP, WSDL, REST,  GitLab , Apache Axis, SQL, PL/SQL, MicroServices, XML, XSD, JAXB, JavaScript, Web Sphere 8.x, Heroku, Jboss Fuse, RAD, JSTL, EL, HTML5, XML, Jasmine , JQuery, BootStrap, Angular JS, React JS, JSON, Maven, SVN, SQL Developer, Oracle, Cassandra, UML, JUnit, Log4j, TestNG, JIRA, Hudson\n\nCaltrolInc, Las Vegas, NV             July  2014 – Aug  2015\nRole: Java/J2EE Developer - IT - (Full Stack Developer)\n\nCaltrol is headquartered in Las Vegas. Caltrol is the largest representative organization in the Southwest dealing solely with Industrial Process Automation. This project is of retail and Production Domain to implement a web application which is used Product sales portal and to tracks the production life cycle, Transportation & logistics management.\n\nResponsibilities: \nEffective interaction with team members and business users from different regions for procurement of requirements and then analysis.\nAnalysis, design and development of Application based on J2EE using Struts, Springs and Hibernate extensively.\nUsed spring boot annotations for entire configuration and free of xml.\nApplication development using Spring MVC and dependency injection.\nUsed Spring MVC (Model View Controller) to handle/intercept the user requests and used various controllers to delegate the request flow to the Backend tier of the application.\nDeveloped a Spring JDBC module in connecting to database.\nUsed Mongo DB as secondary database for persisting data.\nPersisted data IN BSON format and performed crud operations in Mongo DB. \nHibernate was used for Object Relational mapping along with Oracle database.\nUsed Spring ORM with hibernate for interacting with the database.\nInvolved in developing the user interface using Struts.\nUsed JSTL tag library for the development of application.\nExtensively used Angular JS, Ext JS, D3 JS, Node JS, React JS, Polymer JS for Building web applications.\nPosting the responses from the XML on to the JMS queue.\nUsed XML Parser for Building the XML Documents.\nUsed Unix Shell Scripting for program execution.\nUsed WSSR to manage applications, services.\nTest Driven Development in entire application development cycle.\nUsed Multithreading and synchronization for increasing the overall performance of the application.\nUsed Apache ActiveMQ for Java messaging services.\nInvoked the Web Services using RESTful and SOAP web services. \nAudited application SQL code with DB2 Explain prior to production implementation.\nExtensively used SQL, PL/SQL in constructing views, indexes, stored procedures, triggers, cursors, functions, and relational database models for implementing DAO.\nDeployment on Web Logic Application Server 11g.\nJunit, log4j were used for unit testing and as logging frameworks.\nWrote JUnit test cases for unit, integration, and functional tests, run automatically by Hudson/Jenkins in the builds triggered by each push to Git.\nDeveloped the classes for Unit Testing by using Junit- Mockito.\nImplemented AJAX base applications using DOJO and GWT API for Performance oriented and browser independent application.\nUsed JIRA tool for creating change tickets and handling production bugs and development tasks.\nInvolved in production support, resolving the production issues and maintaining the application server.\nUsed CVS configuration management tool for code versioning and release.\nInvolved in the SIT, UAT, Cutover and Hyper care activities and solving productions issues and doing Root Cause Analysis & troubleshooting operational issues.\n\nEnvironment: Java/ J2EE, JSP, Hibernate,Multithreading, Spring Core, Spring Integration, Spring Batch, Distributed Cache, Servlets, JSP, Db2, JSTL, EL, HTML5, Mongo DB, Struts, KAFKA, Web Logic Application Server 11g, and Oracle 11g, Cassandra, SOAP web services, XML, XSD, SAX, SOAP, Feign, WSDL, Karaf, SOUPUI, XML Spy, UDDI, CXF, SOAPUI, Maven, SVN, SQL Developer, IBM WebSphere, Junit, Mockito, GIT, ATG, log4j, HTML, GWT, JQuery, Angular JS, Ext JS, React Js, D3 JS, Node JS, Polymer JS, JavaScript.\n\n\nTravelers, Saint Paul, MN                  \t\t\t\tJan  2013 - July  2014\nRole: J2EE/Java Developer - Technical Consultant\n\nThe Travelers Companies is an American insurance company. It is the second largest writer of U.S. commercial property casualty insurance and the third largest writer of U.S. personal insurance through independent agents. Travelers is incorporated in Minnesota, with headquarters in New York City. Agency Billing is the billing system for Insurance Agents who bring business to the Company. This system involves the upkeep and maintenance of billing cycle for volunteer and non-volunteer customers and creating Management Information System (MIS) reports for Business and Senior Management reviews.\n\nResponsibilities:\nParticipated in the requirements analysis and technical assessments.\nDeveloped class diagrams/sequence diagrams using UML and Rational Rose.\nWorked on Agile environment and participated in SCRUM meetings.\nUsed Struts2 framework and J2EE components to develop Action classes, backend processes, complex reports and database interaction.\nDeveloped code obtaining bean references in Spring IOC Framework.\nInvolved in designing & coding of business logic using Spring MVC & AOP features.\nConfigured and worked with Apache Server.\nTo ensure cross-browser compatibility including IE 8, Firefox 3.5, Safari 4 and Chrome 4.0.\nDesigned and developed for the Presentation layer using JSP, HTML, JavaScript, DOJO struts Tiles.\nDevelop Web pages using JavaScript, JQuery, JSP, JSF and XML that interact based on events.\nDeveloped the application under J2EE architecture using JSP, Struts, Java Beans, iBATIS Data mapper.\nInvolved in designing components with design patterns like Factory, Singleton, Front Controller, Business Delegate, DAO, DTO, and Facade.\nInstalled, configured, and maintained a continuous integration (build) server.\nDesigned and developed Session beans to implement business logic.\nDesigned and developed data persistence mechanism using Hibernate in Struts2 applications.\nCreated SQL’s from views and queries to interact with multiple systems for data.\nDeveloped a robust administration and security system for access control and restrictions at application and user level.\nPerformed J2EE application deployment using IBM WebSphere Application Server on Windows and Linux.\nUsed Oracle and Cassandra\nUsed WebLogic and WebSphere Application server for Transaction management and hot code swapping.\nDeveloped deployment descriptors and scripts.\nUsed PL/SQL for writing stored procedures.\nUsed Bugzilla tracking tool to track bugs.\nDeveloped Junit test cases to unit test the business logic.\nInvolved in the SIT, UAT, Cutover and Hyper care activities and solving productions issues and doing Root Cause Analysis & troubleshooting operational issues.\nEnvironment:  J2EE, JDBC, XML, JSF,MVC, iBATIS, java beans, java Servlets, EJBs, Oracle, HTML, CVS, PL/SQL, Websphere, WSDL, SOAP, Spring Frameworks, Shell Scripts, Eclipse, Struts, JDK 1.6, Core Java(Multithreading, Collections), JSP, JSTL, Spring Core, Spring Integration, Spring BatchServlets, XML, HTML, Java Script, AJAX, SOAP 1.2, WSDL, GIT, UML, JMS, JDBC, Shell Scripting, JUnit, log4j, JMS, Apache Tomcat, Oracle EBS R12, Oracle 11g Database, Cassandra, Unix/Linux, Agile, EJB 3.0, WebSphere 7.0,WSSR, IBM  RAD 7.5,Oracle EBS suite R12, Maven, AXIS2\n\nByte AplhaSolutions(Client: South Shore Health Care),Hyd,India              May 2009 - Dec 2012  \t\nRole: Java Developer \n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "css",
        "git",
        "heroku",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "lambda",
        "mongodb",
        "mysql",
        "oracle",
        "react",
        "scrum",
        "spark",
        "sql"
    ]
}