{
    "id": "resume_872c7270-ea7e-470e-a3c0-dd0027df00f3",
    "metadata": {
        "filename": "RaviBurra_Certified PM_DevOps.docx",
        "processed_date": "2025-09-24T08:45:49.841814+00:00"
    },
    "raw_text": " Certified Project Manager -DevOps/Automation Architect\n----------------------------------------------------------------------------------------------------------------------------------------------\nAn Innovative and passionate Sr. Manager in Automation with 14+ yrs. experience in IT Sector.\nExperience of working in the most challenging environment, which gave me an opportunity to learn and implement different large-scale Programs & Projects by setting up QA processes and strategies for manual and automated testing.\nPrince2-Practioner, Scrum Master Certified, 6Sigma & ITIL certified.\nKnowledge on upcoming 5G network benefits and feasibilities to utilizes it with current IoT technology.\nExpertized on using various automation frame works as per the requirements and client infrastructure,\nA turnaround specialist & thought leader with extensive experience in formulating a vision, outlining strategy & leading teams that transform vision into execution.\nUnique skill set in Telecommunications sector on all types of network elements and configuration.\nProven record of accomplishment of building high powered organizations capable of delivering complex solutions concurrently across multiple product lines with a high degree of quality, scalability & reliability. \nDemonstrable performance in meeting aggressive deadlines & financial commitments while taking calculated risks with unproven technology & maturing organization. \nWell experienced in Implementation, Integration, Operation &Maintenance, Planning & troubleshooting of Cloud Migration infrastructure and Supply chain projects. \nExperience in making recommendation to the client to choose the right life cycle and appropriate automation tools as per their organizational infrastructure and standards.\nExperience with the concepts of High Availability, Disaster Recovery and AWS Cost Management and Optimization.\nExpertized in implementing the large-scale projects with multiple platforms by balancing the traditional and new trending methodologies.\nCollaborating with clients and AWS solutions support teams to achieve cloud adoption.\nExpertized in setting the direction and adoption of the appropriate processes and techniques for effective delivery of SLAs and projects.\nLeading customer facing AWS technical discussions in support of new sales opportunities as needed.\nExpertized in Automation Framework design and implantation with appropriate recommendations to the client need.\nWell versed with DevOps & agile methodologies and actively planned in various agile ceremonies like Scrum, Release planning, Sprint planning, product demos with Product Owner and Retrospectives.\nExpertized in planning to create a healthy working culture with multiple cross functional teams across the Globe.\n\nAreas of Expertise:\t\nManagerial Competencies\n Project Planning & Management    Management Development Skills         Standards and Priorities setting\n Process Enhancement                       Business Administration/Consulting    Stress Management\n Safety & Security Management       Quality Assurance & Control                 Strategy Planning & Direction\n Feasibility Analysis & Planning         Resource Management                          Executive Leadership Skills\n Vendor/Contract Management        Change / Risk Management                  Conflict Management\n Training & Development\t     Business Excellence & Development  Process Automation (RPA)\t   \n Team Building Skills\t\t    Transparent & Empowered                   Target / Result Oriented            \t\n Communication & Presentation Skills  Pre-sales & Bidding(RFB) \t             Strong Analytical Skills\n Customer Delivery & RFx. (RFI, RFP & RFQ) Conflict resolution management Decision Maker\n\nFunctional Competencies\n Project Management-DevOps\t\tSCRUM management                                             Continuous Improvement    \n Program Launch                                              Business Operations Analysis/BSS/BPS              Complaint Resolution          \n Line Balancing\t                                                Telecom- Innovation and Artificial Intelligence\n Reporting & Documentation\t\t Risk Analysis / Assessment                                   CoE Telecom\n Quality control & Assurance\t\t Economic Analysis\t\t                        Policy Designing\n Coordination & Follow-up\t\t Troubleshooting Skills\t                                        Projects Evaluation\n Liaising & Networking\t\t                 Capacity Planning Maintenance                          Output Analysis \n Budget Planning & Admin.\t                 New Product Cost Analysis\t                        Telecom Domain Expert\n Transition Management                                Cloud & Infrastructure Management\n\n\n\n\n\nKey Skill Competencies\n Telecom ,Airlines & Finance  Domain Expert           Singl.eView, Oracle BRM, EBS, Eppix , ICOM  Billing Systems       MS Visio, RSA & Enterprise Architecture  UIPath , Rational Robot, Selenium Web Driver, RC, TestNG,  Cucumber-BDD, ATDD & TDD, QTP , Load Runner, WorkSoft-Certify  Data Visualisation Java, J2EE  .Net VB Script, Java Script ,Ruby, Python Unix, Oracle SQL Developer Oracle SOA Suit   Hadoop  Apache- Hive  Web Service Testing Soup UI & Pro  XML ValidationSQL Store Procedures Validation  Tibco Spotfire Lisa tool   SAP HR Workday SAP CRM & CRM Billing  SAP CRM Web Client SAP BW Hana, MM & FICO, SAP MII & MEMS Project Remedy       Siebel CRM Sales Force POS/mPOS, QV/QVXP JPAYMENT Back-Office(OIM-OIF)  Active DirectoryCredit Fraud ManagementTMAG  RAP AWS, AZURE & Google JenkinMaven/GitRallyJiraConfluenceKafka/Zookeeper Messaging systems. Jenkins/Puppet/Ansible/Docker/AWS/OpenStack. Black Chain Technology, Identity Management, Beacon Technology, Augmented technology\n\nProfessional Accomplishments: \nConversant with all phases of Project Life Cycle including Requirement gathering, Analysis, Testing & Implementation of Quality Software. (SDLC (Software development Life Cycle), STLC (Software Testing life cycle) & PLM (Product Life Cycle Management)\nGood understanding & experience in Continuous integration and Continuous Delivery.\nCustomer Engagements. Implementation of the product and troubleshooting issues in customer’s environments. Guiding the customers from the technical standpoint\n10+ years of experience in direct interaction with Client & Stakeholders at client site.\nVery Good Experience in Resource Provisioning in OIM, AD with ASR/LSR submission.\nExperience in Cloud computing applications like IBM Middleware Integration, Tibco Integration & Oracle Cloud apps and Cloud Foundry.\n8+ year of experience in design and implementing  the automation frame works like Selenium- TestNg, RC, Webdriver, DDT, BDD, ATDD, Rational Robot, UFT, Soap UI, TOSCA & Work soft.\n3+years of experience in DevOpps project implementation using various feasible automation methodologies.\nWorked with Waterfall, V- Model, and RUP & Agile methodologies & DevOps life cycle model.\nKnowledge on ISO & CMMi levels and standards.\n Estimating & obtaining management support for time, resources & budget required to perform the testing.\nExpertized in Project Reporting & estimation with using MS-Project/Excel.\nExpertized in resource management & performance appraisals in Testing Area.\nDefining the Test Strategy & approaches.\nExcellent hands on experience in generating various Project execution reports with Dashboards & Metrics/Audit reporting /PMO Reporting. \nProviding required training sessions to the team on Agile/Scrum principles and techniques.\nFacilitating all scrum ceremonies like grooming, sprint planning, retrospectives, daily stand-ups, etc.\nRatifying change and continuous improvement increasing the productivity of Scrum teams with quality of deliverables.\nEmpowered teams to self-organize and grow cross-functionality.\nProtecting team from over-commitment, manage backlog, prioritize resolution of defects/bugs.\nManage the lifecycle of code development, from ideation to sprints to deployment\nCollaborating with other members of management groups to develop the new products & Engineering groups.\nMaintenance & Improves the Product quality by completing the product, system & audits.\nExpertise in building a testing team of professionals with appropriated skills, attitudes & providing motivation.\nExpertise in creating healthy & pressure less work environment to get excellent quality of work.\nExpertise in developing Project Plan, MTP, STP for the tasks, dependencies & Participants required mitigating the risks to system quality & obtaining stakeholder support for this plan.\nExpert in developing all type of project related artefacts & reports to communicate with Client & Stake holders.\nDocument, implement, monitor, & enforce all processes for testing as per standards defined by the organization.\nEnsure the timely delivery of different testing milestones. \nPreparing / updating the metrics dashboard at the end of a phase or at the completion of project & performed audit on test artefacts.\nVery good understanding and command on the Health care domain standards and codes like OCD9&10, OCIO policies & guidelines.\nExpertise & Broad-based experience in testing practices (Functional, Automation, Performance, Security, etc.) \nStrong project management, interpersonal communication, & collaboration skills\nProven record of accomplishment of delivering high quality products with On-shore & Off-shore model (teams that are globally distributed).\nCoordination between cross functional & cross site team (QA, Infra, development, Integration) to manage issues & their timely resolution\n\n\n\nCareer Snapshots: \nProject Manager- DevOps\t\t\t\t\t\t\t\tDec-2016 - Present\nEricsson-  WA, USA (I28 Tech Corporation)                                                 \nQA Project Manager - IDM (Automation)\t\t\t\t\t\tApril 2014 –  Dec-2016\nCap Gemini WA, USA (I28 Tech Corporation)                                                 \nTest Architect-SingleView\t(Automation \t\t\t\t\t\tMay 2013 – April-2014\nTCS   Sunnyvale-CA, USA (I28 Tech Corporation)                                                 \nQA Project Lead/ Test Manager(Automation)\t\t\t\t\tJune 2009 – May 2013\nIBM India Pvt. Ltd., India& Melbourne, Aus & Seattle- WA, USA\nQA Lead / Test Manager:\t\t\t\t\t\t\t\tMay 2007 – June 2009\nMTN (on behalf of TirbalGold), Republic of South Africa\nSenior Software Test Engineer:\t\t\t\t\t\t\tJanuary 2004 – May 2007\nMahivar Inc. Hyderabad- India\nEducational Details \n M.Sc., PGDBM(MBA)\n\nEricsson – (Project Manager- DevOps                                                                                                                                 Dec-2016 -Present.\n  Responsible for COE Automation projects.\n  Involving business meetings to get understand the new scope to implement the feasible automation frameworks.\n  Actively participating in all phases of SDLC and PLM to know the progress at each phase of the cycles.\nProviding required training sessions to the team on Agile/Scrum principles and techniques.\nFacilitating all scrum ceremonies like grooming, sprint planning, retrospectives, daily stand-ups, etc.\nRatifying change and continuous improvement increasing the productivity of Scrum teams with quality of deliverables.\nEmpowered teams to self-organize and grow cross-functionality\nProtecting team from over-commitment, manage backlog, prioritize resolution of defects/bugs as evidenced by the on-time delivery of major initiatives.\nMet goal of addressing and resolving issues within a day.\nParticipated in reviews and provide required capacity in new clouds for the program.\nDealing with clients to understand their migration workloads and current footprint.\nProvided the required Migration experience for clients.\nPlanned for migration schedule from multiple platforms to one consolidated platform using AWS cloud platform.\nCoordinated required support and process from internal team for migrations.\nComplete required end user client documentation and communication\nDocument and update internal processes for migration process\nManage the lifecycle of code development, from ideation to sprints to deployment\nCoordinate and manage code releases and shared APIs with other IT groups\nCommunicate with other management, engineers, product managers and support specialists on product issues\nTrack and communicate team velocity and sprint/release progress\nInvolving in Release process delivery activities to approve the code drops in Test environment and production.\nPartner with stakeholders to identify and implement DevOps elements into the organization and establish best practices.\nValidate and coordinating the Test Environment/Lab set ups and configuration pre-requisites in Engineering and research area.\nResponsible for DevOps COE with preferred automation tools like Rational Robot- Python, UIPath & Tosca tools.\nAbility to streamline development and QA processes through DevOps.\nMaintain all environments and assure consistency and security throughout.\nEstablishing the standards for SCM, Build, Repository Management, CI/CD, Configuration & Provisioning, Deployment and Environment Management process and tool standards.\nIntegrate DevOps into Release Management.\nAssure DevOps scales universally for hosted, customer on premise, and cloud-based strategies.\nWorked with third-parties for integration of DevOps practices.\nContinually innovate and reduce technical debt.\nProviding the right direction to use the DevOps tools like Jenkins (release), Configuration (Ansible and Puppet Manager), Zookeeper (Orchestration process) & AWS and Docker for Monitor and Virtualization.\nSuccessfully execute all releases and co-ordinate the Go-Live activities including the execution of the deployment plans and checklists\nAssure successful releases from Development, Test, Staging and Integration to Production\nFollowing the innovative resource utilization methods to increase the productivity by minimizing the stress and work load.\nProviding the technical support on RAN related areas in the Ericsson/ T-Mobile LAB.\n\nRole & Responsibility at client site.\nCap Gemini – T-Mobile                                                      \t\t                    Manager/Testing- IDM April-2014-  Dec-2016\n  Involving business meetings to get understand the new scope for QA effort.\nActively participating in all phases of SDLC and STLC to know the progress at each phase of the cycles.\nPreparing QA overall estimations & intake processes.\nInstructed and modeled core Agile principles of collaboration, prioritization, team accountability and visibility.\nProviding required training sessions to the team on Agile/Scrum principles and techniques.\nFacilitating all scrum ceremonies like grooming, sprint planning, retrospectives, daily stand-ups, etc.\nRatifying change and continuous improvement increasing the productivity of Scrum teams with quality of deliverables.\nManage the lifecycle of code development, from ideation to sprints to deployment\nEnsured consistent application of scrum methodologies across the enterprise solution.\nWorked with the engineering managers to identify cross-team dependencies and manage inter-team tasks.\nTaking Owner ship for Release Management process at QA stand point.\nPreparing release delivery milestones and planning activities.\nInvolving as a Test Environment Owner to set up the Test Bed.\nCreating Master Test plan, SIT Test Plan & test approaches.\nPrepared and shared UAT test plan with UAT team.\nProvided continuous support to UAT team during UAT Phase.\nInvolved technically in IDM 11g upgrade and implemented successfully OAM/OVD, OES/ESS & OIM 11g upgrades.\nSuccessfully implemented the Siebel infrastructure on Azure cloud while replacing it with SAP.\nMonitoring & Controlling the E2E testing & configuration for all Oracle Identity Management systems in U1.0 & U2.0 on AWS Could.\nValidated the Test environment before hand-over to the QA.\nSME for Identity Management System & SAP CRM/HANA.\nValidating the critical Business process by taking self-care like Credit card fraud management / online transactions.\nInvolving in completing the purchase orders using POS.\nInvolved in E2E testing for Wholesale & Retail from Order to Cash.\nInvolved in E2E testing for Payments using diffident payment methods like EMV/Vesta/ CPM at Jypament system.\nInvolving in test data creation using Selenium automation team.\nDeveloped & implemented BDD approach with Cucumber using Selenium tool. Was used Maven repository to store the developed script and data files for wider audience use in the organization.\nInvolved in Partner Integration system with globally distributed teams.\n Conducting Defect triage meetings.\nUsed exiting Robot automation framework for Regression and environment shakeout testing initially later moved to Selenium.\nInvolving in testing for critical areas of SAP HR, Workday, AD (Oracle Active Directory) & OIM, CRM, SAP HANA), Siebel CRM & SFDC.\nPerformed regression and Sanity testing on SAP CRM and Care application using Worksoft certify automation tool.\nDeveloped test automation scripts to test the product on multiple Mobile devices and iPad/ tablets.\nTaking care of AD configuration & SAP Hana Studio configuration set up.\nTaking care & executing High Visible   business scenarios by myself.\nConducting On/Offshore hand off meetings. \nGiven presentations to the Business Users on the test strategy (how to test) on the new architecture.\nConducted workshops on Testing methods and functionalities with UAT & Business team.\nPrepared and shared test execution process documents and results.\nWorked closely with the development team during Designing, Development Phase & participated in Unit Testing.\nTCS-US –Equinix –  Automation -Lead Test Architect                                       \n(Singl.eView billing/ Oracle EBS Billing System) \t\t\t\t   May-2013-  April-2014 (Sunnyvale- CA)\n\nInvolved in all meetings with business teams.\nImplement DevOps team(s), processes and tools\nInvolved in all stages of SDLC to get better understanding of the Program level E2E work flows.\nInvolved in entire STLC and DLC to know the progress and unblock the testing from road blockers throughout the STLC.\nGiven presentation to the clients on our test strategy & transformation on SingleView Billing System.\nSuccessfully performed E2E integration between Siebel CRM to SingleView Billing system.\nOrganized and aligned with the sprint planning, daily stand-up meetings, reviews, retrospectives, release planning, demos, and other Scrum-related meetings.\nTrained the offshore and onshore team to create clear and concise epics/stories.\nFacilitated Scrum of Scrum for offshore teams in India.\nEvangelized the benefits of Scrum to ensure its smooth adoption\nAssisted team with making appropriate commitments through story selection, sizing and task definition and participated proactively in developing and maintaining team standards, tools and best practices.\nPrepared estimations for QA effort.\nPrepared Master Test Plan & SIT test plan.\nExtensively involved in E2E testing from Quote to Cash.\nSME for Singl.eView billing system in Testing area.\nReporting to Program Director and project manager on billing progress.\nInvolved in JAD sessions\nInvolved in E2E testing to test the critical business flows & process.\nDesigned and implemented  Rational Robot frame for UI and API automation testing on Salesforce and Siebel applications.\nPrepared High Level Test scenarios & Test Cases\nDefined the Single View billing flows for rating & normalization.\nDefined new invoicing method for non-telecom billing products.\nWorked on integration of Major applications like Workday, Siebel CRM, SFDC, UCM Tibco, SingleView. \nCo-ordinated with UAT business to provide the support in their execution.\nConducted onshore/Offshore Hand-off meetings.\n\nIBM India PVT LTD                                                                                       \t\t\t    Test Manager (June-2009- May-2013) \nInvolved in all meetings with business teams as per the SDLC meeting scheduled by PM.\nInvolved in all stages of STLC and prepared test strategies as per defined schedule.\nGiven presentation to the clients on our test strategy & transformation.\nPrepared estimations for QA effort.\nSME for Telecom Billing systems like BRM, EBS, Singl.eView, ICOM, EPPIX & SAMSON.\nSME and Leading the project for SAP CRM, MM and MI & MES architecture.\nImplemented the SAP MII & ME E2E project for Optic fiber cable manufacturing client.\nInvolved during the Commissioning & Integration of the network elements (HUAWEI) of 3G lab.\nDebugging of issues during the first call of the network from RNC and Core network side. \nMSC configuration fault brought to notice due to which call was not proceeding and got it resolved through vendor.\nInvolved in Test Automation implementation using various automation tools like IBM RQM, Clear Quest,  & Selenium.\nHLR (Apertio) Configuration and SIM configuration done for all security related algorithms and subscription parameters carried out. \nSGSN, GGSN and HLR configuration definition (APN and GPRS profile configuration) done for PS call.\nDefined new test strategy for this client & presented with them.\nInvolved in JAD sessions\nInvolved in E2E testing to test the critical business flows & process.\nPrepared Master Test Plan & SIT test plan.\nPrepared High Level Test scenarios & Test cases.\nInvolved in Test execution.\nInvolved in critical business scenarios testing for capital & investment banking along with Credit card fraud management.\nConducted Daily Defect Meetings with Dev & SA teams.\nDaily defect triage meetings by following agile method.\nDaily stand up sprint meetings with the teams.\n\nILabs- RSA- MTN,  SA Airlines -(Johannesburg)                                       \t\t\t                                 May-2007- June-2009 \n\nWorked as a QA/UAT Lead Manager & responsible for analyzing & understanding the requirements.\nParticipated in JAD Sessions to understand the design solution for the new product.\nParticipated in requirement analysis meetings.\nSME for Telecom Billing systems like Eppix and Singl.eView. \nPlayed a key role in migrating the Eppix billing system to Singl.eView Billing system.\nTrained the team members with the knowledge gained from the meetings with business.\nDesigned Test Plan/Strategy.\nIntroduced new testing approach to reduce the stress on the employees.\nIdentified the appropriated test approaches to test the new feature.\nPrepared Test Scenarios based on the UC documents.\nPrepared the High-Level Test Cases to help the team members.\nReviewed the test cases.\nReported Status on Daily/Weekly/Monthly basis by following organizational hierarchy.\nConducted Daily defect status meetings with related teams.\n\nMahivar Inc- India- ABSA/ South African Airlines                        \t\t         Hyderabad- India- January-2004- May-2007\nWorked as a QA Tester & responsible for analyzing & understanding the requirements.\nTook part in Requirements walkthrough meetings.\nPerformed the detailed analysis of the requirements for designing of the test cases & any Ambiguities in the requirements/documents were resolved with the BA & SMEs.\nResponsible for creating the Test plan & the Test cases.\nPerformed the execution of the test cases & tested the application features like My Bill, Plan, Features, Profile, support & Usage Info.\nWorked closely with the development team to get the QA activities done effectively.\nExtensively involved in Build Verification Testing, Functional Testing.\nCoordinated the defect review calls with the development team.\nFully involved in Defect Triage meetings.\n\nProfessional Trainings & Certifications \nPRINCE2-Practioner\nSCRUM Certified Master\nITIL Certified.\nSix Sigma\n",
    "extracted_skills": [
        "agile",
        "ansible",
        "aws",
        "azure",
        "ci/cd",
        "collaboration",
        "communication",
        "docker",
        "go",
        "hadoop",
        "java",
        "jenkins",
        "leadership",
        "oracle",
        "project management",
        "python",
        "ruby",
        "scrum",
        "sql"
    ]
}