{
    "id": "resume_c84d0923-4c22-4f17-88f4-a960a419d884",
    "metadata": {
        "filename": "Ravi Reddy.docx",
        "processed_date": "2025-09-24T08:45:49.608681+00:00"
    },
    "raw_text": "Ravi Reddy\nSR. JAVA/J2EE DEVELOPER\n(402) 500-0041\nrvk.reddy240@gmail.com\n\nSUMMARY OF EXPERIENCE:\n9+ years of professional experience in all facets of Software Development Life Cycle – like requirement analysis, architecture design, development, testing and implementation of Enterprise Applications using, Java /J2EE technologies in e-Commerce, Finance, Insurance, Retail, Healthcare, Hospitality, and Telecommunication domain.\nProficient in Design and development of distributed Enterprise and Web applications using Java, J2EE (JSP/Servlets, EJB, JMS, JDBC), Collections, Struts, JSF, Hibernate, Spring Frameworks, XML (SAX, DOM), XSD, XSL/XSLT, Ajax/JavaScript, HTML, PHP, Perl, CSS, ANT and Web Services (SOAP, WSDL, UDDI).\nExpertise in Object Oriented Analysis and Design (OOAD), Model View Controller (MVC), Service Oriented Architecture (SOA), Inversion of Control (IOC), Dependency Injection (DI), Annotation-Driven Programming.\nHand on experience in XML technologies like XSL/XSLT, SAX, DOM, X Path, SOAP, WSDL, DTD, XSD, XMI, SOA, JAXB, JAXP, and Apache Axis. \nExpertise in implementing J2EE Design Patterns like Singleton, Front Controller, Factory Pattern, Business Delegate, Service Locater, Session Facade, Data Transfer Objects (DTO), and Data Access Objects (DAO).\nExperience in designing Use Cases, Class diagrams, Sequence and Collaboration diagrams for three/n-tiered object-oriented system architectures using Unified Modeling Language (UML) tools like Rational Rose.\nWorking knowledge of Agile Scrum, Waterfall, and Rational Unified Process (RUP) methodologies. \nExcellent skills in debugging and bug-tracing.  Hands on Experience with Web Sphere MQ.\nBuild ETL processes utilizing SSIS and DTS, including FTP data from remote location, transform it, mart it to data warehouse and provide proper error handling and alerting.\nInstalled, Configured Cognos8.4/10 and Talend ETL on single and multi-server environments.\nExperience in Ant and Maven build tools for project development and deployment.\nExperience in configuration, Integration and Development with AWS (EC2, S3, and Cloud Front).\nExperience in writing and executing unit test cases using J Unit Testing Framework.\nDeployed applications using various Application/Webservers like IBM Web Sphere Application Server, JBoss, BEA Web Logic and Apache Tomcat.\nProficiency in NoSQL databases Cassandra and relational data modeling, object-relational integration (ORM), physical design/tuning. Experience in Preparation and execution of Test Cases.\nExtensively worked with Oracle, SQL Server, MySQL, Sybase, and DB2relational database management systems (RDBMS).\nStrong knowledge in designing and coding stored procedures, Triggers and Functions using PL/SQL and also fine-tuning the SQL queries. \nExperience in using configuration management build management tools like CVS, Mercurial, Subversion (SVN) and Rational Clear Case.\nExtensively worked on Windows, UNIX, AIX, Solaris and Red Hat Linux operating systems.\nPerformed lead, supportive and sharing roles with strong communicative and interpersonal skills in team-tasks.\nTECHNICAL SKILLS\n\n\nPROFESSIONAL EXPERIENCE\n\nDescription: Reinsurance Group of America, Incorporated is a leader in the global life reinsurance industry .This project aims at Risk and Insurance management and deals with life insurance policies new policy applications, Renewal of policies, endorsement of policies, interim and flat cancellations are handled by this application. \nResponsibilities:\nDiscussions with clients based on the System requirement document to cover the functionality, technical issues and scope of work.\nHave used Service Locator, Façade, Singleton, and Factory Design patterns and have developed UML Diagrams using Visio.\nUser interface design using HTML, JQUERY, JSP, CSS, JavaScript, Angular.js, Dependency Injection and Node.js.\nDeveloped Controller for request, response paradigm by Spring Controllers using Spring-MVC and worked on other modules like IOC AND AOP.\nConfigured the URL mappings and bean classes using spring app-servlet.xml.\nImplemented AJAX using third party tools as richfaces-api-3.1.1 to generated User Friendly Grids and tables.\nDesigned and implemented GUI screens for creating, modifying, deleting and viewing point of sale transactions using Java, Swing, and AWT components.\nUsed Apache Maven for project management and building the application.\nUsed PL/SQL and SQL*Loader to create ETL packages for flat file loading and error capturing into log tables.\nBuilt and Configured Servers in AWS Cloud Environment.\nSet up Jenkins server and build jobs to provide continuous automated builds based on polling the Git.\nInstalled, configured, and administration of NoSQL database clusters in AWS Virtual Private Cloud Network. \nMigrated the Entire traditional EC2 Classic environment to Private network in AWS Cloud. This included a 3 tier Web Application. Integrated custom Cloud Portal to AWS APIs for Automated Network.\nDeveloped front-end code with Ajax call in AngularJS and JQuery to retrieve data as JSON Object from controllers in back-end RESTful Server, then display the well-organized result in web pages by writing AngularJS.\nDeveloped the WSDL/XSD using top-down approach and XML Namespaces. Generated the stubs using JAXB.\nInvolved in the deployment of Web-Service End-Points using CXF.\nAutomated the creation of the Javadoc documentation for the MCCCF application using Jenkins and Maven.\nEstablished the data environment for the cloud application and their migration. \nDeveloped the web-services & analysis of SOAP envelope using SOAP UI.\nImplemented the Message Driven Bean for Instruction enrichment and pre-processing. MDB is deployed on WebSphere server and dispatches the request to Stateless Session Bean (EJB).\nDeveloped Message Driven Beans (MDB) and extensively used the JMS API.\nDeveloped SOAP based XML web services. \nDeveloping automated process for builds and deployments; Jenkins, Ant, Maven, Sonatype Nexus, Shell Script, Perl, Java. Setup MQ/IPT on AIX and windows server using support packs.\nCreated architecture stack blueprint for data access with NoSQL data base Cassandra. Installed, configured, and administration of NoSQL database clusters in AWS Virtual Private Cloud Network. \n Used SAX XML API to parse the XML and populate the values for a bean. \n Used Jasper to generate rich content reports.   Developed XML applications using XSLT transformations. \nSQL development using Stored Procedures, Views and Queries with Oracle.\nInvolved in project documentation using Javadoc during development phase.   \nInvolved in writing PL/SQL stored procedures for Oracle 10g database.\nParticipated in the code reviews for various initiatives, Performed Static Code Analysis to follow the Best Practices for Performance and Security using apache Shiro.\n\nEnvironment: Java/J2EE 1.7,Servlets, JSP, JSTL, HTML, JQuery, Angular.js, cloud migration, AJAX, XML 1.0, XSD 1.1,  SPRING 3.0, Spring MVC, Spring Securities, Spring JPA, MQ Series, Spring JMS, EJB, Restful web Services, SOAP 1.2, WSDL, Hibernate, Tomcat 7.0, WebSphere 6.0, Eclipse Mars 4.5, Maven 3.3, Jenkins, JIRA, AWS(EC2, S3, Cloud Front), Oracle 10g, Junit, Log4j, mockito.\n\nDescription: Cox Communications is an American privately owned subsidiary of Cox Enterprises providing digital cable television, telecommunications and Home Automation service. The project aim to manage the ordering & disconnecting, invoice processing & billing, and reporting of telecom services. Currently the strategy has been implemented to include Telecom Service Center, Telecom Invoicing Management System (TIMS), and Telecom Reports (Web Reporting). Company’s Services Telecom Service Center provides order entry, tracking and delivery of telecommunication services.\nResponsibilities:\nDesigned and developed the product using Java/J2EE technologies in agile methodology.\nWorked closely with Director, Architect, Business Analyst, Clients, Development and Testing team of the company in developing the application as per client needs.\nDeveloped the Frontend/Backend application using Java, JSP. Developed page handlers for the JSP pages for customization. Built spring based Java and Scala microservices to support enterprise web application.\nUsed Session beans to implement Session facade. Worked on AJAX, DOM and CSS on frontend for asynchronous client services and component validation part.\nConfigured and deployed web application in JBoss Application Server using Maven.\nExtensively worked on SPRING for business and system level services for version2 release project. \nUsed SQL*Loader as an ETL tool to load data into the staging tables. Install fix packs for MQ and Message Broker.\nSetup High Availability for MQ servers. Integrate microservices into an existing system architecture.\nUsed DTS Packages as ETL tool for migrating Data from SQL Server 2000 to Oracle 10g.\nDesigning architecture, deployment and migration of the site from the physical environment to the Amazon Cloud.\nDesigned and implemented a Cassandra NoSQL based database and associated RESTful web service that persists high-volume user profile data for vertical teams.\nExtensive programming development in NoSQL such as Cassandra and Oracle PL/SQL –packages, stored procedures, functions etc. and management of various database objects (e.g. tables, indexes, views, etc.).\nSet up Jenkins server and build jobs to provide continuous automated builds based on polling the Git source control system during the day and periodic scheduled builds overnight to support development needs using Jenkins, Git, JUnit, Selenium and Maven.\nUsed AngularJS as the development framework to build a single-page application.\nInvolved in the deployment of Web-Service End-Points using CXF.\nInstalled, secured, and configured AWS cloud servers with Linux, Tomcat, MySQL, Apache, etc.\nWorked closely with BA for getting the requirement and converting the requirement to technical document using UML 2.0 and functional documents in VISIO.\nContribute to / create / maintain several Maven, Jenkins and Nexus plugins.\nDeveloped Message Driven Beans (MDB) and extensively used the JMS API. \nUsed DB2, Oracle10g as database in order to access customers Warehouse Data from credit bureau, Used Sql Explorer and Toad as IDE. Extensively worked on PL/SQL and DB2 Queries and checking performance tuning with DBA.\nInvolved in Unit Testing, User Acceptance Testing and Bug Fixing.\nImplemented Simple Logging Facade for Java or (SLF4J) for logging and appended to a log file for debugging.\nUsed ANT for build creation and to push onto other environments.\n\nEnvironment: Java/J2EE 1.7,Servlets, JSP, JSTL, HTML, JQuery, AJAX, Cloud Migration, XML 1.0, XSD 1.1,  SPRING 3.0, STRUTS 2.0, Spring Securities, Spring JPA, Spring JMS, EJB, Restful web Services, SOAP 1.2, WSDL, Hibernate, Tomcat 7.0, JBoss 6.1, Eclipse Indigo 3.7, AngularJS, Maven, Jenkins, JIRA, Oracle 10g, Junit, Log4j, mockito, UML, Clear-Case UCM.\n\nDescription: The Project involves analysis, design, and development for Citibank Enterprise.  The Brokerage and Clearing (B&C) system is used for verification and reconciliation of equity and fixed income brokerage and clearing fees and commissions. The system collects trading data from exchanges, brokerages, clearing houses and agent banks. \nResponsibilities:\nDesigned and developed the product using Java/J2EE technologies in RUP methodology.\nInvolved in Implementation and coding of front-end screens using Java, JSP. Developed page handlers for the JSP pages for customization. Used both Struts validation and JavaScript validation depending on requirements.\nBuild the security infrastructure for MQ using OAM\nManage re-architecture of Jenkins and integration with Confluence for release management and documentation assets. Re architect a Maven based system reducing build times.\nImplemented validation framework for creation of validation.xml and used validation-rules.xml.\nDeveloped batch processing, involved ETL process in java to transfer batch feeds to the database using CSV, iText, Apache-POI, JAXB and JAXP technologies. Scheduled Java batch processing.\nSet up and administer Amazon servers (AWS, Linux, Apache, MySQL, Python/Django, ElasticSearch, tripwire, fail2ban, ssh, sendmail, sudo, etc.)\nUsed ANT 1.5 for build creation and to push onto other environments.\nUsed NetBeans and created customized plug-ins in Plug in Development Environment (PDE).\nInvolved in Unit Testing, User Acceptance Testing and Bug Fixing.\nWrote JUnit test cases for unit testing and integration testing.\nTested and deployed the application on Application Server which acts as an Agent in WebLogic Application Server.\nEnvironment: Java/J2EE 1.6,Servlets, JSP, JSTL, HTML, JQuery, MQ series, AJAX, XML 1.0, XSD 1.1,  SPRING 3.0, STRUTS 2.0, Spring Securities, Spring JPA, Spring JMS, EJB, Restful web Services, SOAP 1.0, WSDL, Hibernate, Tomcat 7.0, JBoss 5.1, Eclipse Galileo, Maven, Jenkins, JIRA, Oracle 10g, Junit, Log4j, mockito, UML, Clear-Case UCM, Toad, iBATIS.\n\nDescription: Sabre is the global leader in innovative technology that leads the travel industry. The project involves a Code changes, code fixes Coordination with Testing team, Defect Fixes, Production Deployment and Warranty Support. Developed a application, which maintains the details about the Employee, Supplier, Customer, Lesser, Financier, Contractor and Insurance Agent. All the relational, transactions like Invoice, Sales, Loan, Lease, Insurance policy, issued assets etc. are also maintained in this application.\nResponsibilities:\nInvolved in the Analysis, Design and Development phase of the project.\nFollowed Agile Methodology throughout the development of the project.\nCreating custom, general use modules and components which extend the elements and modules of core AngularJS.\nWrote JUnit test cases for unit, integration, and functional tests, run automatically by Hudson/Jenkins in the builds triggered by each push to Git\n Written Perl automation scripts to change the layout of leaf nodes.\nMigrated corporate Linux servers from physical servers to Amazon AWS virtual servers\nUsed Spring Core container for Dependency Injection and wiring the components.\nExtensively used Collections, Regular Expressions and Page Framework (Amazon specific framework), while developing the project.\nUsed JSPs, JavaScript, AJAX, and CSS for User Interface development and client side validation. \n\nEnvironment: Java/J2EE 1.6,Servlets, JSP, JSTL, HTML, JQuery, AJAX, AWS, XML 1.0, Jenkins, AngularJS, XSD 1.1,SPRING3.0,STRUTS2.0,SpringSecurities,SpringJPA,SpringJMS,RestfulwebServices,WSDL,Hibernate, JBoss 5.1, Eclipse, Maven, Oracle 10g, Junit, Log4j, UML, Clear-Case,iBATIS.\n\nThe project was a Web-enabled application which will serve as the platform for Farmers' future e-Business initiatives with a Brand & Channel flexible framework from which Farmers Captive & Independent Agents, Zurich Small Business (ZSB).\nResponsibilities\nImplemented J2EE Design patterns using MVC (Model-View-Controller) architecture by developing Presentation tier which includes JSP's, Custom Tag Libraries, HTML and JavaScript, Web tier includes Controller Servlets, Business tier implementing business logic using Business Facades\nDeveloped Use case models using Rational Rose v2002 Modeling tool  utilizing Use case Design document as inputs\nDeveloped business components (Request Handlers, Response Handlers, Data Object Models(DOM),Business Services, Data Access Objects(DAO), View Beans required for the end-to-end flow of the application using  IBM's Web Sphere Studio Application Developer v4.0 as IDE for development, Unit Testing and deployment\n\nEnvironment: Java 1.5, J2EE (JSP 1.1, EJB 1.1, JDBC, Servlets2.1) Technologies, XML, Rational Rose 2002, IBM Web Sphere, Oracle 8i, Windows 2000.\n\nEducation:  Bachelors in computer science Engineering (CSE) from India\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "collaboration",
        "confluence",
        "css",
        "django",
        "ec2",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mysql",
        "node.js",
        "oracle",
        "php",
        "project management",
        "python",
        "s3",
        "scala",
        "scrum",
        "sql"
    ]
}