{
    "id": "resume_94e5edd4-eba9-491b-b30e-7a73ecd1c4c7",
    "metadata": {
        "filename": "Ravi Pattar- Sr. Agile Program manager.docx",
        "processed_date": "2025-09-24T08:45:49.497433+00:00"
    },
    "raw_text": "SUMMARY:\n17 years of IT experience currently working as Group Project Manager, Engineering/R&D with HARMAN Connected Services (a Samsung Company)  \nAgile/Scrum/PMP \nCertified PMP, Scrum and Trained Lead SaFE Agilist (4.0) with proven competence in building, training Agile Scrum teams and facilitating Scrum Masters \nExtensive experience in Sprint planning and estimation, tools like Poker Estimation, KANBAN \nHands on experience in Change management and accommodate new business requirements by prioritizing and performing impact analysis \nInvolved in driving the team to achieve high velocity and burn down rates  Conducted RTE activities across product lines \nCurrently undergoing Nanodegree certification on Data Science using Python \n\nTechnical Skills: Software Development/Management \n\nDomain  \nExpertise in business domains including Retail, Finance, Legal, ALM and B2C, catering to building grounds up applications to their maintenance. \nActed as proxy product owner in the geo absence of Product Management team. \n\nProject Management/People Management \nSkilful in Conflict Resolution, Risk Identification and Mitigation and Performance Management & People Management \nHighly capable in multi-tasking and managing multiple projects for processing requirements from conceptualization to final delivery. \nSolid understanding of SDLC from Requirements Analysis to Post Implementation \nExtensive expertise in project planning, schedules, resources, cost & overall project management plan. \nHigh degree of collaborations & effective communication among stakeholders. \nGood knowledge handling releases and deployment via CI / CD. \nConduct Scrum ceremonies; daily stand up, backlog grooming, Iteration planning, Iteration close & Retrospection. Facilitated code reviews, created best practices knowledge base, and created Lessons learnt knowledge base at the end of each sprint & project \nManage project budget, time lines, quality and P&L parameters \nEDUCATION: Bachelor of Engineering (Electronics & Communication) 1998, .Karnataka University   India \nPROFESSIONAL TRAINING AND CERTIFICATIONS: \nLead SAFe Agilist ~ PMP ~ Scrum professional ~Java Sun certification (2000) ~ TQMI Internal Auditor IS0 9001:2000 ~ Soft skills development \n\nPROFESSIONAL EXPERIENCE:\nClient: NCR Corporation, Atlanta USA                                                                        May, 2017 to till Date\nRole: Group Project Manager/Agile Program Manager\nProject Description: \n It’s a leading transaction based Hardware and software company\n\nResponsibilities: \nAs a Group project manager, I was responsible for delivery of the above requirements which was 25 people engagement and was spread across 4 different locations (Bangalore, OMAHA(USA), Atlanta(USA), Plano(USA)) \nResponsible for acting as Scrum of Scrum conducting daily meetings to review the progress made by scrum teams and helping to resolve their impediments. \nInvolve in techno/Functional discussions and coordinate with customer to provide right solutions and clarifications; \nCoordinate and manage CICD deployment & releases and dependency within different teams. \nEstimate work efforts for project sizing, and efficient work flow with risk free technical approaches. \nGuided & Coached teams with Agile / Scrum Processes, managed & groomed backlog.  \nAdministering the Jira board and presenting it to customer on alternate day basis. \nManaging project health through Process excellence team for providing better quality deliverables conducting code reviews, documents reviews and demos, Managing project budget, time lines, quality and P& L Parameters. \nEnvironment:  MDM, Core Java Servlets, DB Agonistic, SQL Server, DB2, HTML, JavaScript, Tomcat/Apache, WMS, .NET Framework 4.6, ASP.NET web forms. MSMQ, SQL Server 2008 R2, Pricing, Java Servlets, SQL Server\n\nClient: CitiXsys Inc, NY                                                                         November, 2015 to May, 2017\nRole: Group Project Manager/Lead Agile Program Manager\nProject Description: \nModernizing CitiXsys core suite is highly essential due to change in technologies and use cases in retail. Modernization program objective is to have complete suite re-engineering on technology agnostic, seamless and ease of deployment, maintenance, secure and highly scalable. \n\nResponsibilities:\nAs a Group project manager, I was responsible for delivery of the above requirements which was 55 people engagement and was spread across 4 different locations (Bangalore, Coimbatore, Russia and Delhi) \nConducting meetings with customer on Technical Requirements initially, document and sign off. \nResponsible for acting as Scrum of Scrum conducting daily meetings to review the progress made by 4 scrum teams and helping to resolve their impediments. \nInvolved in driving the team to achieve higher velocity & huge burn down rates in small two week Iterations. \nCoordinate and manage CICD deployment & releases and dependency within different teams. \nEstimate work efforts for project sizing, and efficient work flow with risk free technical approaches. \nGuided & Coached teams with Agile / Scrum Processes, managed & groomed backlog.\nAdministrating the JIRA board and presenting it to the customer on alternate basis.\nConducting monthly and quarterly business reviews with customer with agile project metrics and dashboards. \nVisiting customer counterparts at their location and helping team to provide effective demo and feedback and sign off. \nManaging project health through Process excellence team for providing better quality deliverables conducting code reviews, documents reviews and demos.\nManaging project budget, time lines, quality and P& L Parameters\nEnvironment: MVC 5.0, 4.0, ASP.NET 2.0, ASP.NET 3.5, 4.5,  .NET C#, Web Service, Sql Server 2013\n\nClient: Consensus Inc (Subsidiary of Target Corporation), San Francisco  July, 2015-November, 2015\nRole: Group Project Manager/Senior Delivery Manager\nProject Description: \nThe Consensus Engineering project is to maintain the existing POA application with feature enhancements. This caters to the in-house need of Target Corporation. Design and develop next generation POA and OOPIS systems. These caters to the Target sales team (in-store) and opens up a new sales channel on B2C. These applications/products will help Target to on-board customers, maintain their profiles, carrier selection, tariff plans, credit scores, insurance and other workflows of the telecom retail.\n\nResponsibilities: \nAs a Group project manager, I was responsible for delivery of the above requirements which was 120 people engagement and was spread across 2 different locations (San Francisco & Bangalore) \nResponsible for acting as Scrum of Scrum conducting daily meetings to review the progress made by 8 scrum teams and helping to resolve their impediments. \nInvolved in driving the team to achieve higher velocity & huge burn down rates in small two week Iterations. \nCoordinate and manage CICD deployment & releases and dependency within different teams. \nEstimate work efforts for project sizing, and efficient work flow with risk free technical approaches. \nGuided & Coached teams with Agile / Scrum Processes, managed & groomed backlog.  \nAdministering the Jira board and presenting it to customer on alternate day basis. \nManaging project health through Process excellence team for providing better quality deliverables conducting code reviews, documents reviews and demos\nEnvironment: Development: Linux, PHP 5.x, MySQL 5.x, HTML5, CSS3, Angular JS, jQuery, AWS cloud Services Third-party Integration Libraries: Verizon, AT&T, Sprint APIs,  Cyber Source auth, Aurus Pay, AppleCare Insurance, Square Trade Insurance Build/Release and others: GitHub, JIRA, Confluence, Jenkins\n\nClient: Acesse Corporation, Redwood City, CA                                                    April, 2014 to June, 2015\nRole: Senior Project Manager/Agile Program Manager/Scrum Master\nProject Description: \nAcesse has suite of online software products which are mainly used in China for content management, online marketing, Conference meetings and Mobile Chat related products \n\nResponsibilities:\nSet up the entire Jira processes, boards, trainings. \nTrained the entire organization on Agile and Scrum. \nAgile Program management for 4 of their scrum teams which were spread across Romania, Minneapolis USA, Redwood City USA and Hyderabad. \nConducted monthly management meetings and helped then with metrics and analysis of all scrum teams with respect to schedule, delivery and quality/ \nConducted all sprint ceremonies like Sprint Planning, daily stand up, reviews & retrospective meetings for all scrum teams \nWorked as co-product owner for some of their products and helped to build requirements and \nTraceability. Bridged the gap between PO & QA teams. \nBeing a single point of contact for their 50 member offshore team, conducted daily review meetings, monthly project progress reviews and coordinated production releases.\nEnvironment: PHP, My SQL, MS SQL, Android and IOS  \n\nClient: Angie’s List, Indianapolis, IN, USA                                                       Sep, 2012 to March, 2014\nRole: Senior Project Manager/Scrum Master\nProject Description: \nAngie's List is an American home services website. It is an online directory that allows users to read and publish crowd-sourced reviews of local businesses and contractors. Formerly a subscription-only service, Angie's List added a free membership tier in July 2016 \n\nResponsibilities: \nSet up the entire Jira processes, boards, trainings. \nTrained the entire organization on Agile and Scrum. \nAgile Program management for 3 of their scrum teams which were spread across Indianapolis & Palo Alto in USA. \nConducted monthly management meetings and helped then with metrics and analysis of all scrum teams with respect to schedule, delivery and quality/ \nConducted all sprint ceremonies like Sprint Planning, daily stand up, reviews & retrospective meetings for all scrum teams\nEnvironment: C#, HTML5, CSS3, MS SQL Server 2010 \n\nClient: Serengeti Law a business of Thomson Reuters, Seattle, WA                Dec 2010 –August 2012\nRole: Senior Manager, Project Manager\nProject Description: \nSerengeti Intelligence System – Analytics Dashboards  \nSerengeti Intelligence—a revolutionary way for law departments to easily access comparative and analytical information about your own performance—is ready to use within your Serengeti Tracker subscription at no additional charge. And, we do it right in the context of your matters, invoices, and workflows. \nFinancial – Compare your spending and risk data against similarly situated law departments to give you insights into your performance  \nOperational – Assess the efficiency of your law department operations and management  \nFirm – Evaluate your law firm portfolio and the performance of your law firms  \nEvaluator – Improve analysis of law firm rates, rate increases, discounts and how your company’s bottom line is affected\n\nResponsibilities:\nPreparing and maintaining project Management Plan. \nManaging the schedule and quality of the deliverables through day-to-day planning, tracking and monitoring of the project. \nTriaging and prioritizing the requirements with the designated Serengeti project/product Manager. \nHandling Estimations, Project Planning & Tracking \nMaintaining Quality Standards \nInteraction with the client and coordinating offshore activities. \nMaintaining billing & other finance details of the project \nData analysis, RCA, CAPA & Reporting \nRisk Management \nConducting Monthly and Quarterly Business reviews \nBuilding Proposals, SOW and working on Presales. \nResource Management\nEnvironment: ASP.NET, SQL Server 2008, SSIS, SSAS, SSRS, XML \n\nProjects managed and delivered between Jan 2009 – July 2007 at Aditi \nTechnologies as PROJECT MANAGER \n\nClient: Datacard Software India Pvt Ltd, Bangalore                                        Jan 2003 – July 2007\nRole: Java Developer, Performance Engineer, Lead in Java based\nProduct Title  \t:  Affina – Smart Cards Life Cycle Managing System\n\nClient: Infosys Technologies Pvt Ltd, Bangalore                                August 2002 to January 2003\nRole: Software Automation Test Engineer\nProject Title   \t:  CAMPUS PIPELINE \t\nEnvironment \t: RTM Rational Robot, Clear Quest, and CP Table Builder.\n\nClient: Webwavez Technologies, Bangalore                                                   July 2000 to July 2002\nRole: Software Engineer\nEnvironment: Java Servlets, JSP, MSSQL, JavaScript\n\nACHIEVEMENTS:\nBest Program Manager award from Client (Angie’s List – 2013) \nCEO, Aditi appreciations for contributions towards a Business Initiative in 2012.  \n“Best Mechanized Project” for a project Aditi Technologies, Bangalore ~“Best \nPerformer” award in Aditi Technologies, Bangalore  \n‘‘Most Significant Contributor’ (For EP3R1.1 release) award at Datacard Software India Pvt Ltd, Bangalore \n\n\n\n\n\n\n\n\n\n\n\n\n",
    "extracted_skills": [
        "agile",
        "angular",
        "asp.net",
        "aws",
        "communication",
        "confluence",
        "data analysis",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mysql",
        "php",
        "project management",
        "python",
        "r",
        "scrum",
        "sql"
    ]
}