{
    "id": "resume_5517b38f-972e-4dfc-a709-ecbe34c2b0c9",
    "metadata": {
        "filename": "Reddemma_Lankipalle.docx",
        "processed_date": "2025-09-24T08:45:50.209813+00:00"
    },
    "raw_text": "\nReddemma Lankipalle\nSoftware Test Engineer - Crozer-Keystone Health System\n\nNorristown, PA 19403\n\nreddemmaqa2_hr3@indeedemail.com - 4846862294\n\nHaving 8 years of experience in Software testing in the areas of Web based, Client-Server applications using Manual and Automation testing techniques. Well versed in Manual testing techniques and methodologies.\n\nSummary\n\nHands on experience in Quality Assurance including Functional, System, Smoke, GUI, Regression, and Integration, Retesting, User Acceptance Test (UAT) and Compatibility Testing of Web and Client server based Applications.\n\nExperience in both Agile and Waterfall Software Development Models.\n\nExtensive experience in designing Test Cases, Test Scenarios, Test Scripts and Test reports of manual and automated tests.\n\nExtensive experience in coordinating testing effort, responsible for test deliverables, status reporting to management and issue escalations.\n\nExperienced in complete Software Development Life Cycle (SDLC), Software Testing Life Cycle (STLC) and Bug Life Cycles\n\nExpertise on Black-Box testing techniques like BVA and ECP.\n\nExperienced in creating Requirement Traceability Matrix (RTM) to ensure comprehensive test coverage of requirements.\n\nExperienced in creating Test Summary Report for each sprint.\n\nInvolved in Testing in Agile Development Environment using TDD and ATDD approach.\n\nExperience in effectively coordinating with development team for any clarification on defects or reproducing the defects.\n\nExperienced in UI Automation Testing for Android/iOS Mobile Application using Appium.\n\nDeveloped Appium Scripts for Native Android/iOS Apps using Java.\n\nActively involved in peer review meetings, requirement analysis, defect reviews with the development team and training the team members\n\nWorking experience with defect tracking tools like Jira, Quality Center (QC) and Microsoft Test Manager (MTM).\n\nGood experience in database testing (SQL Server/Oracle) and SQL queries.\n\nExperience in web applications testing with Selenium IDE, Selenium RC, Selenium Grid and Selenium Web Driver, JUnit and TestNG, Maven, ANT, Jenkins.\n\nDeveloped framework using Cucumber, Junit, TestNG, Page Object Model, and Page Factory\n\nDeveloped BDD tests using Cucumber by writing behavior and step definitions & developed required Selenium support code in JAVA for Cucumber.\n\nGood experience in testing both SOAP and REST services using SOAP UI and Tested both XML and JSON formats.\n\nExcellent experience with source version control tools such as Subversion (SVN), TFS & Git.\n\nPerformed Automated Database testing using Selenium Web Driver and Microsoft JDBC API.\n\nExperience in doing performance testing of service using Headless Browser and JMeter.\n\nExcellent experience with Protractor, Java scripts to automate Angular JS application.\n\nExtensive experience in Functional Automation Testing tool Quick Test Professional ( QTP )\n\nExperienced in Test coordination between Onsite and Offshore team.\n\nWorked collaboratively and cross-functionally as part of a team as well as an independently.\n\n\nAbility to interact with end users, also quick learner and team player with good communication skills.\n\nExcellent analytical and problem solving skills with the ability to troubleshoot and strong oral and written communication skills.\n\nWORK EXPERIENCE\n\nSoftware Test Engineer\n\nCrozer-Keystone Health System\t-\tSpringfield, PA -\n\n2017-01 - Present\n\nDescription: The job of the TPA is to maintain databases of policyholders and issue them identity cards with unique identification numbers and handle all the post policy issues including claim settlements.\n\nThird party administrators are prominent players in the Managed Care industry and have the expertise and capability to administer all or a portion of the claims process. They are normally contracted by a health insurer or self-insuring companies to administer services, including claims administration, premium collection, enrollment and other administrative activities. A hospital or provider organization desiring to set up its own health plan will often outsource certain responsibilities to a TPA.\n\nResponsibilities:\n\nInvolved in creating Test Scenarios and Test Cases based on Use Cases and Business Requirements.\n\nTested application utilizing the Agile methodology and worked on multiple sprints on the project\n\nTested in Development, Staging and Production Environments.\n\nPrepared Test Summary Report.\n\nExecuted Tests, and evaluated Test results\n\nUsed Jira for bug tracking and reporting, also followed up with development team to verify bug fixes, and update bug status, Manage requirements and maintained test repository.\nHelped new team members to understand the Business requirement and system flow of an application\n\nWorking with the SQL statements to extract data from Oracle tables and verify the output data.\n\nUsed emulators and IOS simulators to perform the Mobile Testing.\n\nValidated the both Request and Response messages for REST Web Service.\n\nActively involved in daily \"Scrum meeting\" and provide status report.\n\nInvolved in design and implementation of Selenium WebDriver automation framework for smoke and regression test suites (TestNG, Maven).\nConducted the team meetings for discussing the status and issues.\n\nInvolved in writing automated scripts for angular JS application using protractor and Java scripts.\n\nLead a small team off shore and onshore, prioritize tasks and deliver.\n\nPerformed end-to-end testing of application and also verified compliance for software quality standards of the organization.\nDeveloped reusable functions and maintained in the function libraries.\n\nGood Experience in Agile methodology with SCRUM Process for the product development.\n\nUsed Selenium Grid to run test cases in multiple browsers and Platforms.\n\nDesign and developing the automation framework (Page Object Model Framework) for web and mobile application automation using selenium and Appium.\nExperienced in load and performance testing tool JMeter.\n\nDeployment of jobs on individual stages on Jenkins, and running automated and regression tests.\n\nEnvironment: Java, Selenium, Jira, Git, Oracle, MS Office, HTML, Windows XP/Vista, Appium (IOS/Android), Eclipse, Soap UI, Jmeter, Cucumber, Agile Process.\n\nSoftware Test Engineer\n\nInQuicker\t-\tNashville, TN -\n\n2015-07 - 2016-12\n\nDescription: This is a web based application provides different features to Customers and Employees of the Organization. Ones The Client tie-up with this organization the organization will give user name and password, if he gets and go through the portal the customer should be submit user name and password then after, that application is worth full to him, then he can access anywhere to this application. Front-end application entirely shows the customer medical reports and as well as Cap questioner that is client medical details, After customer finish the CAP questioner the Vidal organization employee's will handle the rest of thing issues of client's. Vidal Application has a set of features commonly deployed using two types of views,\n\nFront-End View (This is entirely for Client or customer, he only use this application) the Standard tabs for application (Login, Fitness, Diet, Illness, Stress, Lifestyle)\nBack-End view (This is entirely for organization employees, they only use this application) the Standard tabs for application (Login, Manage corporate, Data entry, Reports (Client Information, Manage password)). Responsibilities:\n\n• Involved in designing of Automation Test cases using Selenium WebDriver, Java, TestNG, and Maven.\n\n• Used Selenium Grid to run test cases in multiple browsers and Platforms.\n\n• Involved in implementation of Hybrid Test Automation Framework, Page Object Model using Selenium WebDriver, TestNG and Maven and Java.\n• Integrated Automation scripts (Selenium WebDriver API) in Continuous Integration tools (Jenkins) for nightly batch run of the Script.\n• Logged and managed defects using Microsoft Test Manager (MTM) defect management tool.\n\n• Developed automation script for Mobile Native applications (IOS, Android) using Appium, Java.\n\n• Used emulators and IOS simulators to perform the manual Mobile Testing.\n\n• Involved in preparing the functional test cases using Test design techniques data validation concepts Equivalence partitioning, boundary value analysis.\n• Strong experience with SOA architecture which include Soap and Restful Web Services Testing.\n\n• Performed web services testing with SOAP UI by validating request and response for XML, JSon files.\n\n• Involved in testing of services using SOAP/REST services using SOAP UI, Groovy Script.\n\n• Performed data driven testing by using JDBC and Groovy script as a data source in SOAP UI and configured SQL queries to fetch data from the Oracle database.\n• Involved in writing automated scripts for angular JS application using protractor and Java scripts.\n\n• Developed Selenium scripts in TestNG for parameterization using Data Provider annotation.\n\n• Involved in Maven configuration for running servers and scripts after the build.\n\n• Prepared manual & function test cases on web and mobile applications (Apple & Android) as per requirements.\n• Used Selenium Grid to run test cases in multiple browsers and Platforms.\n\n• Used Jenkins as continuous integration server to run automated test suites.\n\n• Used web-debugging tools like XPath, Firebug and Fire path to locate elements.\n\nEnvironment: Selenium WebDriver, Jenkins, Cucumber, SOAP UI, Maven, Appium (IOS/Android), TestNG, Jmeter, Eclipse, XPATH, Java, Android, SQL Server, JMeter, Protractor, SVN, Test Manager, Selenium Grid.\n\nSoftware Test Engineer\n\nAlliant Healthcare Products\t-\tRichland, MI -\n\n2014-06 - 2015-07\n\n\nDescription: Alliant Healthcare Products is a division of Alliant Enterprises LLC, established in 2002, to provide\n\nquality, cost-effective medical device products and services. The company's owner and CEO is Bob Taylor,\n\na U.S. Air Force and Air Force Reserve veteran with a track record of creating value for customers and\n\npartners in the medical device industry. Today, many of Alliant Healthcare's employees are veterans, and the\n\ncompany remains committed to supporting the veteran community. With a core focus on the federal market,\n\nAlliant Healthcare is not your average SDVOSB. Alliant employs an extensive team of government contracting\n\nexperts, customer service representatives, field sales representatives, and many more talented individuals.\n\nWith resources that surpass other SDVOSB's, Alliant is able to make sure government purchases receive the\n\ncare and attention they deserve.\n\nResponsibilities:\n\nProject is developed using agile methodology.\n\nPerformed Positive and Negative testing by inputting valid and invalid data\n\nParticipated in daily Scrum meetings to discuss the status of work done.\n\nUsed Selenium Grid to run test cases in multiple browsers and Platforms.\n\nPerformed Regression testing to ensure that changes made to software did not introduce any new bugs.\n\nInvolved in creating Requirement Traceability Matrix (RTM).\n\nImplemented Try Catch Block to handle unexpected events or errors.\n\nInvolved in designing of Automation Test cases using Selenium WebDriver, Java, Junit, and ANT.\n\nLogged and managed defects using Rally defect management tool.\n\nInvolved in Backend Database testing by using Sql Developer Tool.\n\nInvolved in testing of services using SOAP/REST services using SOAP UI, Groovy Script.\n\nBuilt automation test framework for client side products using Selenium WebDriver.\n\nInvolved in Knowledge Transfer, Training Session and Brainstorming.\n\nPrepared the Test Results document which summarizes testing activities and results.\n\nEnvironment: Selenium, SOAPUI, Rally, Ruby, Appium (IOS), ASP.NET, Oracle, UNIX, MS Office, HTML, Windows XP/Vista, Git, Selenium Grid.\n\nQA Engineer\n\nCommunication Infrastructure Corporation\t-\tOxnard, CA -\n\n2013-01 - 2014-05\n\nDescription: Communication Infrastructure Corporation (CIC) is an industry leader and single source provider\n\nfor microwave and point to multipoint radio networks. The CIC team has over 1,000 years of collective\n\nexperience in applications for wireless backhaul, ultra-low latency, oil & gas, rural broadband, mobility, and\n\nwireless communication links.\n\nResponsibilities:\n\nReviewed Business Requirement and Software Specification Requirements to achieve better understanding of the AUT.\nAnalyzed and reviewed Story Boards to gain overall understanding of the functionality of the application.\n\nDeveloped automated test scripts from manual test cases for Regression testing based on the requirement documents using Quick Test Professional.\nDeveloped and executed test cases integration, system and regression testing throughout the software development life cycle.\nImplemented Recovery Scenario Manager to handle unexpected events or errors.\n\nDefects were Tracked, Reviewed, Analyzed and Compared using Quality Center.\n\nParticipated in Test Case review and Test case sign off meetings.\n\n\n• Tested in Development, Staging and for Production Environments.\n\n\nPerformed end-to-end testing of application and also verified compliance for software quality standards of the organization.\nPerformed Automated Regression tests for every modified build.\n\nConducted weekly meetings with the developers and build Team.\n\nEnvironment: QTP 9, Quality center, Windows, Linux, Java, Tomcat, XML, VBScript, HTML, Oracle and TFS.\n\nQA Engineer\n\nVidal Healthcare\t-\tBengaluru, Karnataka -\n\n2011-01 - 2012-12\n\nDescription: Our dedication to payment technology and industry innovation is consistent; our mission is clear:\n\nto make it simple for business owners to collect money. Whether business owners accepts credit cards at\n\na retail storefront, processes payments on a mobile phone, promote gift cards, operates an online shopping\n\ncart, or electronically invoice clients, Pays cape offers financial products and services guaranteed to satisfy\n\ncash flow needs.\n\nResponsibilities:\n\nDeveloped Test Cases, Test Scripts, Test Scenarios, Test Data and Traceability Matrix.\n\nDeveloped and Implemented Test suites, which include features like Data Driven Framework for automated scripts using QTP.\nPerformed functional, regression, smoke, and end-end testing.\n\nGenerated automated scripts using QTP and documented them. Created and maintained functional & regression test suites.\nPlayed a key role in script enhancement process to streamline the regression testing process and to achieve continuous automatic test run.\nPerformed Mobile Testing and Automated Mobile Simulator using QTP.\n\nExperience in creation of library functions, Checkpoints, Data Validation Descriptive Programming using QTP.\nDeveloped and executed SQL Queries to perform database testing Environment.\n\nDesigned and documented test cases derived from requirements.\n\nManually verified the applications according to the requirements. Modified automation scripts as test case changes.\nAnalyzed the specifications in the User Requirements Document, Functional Requirement\n\nParticipated in Weekly meetings and walk through to discuss Defect Priorities.\n\nEnvironment: HTML, SQL Server 2005, and Windows 2003, Testing Tools: QTP 8.2, Mercury Quality Center 9, VBScript, and SVN.\n\nQA Tester\n\nHSBC\t-\tBengaluru, Karnataka -\n\n2009-10 - 2010-12\n\nHSBC is one of the world's largest banking and financial services organizations. With around 6,600 offices in both established and faster-growing markets, we aim to be where the growth is, connecting customers to opportunities, enabling businesses to thrive and economies to prosper and, ultimately, helping people to fulfil their hopes and realize their ambitions. We serve around 58 million customers through our four global businesses: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and\n\n\nGlobal Private Banking. Our network covers 80 countries and territories in Europe, the Asia-Pacific region, the\n\nMiddle East, Africa, North America and Latin America. Our aim is to be acknowledged as the world's leading\n\ninternational bank.\n\nResponsibilities:\n\nProject is developed using Waterfall methodology.\n\nUnderstanding the customer requirements and functionality of the application.\n\nIdentifying Test Scenarios by using Use cases.\n\nInvolved in Test Data preparation and Test execution\n\nAnalyzing the impacts of new CRs on existing scenarios and updating the Test cases.\n\nConducting various tests such as Smoke testing, GUI, functional and retesting, regression testing, user interface testing etc.\nInvolved in creating the Requirement Traceability Matrix (RTM).\n\nPrepared Test Summary Report.\n\nAnalyzing the Results.\n\nExecuted SQL queries for data verification to compare the expected results with database.\n\nEnvironment: Bugzilla, Oracle9i, Java, Toad, IE, Mozilla, Chrome Browser.\n\n\nEDUCATION\n\nBachelors of Technology in Technology\n\nSVU University\n\n2007\n\n\nSKILLS\n\nTESTING, SQL, JAVA, HTML, ORACLE\n\n\nADDITIONAL INFORMATION\n\nTECHNICAL SKILLS\n\nTesting Tools Selenium 2 Web Driver/RC/IDE/Grid, Quick Test Pro (QTP/UFT), Soap UI,Protractor, JMeter, Appium (iOS/Android), Jasmine, Cucumber\n\nDefect Tracking Tools Rally, Quality Center (9, 10, 11.0), Jira, Bugzilla, Microsoft Test Manager (MTM) Browsers Internet Explorer, Firefox, Chrome, Safari Programming Languages Java, Ruby, SQL, PL/SQL\n\nWeb Services SOA, REST, SOAP UI\n\nWeb Technologies HTML, Angular JS, AJAX, CSS, Java Script, XML, India Insure web service, SOAP, XSL, XSLT, XHTML, JSON\n\nScript Languages Java Script, UNIX Basics, SQL scripting, VB Script Platforms Windows 2003 Server, UNIX, Windows XP/Vista/7/8, MAC OS X Databases Oracle R12, MS SQL Server 2005, 2008 , 2014 Processes\n\nSoftware Testing Life Cycle, Defect Life Cycle, Testing Methodologies, Black Box Testing Techniques, Agile Process, BDD,TDD,ATDD\n\nIDE & Reporting Tools Eclipse 3.5,3.7,4.0, NetBeans 6.8\n\nMethodologies Agile Scrum, Waterfall\n\n\nBuild Tools Ant & Maven\n\nCI Tools Jenkins\n\nUnit Test Frameworks Junit & TestNG\n\nDomain Knowledge Health Care, Insurance, Wellness, Banking, ecommerce\n",
    "extracted_skills": [
        "agile",
        "angular",
        "asp.net",
        "communication",
        "css",
        "git",
        "go",
        "html",
        "java",
        "jenkins",
        "jira",
        "oracle",
        "problem solving",
        "ruby",
        "scrum",
        "sql"
    ]
}