{
    "id": "resume_e69491f3-5789-46f9-9118-9e1abad4c794",
    "metadata": {
        "filename": "Resume - Kishore Kotapati - 218E - BA.docx",
        "processed_date": "2025-09-24T08:45:50.321872+00:00"
    },
    "raw_text": "Kishore Kotapati\n\n\nE-Mail: Kishore_kotapati@yahoo.com\n                                                                                         Phone: 832-906-7001\nExperience Summary\n\nProfessional with 15 years of Overall Experience in IT and 9+ years Business Analysis.\n\nWorked on numerous projects as Sr. Business Analyst, Project Manager, Consultant, and Application Lead within HealthCare, Retail, Mobile, E-Commerce, Insurance, and Manufacturing Industries. \n\nFunctional and Domain experience in Oracle ERP Suites: JDE EnterpriseOne and OneWorld.\n\nExperience in Start-up Business Development – JiffyRides Mobile App and Fudbid E-Commerce.\n\nBusiness Intelligence expertise in IBM Cognos V7/8/10, JDE BI Publisher, Insight, Logi XML.\n\nSupporting front-end application APEX, Command, Trimble (Trimview), AggQC and Labsys.\n\nTechnical and Functional Knowledge in ERP D&L and Manufacturing Modules like Sales Order, Order to Cash (O2C), Purchase Order, Procure to Pay (P2P), Inventory Transactions, Work Order and Bill of Material.\n\nExperience in ServiceNow, EDI, VMI, Salesforce, OTC Derivatives, Visio, Business Services, PeopleSoft, WorldSoft, AS400, SQL, HTML, CSS and BMC Control M.\n\nExperience with Agile, SOA – Service Oriented Architecture, and Waterfall SDLC processes.\nProject Management Overview \t\n\nRecommended IT strategies, policies, and procedures by evaluating organization outcomes; identifying problems; evaluating trends; anticipating requirements.\nAccomplished IT team results by communicating job expectations; planning, monitoring, and appraising job results; coaching, counseling, and disciplining employees; initiating, coordinating, and enforcing systems, policies, and procedures.\nMaintained staff by recruiting, selecting, orienting, and training employees; maintained a safe and secure work environment; developed personal growth opportunities.\nAccomplished financial objectives by forecasting requirements; preparing an annual budget; scheduling expenditures; analyzing variances; initiating corrective action.\nMaintained professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; participating in professional societies.\nAcademic Credentials \t\nMasters in Computer Applications(MCA) from University of Madras, India.\nBachelor of Science(B.Sc) in Computers, Electronics & Mathematics from Sri Venkateswara University, India.\nProfessional Synopsis\n\nBoston Consulting Group (BCG)                                                                               Aug 2017 – Jan 2018\nRole: Sr. Business Analyst\nLocation: Chicago, IL - USA\n\nResponsibilities:\n\nServiceNow Project Implementation for modules: Project, Resource, Demand, Reports, Knowledge\nTracking resource allocation across multiple simultaneous projects.\nPlanned work - Who is supposed to be working on what and when?\nActual work - What are people spending their time on? How does that compare to the resource plan?\nProject administration: Prepare material for weekly project portfolio review meetings. \nGather updates from project managers and other stakeholders and populate into ServiceNow\nEnsure reports and dashboards are prepped prior to each meeting\nDocument and track action items from each meeting\nAgile Scrum\nWorking in an Agile Scrum environment with core concepts and ceremonies: Sprints, Stories, Scrums, etc.\nExperience running daily scrums, managing story backlogs, reporting on release progress and status\nRequirements management\nMeet with internal customers to assess new demands\nDocument business requirements in a standardized manner\nExcellent in Communication and Presenting to IT leadership positions (director, executive level roles)\n\n\n\nLafargeHolcim (USA and Canada)                                                                          Oct 2012 – Jun 2017\nRole: Sr. Business Analyst\nLocation: Chicago, IL - USA\n\nResponsibilities:\nPrimary involvement in various modules in ERP system JD Edwards EnterpriseOne.\nExperience in D&L and Manufacturing Modules like Sales Order, Order to Cash (O2C), Purchase Order, Procure to Pay (P2P), Inventory Transactions, Work Order and Bill of Material.\nWorking on retail strategy and implementation of E-Commerce project for North America that offers self-builders and smaller contractors simple and easy access to LafargeHolcim’s own building solutions as well as a wide range of other construction materials and services.\nApplied methodologies such as Agile, Scrum, Sprint process and prepare detailed specifications using case statements and related documentation.\nManage various projects and enhancements as a Project Manager to ensure they are completed on time, within budget and meet the design specifications, utilize Demand process using Service now.\nGather business requirements, develop the functional specifications and ensure the successful delivery of the solution. \nUsing Visio for process mapping and analysis to provide step-by-step user guidance documents.\nParticipate in the development, testing and rollout activities for implementations. \nFulfill the role of project management for the implementation of system enhancements requests. \nCoordination between end users and developers with regards to building the Cognos reports for various teams like PAM, Sales and Marketing, P2M etc.\nResponsible for support and resolution of application issues raised by users or identified as process deficiencies in the Marketing, Sales and Reporting applications for all lines of business in the country. \nWork with other support resources within IT, offsite support and consulting staff to communicate business requirements and to coordinate the testing, acceptance and promotion of system enhancements.\nWorking with Oracle (Cloud Services) to implement two integrated, hosted SaaS solutions customized to meet program requirements; all phases to date have been delivered on time and within budget.\nWorked on Business intelligence tools such as Cognos 7,8 &10, Insight, LogiXML, VMI and EDI applications.\nDevelopment of multiple reports using the reporting tool called Insight for various modules to auto generates and auto deliver.\nMaintain an ongoing relationship with Business Process Owners to facilitate cooperation and problem resolution.  \nWorked on various applications using SOA – Service Oriented Architecture process.\nConduct business process needs to formulate, define and document system requirements, and create detailed functional design specifications.  \nAssist in defining requirements, providing estimates and demand requests (Service Now).\nParticipate in providing input for Templates, functional requirements and test case scenarios. \nAssist in defining user needs and change requests.  \nResponsible for helping to ensure quality and consistency of project work, including project approach, standards, procedures, documentation, testing, and full transition of the project. \nExtraordinary associate at linking business and technical needs, worked closely with IT and application managers for gathering requirements.\nExpertise in developing documents for Functional Requirement Specification (FRD), Software Requirement Specification (SRS), Business Requirement Document (BRD), Use-case Specification and Non-functional Requirements.\nUsed MS Visio to carry out the Business Use Case Modeling and Business Object Modeling effort to develop the business architecture for rapid and controlled application development.\nExperienced in all phases of the Software Development Life Cycle (SDLC) using Agile Methodology including requirements gathering, analysis, design, implementation, testing and deployment.\nStreamlined project scope document template, and replaced the functional specification with a set of use cases and wireframes.\nParticipated in user acceptance testing (UAT) and testing of new system functionality.\nLead business users to effectively test and accept system enhancements and manage promotion process for these enhancements. \nWorked in FLS team supporting APEX, Command, Trimble (Trimview), AggQC and Labsys by maintaining strict SLAs.\n\n\nFudbid Inc.                                                                                                              Sep 2015 – Jan 2018 \nRole: Business Analyst\nProject: Mobile E-Commerce App\nLocation: Chicago, IL - USA\n\nResponsibilities:\n\nResearched a variety of technology directions\nManaged a variety of SaaS platforms (Github, Slack, Google Apps, Yesware, Buffer, Zendesk, Medium etc)\nImplementing Ecommerce portal for customer self-service\nRun our daily standup meetings\nCreated and updated tickets in our agile project management tool\nMaintaining CRM tool with client details and meeting schedules\nB2B Sales via Cold calling, Door knocking, appointment based etc\nPreparing Investor decks, pitch decks\nManaging Blog pages and Social Media Pages - Campaigns, Customer follow-ups etc\n\n\nJiffyRides Inc.                                                                                                              Sep 2013 – Nov 2017\nRole: Business Analyst\nProject: Mobile Application\nLocation: Chicago, IL - USA\n\nResponsibilities:\nAligning technology and business vision for this mobile application\nSelecting the technologies and platforms to use in our implementation\nWriting the detailed functional specifications\nWriting the architectural spec for the product\nFinding and hiring the resources\nCo-ordinate with the development team\nSCRUM Master - running the daily standups and solve the blocking issues\nQA - Testing the product/app and providing the feedback / issues\nField and triage all client problems\nManage social media communications, ad campaigns (Organic & Paid)\n\n\n\nBaxter Healthcare                                                                                                          Apr 2009 – Oct 2012\nRole: Business Systems Analyst\nProject: Integration Services and Global Reports (BI)\nLocation: Vernon Hills, IL - USA\n\nResponsibilities:\nUpgrading ERP system from WorldSoft to JDE EnterpriseOne-8.12.\nMDM (Master Data Management), a fully customized module. This module is used to manage the JDE Data across the Globe and also to sync data between current legacy system WorldSoft and EnterpriseOne 8.12.\nWorking on Distribution modules Order to Cash (O2C), Procure to Pay (P2P) and Inventory Management.\nPart of Baxter eServices Center project team to implement Ecommerce website that enables customers to: • Place and search orders • Track shipments • Search and print invoices • View account summary • Search pricing and product availability • Search allocation balances • Run product usage reports • Backorder inquiry • Search and browse Baxter’s online catalog\nGlobal Reports Development project - developing JDE reports across all the modules where the Output of the reports is going to be in XML by using BI Publisher.\nEDI Mappings for JDE Inbounds, JDE Outbounds, Exports and Other systems.\nWorked on EDIs like 850, 856, 810 and so on.\nProviding JDE Info to Integration Team to fill the gap.\nDeploying JDE Objects from PAR files.\nPreparation of Training Materials and providing training to Offshore team on BI Publisher.\nInteraction with Oracle team regarding BI Publisher.\nStatus meetings & Coordination with Onsite and Offshore teams.\n\n\n\n\n\n\nSony Pictures Entertainment                                                                                         Jan 2009 – Apr2009\nRole: Business Systems Analyst\nProject: Development and Data Interface\nLocation: Los Angeles, CA - USA\n\nResponsibilities:\nOnsite/Offshore Coordination.\nDevelopment of JDE Objects.\nApplications, Reports and TC Development.\nInteraction with the clients and Weekly Status Meetings.\nTesting and Documentation.\n\nEmersonNetwork Power (Stratos)   \t\t\t\t\t\t       May2008 – Dec 2008\nRole: Techno-Functional Consultant\nProject: Development and Support\nLocation: Chicago, IL - USA\n\nResponsibilities:\nSupporting on JDE Functional Issues.\nDevelopment of JDE Objects in all the Modules.\nProduction Support.\nProviding Solutions to Ad-hoc Queries.\nRegular Package Builds & Deployments.\nResolving the Printing Issues.\nExplaining the status of activities to the Client in the Weekly Status Meetings.\nPreparation of the Functional & Technical Specifications & Documents.\n\nLafarge\t\t\t\t\t\t\t\t\t       Jan 2008 – May 2008\nRole: Technical Consultant\nProject: Archive/Purge – Solix\nLocation: Bangalore, India\n\nResponsibilities:\nSharing JDE Functional Knowledge in Sales & Finance Modules with SOLIX team to integrate their system with JDE to do Archive/Purge\nProvided mappings for the Tables used.\nAnalyzing key fields in the tables for table relations. \nDeveloped New UBE Batch Applications as per the client's requirement in order to avoid Integrity Issues.\nProvided Functional and Technical Specs for the Objects Developed.\nInteracted with the Client to get the Information about Purge requirements.using Workday, Workday Mobile Applications and Sales Force SaaS Software Projects related to \n             Global HR.\nEmerson (Ridge Tools) \t\t\t\t\t\t                   Aug 2007 – Dec 2007\nRole: Technical Consultant\nProject: Retrofitting and Upgrade\nLocation: Bangalore, India\n\nResponsibilities:\nRetrofitting done for the JDE Objects.\nDone \"Table Conversion\" to Upload data from Flat Files to JDE Z-Files.\nUploaded Data from JDE Z-Files to JDE Master Files thru \"Interoperability\".\nComparison of Objects was done with PD (Production) Environment.\nAssigning the tasks to the team members & coordinating with them to get the work done before the dead lines.\n\nWeyerhaeuser                                                   \t\t\t\t\t  March 2007 – July 2007\nRole: Technical Consultant\nProject: Winchester Homes\nLocation: Bangalore, India\n\nResponsibilities:\nGiving offshore post implementation support to Weyerhaeuser on Manufacturing & Finance applications including standard JDE, custom and third party applications.\nAssigning the tasks to the team members & coordinating with them to get the work done before the dead lines.\nDeveloping the Reports based upon the specs given by the third party.\nInteraction with the third party members & the Onsite Coordinators to clarify the doubts.\nTechnical specs preparation and analysis, issue solving and working in close co-ordination till final delivery including preparation of test cases and unit test report.\n\nCardinal Health Inc.                                                  \t\t\t\t       Oct 2006 – Feb 2007\nRole: Technical Consultant\nProject: Benefits Realization Project\nLocation: Philadelphia, PA, USA\n\nResponsibilities:\nInvolved in all business requirement meetings and status meetings>>.\nGiving Onsite Technical support to Cardinal health’s Benefits Realization Project, Philadelphia Division on D&L, Finance and Manufacturing applications including standard JDE, custom and third party applications.\nAnalyzing the Client’s requirements in Functional View.\nDevelopment of Applications & Reports as per the Client’s Specifications.\nCoordinating with the Offshore Developers to get the Objects done.\nDebugging & Testing the Developed Objects and modifying them to meet the Clients requirements.\nExplaining the status of development to the Client in the Weekly Status Meetings.\nPreparation of the Technical Specifications and working in close co-ordination till final delivery including preparation of test cases and unit test report.\nTesting of application and promotion of object through Turn Over.\nDevelopment & Support given on the third party tool called DSI.\n\nJohnson Diversey Inc.                                          \t\t\t\t     June 2006 – Sep 2006\nRole: Technical Consultant\nProject: Support\nLocation: Bangalore, India\n\n\nResponsibilities:\nGiving offshore post implementation support to Johnson Diversey on D&L, Manufacturing, Finance & CNC applications including standard JDE, custom and third party applications.\nMaintaining inbound and outbound interface, invoice processing, user profile creation and maintenance, application and profile security management.\nSupporting the Client on Technical & CNC Modules.\nGiving support on the third party tools like APAG & Demand Planner.\nInteracting daily with Onsite Coordinators & end users to know about the client’s business process.\nPreparing & Updating the SMTD.\nAccessing/Preserving the documents from the central directories.  \n\nOEN India Limited                                                   \t\t\t\t      Jan2005 – June 2006\nRole: Technical and CNC Consultant\nProject: Development and Implementation\nLocation: Kochin, India\n\nResponsibilities:\nAnalyzing the Client’s Requirements.\nUnderstanding business process, study and analyze workflow to design solutions.\nDeveloped the Objects in Finance, Manufacturing and D&L modules.\nTesting and Debugging the Reports & Applications.\nDirect Interaction with Oracle/PeopleSoft Customer Supportto acquire suggestions/solutions.\nApplying ESU & ASUs as suggested by Oracle/PeopleSoft Customer Care.\nDone Package Building, Package Deployment & Product Packaging. \nTechnical Training & Knowledge Transfer given to the selected clients.\n\nA-One Hi-Tech Systems Private Limited.                      \t\t\t\t       May2003 – Dec 2004\nRole: Programmer\nProject: Development – Visual Basics & Fox pro\nLocation: Hyderabad, India\n\nResponsibilities:\nDevelopment of the new programs.\nCustomizations/Modifications of existing programs.\nTesting the programs to meet the client’s quality.\nPreparing the Documentations.\nTracking the data in the database.\nCoordinating the team members.\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "css",
        "html",
        "leadership",
        "oracle",
        "project management",
        "scrum",
        "sql"
    ]
}