{
    "id": "resume_5f2d6c1c-a84b-48e7-9398-75da0f92f0df",
    "metadata": {
        "filename": "Resume - PM Agile-Scrum.docx",
        "processed_date": "2025-09-24T08:45:50.418970+00:00"
    },
    "raw_text": "SANTHOSH ABRAHAM\nMobile - +1 732-423-5890; E-mail: santhoshkabraham@gmail.com \nLinkedIn ID:  https://www.linkedin.com/in/santhoshabraham/\n\t\nCore Competencies\n\t\n\t\nProfessional Summary\n\nDynamic, and results-oriented software professional with over 19 years of experience in IT industry as Project Manager, Program Manager, SCRUM Master, Business Analyst etc. \nCertified Project Manager Professional (PMP) with demonstrated project management skills in project initiation, scoping, resourcing, scheduling, budgeting, monitoring, risk and communication.\n13+ years of strong Project management skills and experience in managing both Traditional Waterfall & Agile projects using project management methodologies (PMBOK) and NYS Project Management Methodologies.\nCertified Scrum Master (CMS) with deep hands-on experience of 8+ years in facilitating, monitoring and reporting on the scrum planning cycle phases, from release pre-planning through sprint and capacity planning.\nA self-starter with proven track record of managing projects of various sizes & value up to 10M USD in Public Sectors (Both Federal & State), Healthcare, Manufacturing, Supply Chain, Distribution and Retail.\nExperienced in managing both EPMO managed projects and Non-PMO projects.\n8+ years of experience in managing projects in Public/Government (both Federal and State projects) sectors\n9+ years of demonstrated experience in business analysis and requirement gathering. \nAn effective communicator and leader with strong interpersonal, analytical, client and people management skills.\nExperience in Healthcare Data such as Medicaid and HIPPA protected data.\nExtremely versed in Software Development Life Cycle (SDLC) processes using waterfall and agile methodologies.\nExperience in managing NY State, USAID, World Bank and RFMH funded projects.\nExperience in managing distributed project teams and onsite-offsite model projects.\n\nTechnical Skills: -\n\nPM Tools\t\t-    Microsoft Project, Clarity, Service Now\nAgile/SCRUM Tools     -    Team Foundation Server (TFS) Scrum Version 1.0, Jira, Rally, Urban Turtle\nOther Tools\t\t-    Visio, Microsoft Office 365, SharePoint, HP Quality Center, Service Now (ITSM)\nMethodologies\t-    Project Management Body of Knowledge (PMBoK), Waterfall, Agile (SCRUM),    \n                                             SDLC, Joint Application Development (JAD)\nRDBMS \t\t-    Oracle \nOS\t\t\t-    Windows, iOS\n\n\nProfessional Experience\n\nProject Manager – NY State Office of Mental Health, Albany, NY – Since Jan 2012\n\nThe Psychiatric Services and Clinical Knowledge Enhancement System (PSYCKES) is a HIPAA compliant, web-based portfolio of web applications using the administrative data from NYS Medicaid claim database to support quality improvement and clinical decision-making in New York State. \n\nAs part of NYS Health Cluster EPMO, responsible for managing the IT software application development of this multi-year and multi-million dollar (10M) value project and its deliverables for NYS Office of Mental Health (NYS OMH) using Agile SDLC framework\nPreparing and managing various project management plans, creating WBS, schedules and monitoring the progress on a day to day basis and keep the project documents up-to-date. \nMaintaining the project metrics and provide monthly as well as bi-weekly project status reports to EPMO, Executive Team,  Project Sponsor and Agency Senior Management\nFacilitating the various meetings, user story workshops and other sprint related meetings with business owners, project sponsors and other stake holders.\nAlso as Scrum Master, manages the Release Planning, Sprint Planning, Backlog Grooming, Daily Stand-ups, User Story Writing and Sprint Reviews.\nResponsible for reporting the progress of project (sprint and releases) to the management using various scrum artifacts from backlogs to burndown charts.\nManaged a team of 11 team members in the development of PSYCKES application suite comprises of multiple web applications and iOS App\nCoached and transformed the PSYCKES project team into Agile/SCRUM mode from traditional development practices and guided them thru the transition process.\nActively participated in the process of defining the Agile Process and preparation of Agile Guide book for NY State-OMH\n\nEnvironment:  Web based Architecture - .Net & Oracle database using Agile and PMBoK methodologies\n\nProject Manager - FreeBalance Inc., Washington DC, USA – Dec 2009 till Dec 2011\n\nGovernment of Mongolia (Ministry of Finance) - A World Bank funded project for Government of Mongolia towards Economic Capacity Building Technical Assistance Credit (ECTAC) program to implement & rolling out the Finance & Budgeting System software for various government institutions across the country.\n\nAs part of PMO, successfully managed the software application development, implementation and roll out of centralized Finance and Budgeting system across various ministries of Government of Mongolia using Agile/Scrum framework \nManaged the Release Planning, Sprint Planning, Backlog Grooming, Daily Stand-ups, User Story Writing, Sprint Reviews and communicated the various status reports respective stakeholders.\nResponsible for setting and managing project stakeholder expectations throughout the project lifecycle\nDeveloped and managed the Project management plans and project documents and reported the status regularly to the World Bank Team, Government Agency and project management team.\nIdentifying, tracking, and removing impediments to project success\nFacilitated meetings with Government officials up to ministers, sponsors and major stakeholders.\nWorked as a Liaison between the IT team, project stakeholders and external vendors for successful completion of project deliverables. \nEffectively managed the onsite and offshore team of 10 members to successful completion of the project\n\nEnvironment:  Web based Architecture - Java Enterprise Edition on Oracle DB using Agile and PMBoK methodologies\n\nGovernment of the Republic of Uganda (Ministry of Public Service) - A World Bank aided project for Government of Uganda to implement & roll out the Integrated Personnel & Payroll System across various government institutions throughout the country.\n \nAs part of PMO, successfully managed the software application development and implementation of Integrated Personnel & Payroll System (IPPS) project right from planning until closure of phase - I and support handover using Agile/Scrum methodologies\nDeveloped and maintained all project management plans, schedules and project documents and reported the regular status to the Ministry, Sponsor and other major stakeholders. \nManaged the onsite and offshore project teams in such a way that the deliverables are delivered in a timely fashion till successful completion \nResponsible for managing the project requirements and reviewed the progress against the requirement traceability matrix. \nSuccessfully managed the Phase-I implementation of Integrated Personnel & Payroll System (IPPS) using a team of 8 members and completed the rollout across 9 ministries and 15 local governments of Uganda within the scope and budget.\nWorked with local H/w partner in procurement of applicable H/w components according to the design document and managed their resources in setting up the central data center and disaster recovery sites.\nManaged the Integration of IPPS system with Financial Management Information System(IFMIS) of Ministry of Finance & Pension Management System of Uganda Peoples Defense Force (UPDF)\n\nEnvironment:  Web based Architecture - Java Enterprise Edition on Oracle DB using waterfall and PMBoK methodologies\n\nProject Manager - 3i Infotech Inc., NJ, USA – Aug 2006 to Dec 2009\n\nThe Partnership for Supply Chain Management (PSCM), Arlington, VA, USA - Partnership for Supply Chain Management firm funded by the U.S. Agency for International Development (USAID) in procuring pharmaceuticals and other related products needed to provide care and treatment of people with HIV/AIDS and related infections and distributing in more than 20 developing countries across world.\n\nResponsible for project level management in the planning, design, development, implementation, operation support, delivery and client management \nManaged and successfully rolled out the implementation of supply chain management modules across the 16 PSCM network countries\nHeaded the functional & technical team to support the business process study, analysis, development & implementation of Oracle ERP & CRM solutions\n\nEnvironment:  Web based ERP solution using Oracle Forms & Reports on Oracle DB using Waterfall methodology\n\n\nRoyal Crown Bottling Corp. (RC Cola), Evansville, Indiana, USA – is engaged in Beverage Manufacturing, Bottling & Distribution in multi-company, multi-location Environment.\n\nResponsible for implementation project from project planning till handover to live support\nSuccessfully implemented and integrated the software with handhelds in the central location and rolled out to eight warehouses across the 4 surrounding states of Indiana. \nManaged the roll out of route accounting of 100 plus sales trucks (routes) using handheld & its integration with ERP solution. With this integration RC Cola achieved about 75 – 80 % of performance increase in their warehouse operations and hence the inventory control.\nProvided the functional support in defining the scope for EDI integrations of the Business intelligence Tool, Smart Forecast Tool and Customer EDI’s with ERP interface. This includes Wal-Mart, Red bull, Dr. Pepper & Seven Up etc. \nHandled a 15 member cross functional team across on-site/offshore during the implementation \n\nEnvironment:  Client-Server Architecture using Oracle Forms & Reports on Oracle DB  \n\nFiberglass Coatings Inc., St. Petersburg, Florida, USA – engaged in Manufacturing of Custom Specific fiberglass Products & Support and Retail business of third party fiberglass & related products.\n\nManaged the project initiation, planning, business process study, gap analysis and customization initiation of ERP implementation project\nProvided functional support in consulting the business process study of procurement, inventory control, warehouse management, sales and manufacturing in a multi company, multi-location environment\nProvided functional support in defining the scope for the integration of Point of Sales (POS) solution with ERP interface\n\nEnvironment:  Client-Server Architecture using Oracle Forms & Reports on Oracle DB \n\nProgram Manager / Project Manager - 3i Infotech Ltd, Chennai, India - Mar 2004 to Aug 2006\n\nProgram level responsibility in managing the delivery of ERP Implementation projects across India geography \nSuccessfully managed the delivery of 10 projects in diversified business verticals like Manufacturing, Distribution, Pharma, Auto & Chemicals\nAccountable for Project, People, Client & Channel Partner Management\nSupported Product Management Group in finalizing the product roadmap by ensuring that the best industry practices of Pharma, Distribution, Manufacturing and Food verticals are incorporated into the future releases\nSupported the pre-sales team by conducting scope analysis to understand client’s key business issues and provided appropriate solutions.\nHandled a team of 35+ cross functional teams members across India geography\nActively involved in setting up competency centers & capacity building across regions \nProfitability monitoring through timely invoicing & collections\nHeaded the functional team to support in business process analysis and process re-engineering during the implementation cycle\n\nEnvironment:  Client-Server Architecture using Oracle Forms & Reports on Oracle DB \n\n\n\nDeputy Manager (Systems) - Hydro S & S Industries Ltd., Chennai, India – Dec 2002 to Mar 2004 \n\nManaged the entire ERP implementation (Oracle based ERP) from Business Requirement Analysis, Solution Mapping, Testing of Business Scenarios, End user Training & support\nPart of Business Strategy & IT Budget planning team \nCo-ordination with Software as well as Hardware Vendors for IT related purchases\n\nIT Manager - R.A.K Ceramics Group, Ras Al Khaimah, U.A.E – Apr 1998 to Sept 2002\n \nIT Budget planning, analysis, evaluation of new software and hardware solutions\nHeaded the ERP Implementation of two group companies & support of day to day issues\nMaintain vendor relationships and manages the procurement of H/w and S/w products\n\nData Center Officer - CITICORP Information Technology Industries Ltd., Mumbai, India – Jul 1997 to Mar 1998  \n\nSr. Programmer-cum-Analyst - Midwest Imports & Exports Pte Ltd., India – Oct 1995 to Jun 1997\n\nEducation & Certifications: - \n\nMCA (Masters in Computer Science & Applications) from Bharathidasan University, India (1995).\nCertified Project Management Professional (PMP) from PMI\nCertified SCRUM Master (CSM) from Scrum Alliance\nAdvanced Diploma in RDBMS (Oracle) from Software Solution Integrated Ltd, India.\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "java",
        "jira",
        "oracle",
        "project management",
        "r",
        "scrum"
    ]
}