{
    "id": "resume_ac182a63-909b-47cf-81aa-8148760e7e08",
    "metadata": {
        "filename": "Robinson.docx",
        "processed_date": "2025-09-24T08:45:50.809605+00:00"
    },
    "raw_text": "Robinson Edward\nBusiness Analyst/Consultant\n\nHighly accomplished Business Analyst / Consultant with proven track record of managing complex IT projects and exceeding expectations. Practiced in clarifying business requirements, performing gap analysis between goals and existing procedures/skill sets and designing process and system improvements to increase productivity and reduce costs.\n\nSYNOPSIS\n\nDiligent and Result driven MCA professional with more than 10 years of experience as a Business Analyst / Consultant\nDomain Experience: Banking, Payments & Supply Chain Management.\nAnalyse and document the business process flows and high level scenarios by interacting closely with Customers\nPrepared detailed Functional requirement document(FRD) based on the Business requirement document(BRD) along with the coordination of Design Team for accounting systems\nSupport the Project managers in Estimations, Test Planning and Test Strategy.\nProject Scheduling, Resource pooling and conduct meetings with stakeholders for project implementation\nPrepared Gap Analysis where Functional and domain gaps are identified and advised.\nProcess Maps and Requirement Documentation based on User Inputs.\nValidation of Data using SQL queries and Analysis of data post migration\nInvolved in preparation of User Manuals & provided training for the technical & bank users\nWorked on Testing Projects and has gained good knowledge of SDLC.\nPlanning and organizing Test Team during Preparation and Execution Phases.\nHandled the testing team in preparing and reviewing the scenario & test cases and also clarifying the queries related to functional requirements. Core competence includes depth knowledge in Finacle & Global Pay Plus (GPP)\nTriage defects to review the validity and business severity to Manage defect delivery\nUpdating customers periodically and escalating Issues and Risks to ensure the test schedule is on track\nProduce functional UAT Business scenarios and review SIT and UAT test cases\nChange Request (CR) document preparation and impact analysis for the same and provided Estimation of Cost and Effort\nKnowledge of Behavior Driven Development (BDD)\nPlayed the role of a System & Audit Analyst in Retail Banking for ICICI Bank & Dhanlaxmi Bank, expertise includes in depth knowledge of Branch operations, KYC, AML, Audit & Compliance and Risk analysis\nAchievements include nomination for Leadership Program by Cluster head and preparation & execution of Live Project in Customer service (FOCUS) by meeting the customer and gather requirements and providing a new process and implement the same to increase the customer service. \nPlayed the role of a EDP Analyst in Paper & Medical Industry which involves Interaction with the user and the management and provide feasible solution & customized reports based on the requirement in an ERP Application\nPossess strong leadership, interpersonal, decision-making, critical thinking, problem solving and communication skills used to foster positive relationship with management, internal staff, and clients, honed through extensive experience as Module lead and handling upto 15 members very well towards the project delivery.\n\n\n\nAreas of Expertise\n\nExpertise in End to End Testing of Banking and Financial Services Applications\nExpertise in Functional testing of web based applications\nExpertise in defining defect management process\nExpertise in translating Business requirements to understandable systems requirements.\nExpertise in Functional Test scenarios, Test Execution and Bug reporting\nExpertise in Managing status reports, analysis and decision-making for a change request. \nGood domain knowledge of Core Banking Modules especially Retail Banking & Payments\nExpertise in analysing the Functional requirement & Business Rule document.\n\nExternal certification\n\nISTQB Certified\n\nTechnical Skills\n\nMethodologies\t\t\t\t: SDLC, Waterfall Model, Agile / Scrum\nDatabases\t\t\t\t: MS Access, SQL\nBusiness Process Modeling Tools\t: MS VISIO\nQuality Management\t\t\t: HP Quality Center, JIRA, Rational Clear quest, Red mine\nGUI/Tools\t\t\t\t: MS Word, MS Excel, SnagIt, Photoshop\nDocumentation Tool\t\t\t: SharePoint, MS Office Suite (Word/Excel/Power Point)\nLanguages\t\t\t\t: C, JAVA\nApplication\t\t\t\t: Finacle, Global Pay Plus, Flexcube, JD Edwards\n\nExperience Sum\tmary\n\nIT World Build, US\t\t\t\t\t\t\t         Apr 2016 to \nBusiness Analyst\nFinance & Inventory Application\n\nProject Description:\nThis application is developed to run a small business and manage both the financial and Inventory. The application includes business functionalities such as Accounting, Finance, Inventory, Sales, Purchase, Point of Sales, Payroll, reports and Branch Management.\n\nResponsibilities:\nAnalyzed the overall system/application and gained an overview of its functionalities\nCollaborated closely with stakeholders and cross functional groups to gather, analyze and document Business and Functional Requirements (BRD and FRD)\nFollowed Software Development Life Cycle (SDLC) using Agile methodology\nObtained Business Signoff for the deliverables after detailed reviews by the stakeholders, project manager and business system analyst\nAssisted the project manager in creating project plans and scheduling and tracking project timelines\nWorked as a primary liaison between the business users and the developers throughout the project cycle\nPlanned and attended SCRUM meetings \nConducted Functional Requirement Walkthrough sessions with the business and development teams\nDeveloped test scenarios and implemented test plans\nPerformed User Acceptance Testing (UAT), Integration testing and Regression testing\nENVIRONMENT: JIRA, MS Office, Agile/Scrum, ERP, SQL\n\nBarclays Bank, UK\t\t\t\t\t\t\t\t         Jun 2013 to Jan 2016 \nBusiness Analyst\nProject: Masspay – Global Payments\nProject Type: Implementation – System Testing & System Integration Testing\n\nProject Description:\nBarclays an International bank with a strong European presence is implementing SEPA with Global Pay Plus application for Masspay\n\nResponsibilities:\nUnderstanding the Business requirements, Functional specification documents, Functional requirement document and Interface requirement document.\nAnalysis of Requirement and providing domain guidance to the team\nUnderstanding the Business Requirement Document and involved in Preparation & Review of Functional Requirement Document\nPreparation and Review of Testware - Test Scope, Test Scenarios, Test conditions, Data Guidelines and Run Plan within the timelines\nCollected the related data guidelines and ensured the same is updated in the system by the business to perform the UAT\nPrepared Requirement Traceability Matrices (RTM) and managed every change requests effectively throughout the software development life cycle.\nMapping the business rules to the requirement associated with it and ensure that the same is triggered during execution\nValidate the data for the reports at the backend using SQL queries\nCreated Change Request (CR) Documents. Analyzed the change request and co-ordinate the changes required with the development team and business users\nCo-ordination/Liaison between the Client and the testing team.\nReview and Analysis of Testware.\nReview clarifications raised by testers and facilitate closure\n\nENVIRONMENT: QC 10.0, Global Pay Plus 3.4, MS Office, XML, Agile/Scrum\n\nThe Housing Bank for Trade & Finance (HBTF), Jordan\t\t\t\tJan 2013 to May 2013\nLead Business Analyst\nProject: Implementation of Core Banking System \nProject type: Implementation – Systems Integration Testing & User Acceptance Testing\n\nProject Description:\nHBTF a leading commercial bank in Jordan wanted to replace its legacy system with Finacle V10.3.6 (CBS) for its banking operations.\n\nResponsibilities:\nUnderstanding the Business requirements and Functional specification documents.\nPreparation of Testware - Test Scope, Test Scenarios, Data Guidelines & Run plan\nGuided and facilitated the team by answering queries promptly especially during UAT execution.\nCo-ordination/Liaison between the Client, Development team and the testing team.\nPerformed data analysis using SQL queries.\nInvolved in migration of Data from one DB to another DB\nPerformed GAP Analysis by comparing the existing system to the future system to create “AS-IS” and “TO-BE” flow charts and generated impact and risk involved.\nResponsible for efficient document management and Version Control using MS SharePoint and to update the document and transmit the information to the management\nReview and Analysis of Testware.\nDefect Analysis, Co-ordination and involved in Defect meeting with developers & business users\nInvolved in preparation of Functional Analysis\nReview of Hold case analysis and Deferred case analysis\nReview clarifications raised by testers and facilitate closure\n\nENVIRONMENT: Rational clear quest, Red Mine, Finacle 10.3.6, CRM, SQL, Waterfall\n\nRatnakar Bank Ltd, Mumbai\t\t\t\t\t\t\tMay 2012 to Dec 2012\nBusiness Analyst\nProject: Implementation of Core Banking System\nProject Type: Implementation – Systems Integration Testing & User Acceptance Testing\n\nProject Description:\nRatnakar Bank Ltd, a bank in India which is having more than 100 branches PAN India wanted to have a new Core Banking system for its banking operations.\n\nResponsibilities:\nUnderstanding the Business requirements and Functional specification documents.\nPreparation of Testware - Test Scope, Test Scenarios, Data Guidelines & Run Plan\nGuided and facilitated the team by answering queries promptly especially during UAT execution.\nCo-ordination/Liaison between the Client, Development team and the testing team.\nPerformed data analysis using SQL queries.\nInvolved in migration of Data from one DB to another DB\nCoordinated tasks with multiple systems and departments to successfully complete the UAT effort\nPlanned and facilitated AS-IS Business process and workflow models to create TO BE Business scenarios. \nCreated Non Functional Requirements (NFR) with the inputs from Technical Architects \nReview and Analysis of Testware.\nDefect Analysis and Co-ordination.\nCreated Change Request (CR) Documents. Analyzed the change request and co-ordinate the changes required with the development team and business users\nPrepared the User Manuals and provided training for the technical and bank users\nEquipped in learning cross-functional modules to understand the system better and provide alternate solutions\nAssisted Project manager on  preparing  the Business Proposals\n\nENVIRONMENT:  JIRA 5.0, Finacle 10.2.9, CRM, MS-Office, SQL, Waterfall\n\nDhanlaxmi Bank Ltd, Chennai\t\t\t\t\t\t\tSep 2011 till Apr 2012\nSystem & Audit Analyst\nRetail Banking\n\nResponsibilities:\nManaging a team of 10 members and taking care of the operations.\nExamining the current system of the Bank\nInteracting with users to gather business and technical requirements\nIdentified opportunities for Business Process Improvement and initiated efforts to make improvements.\nAnalyse requirement to provide solutions satisfactory to the Bank, taking into account established standards and guidelines\nTranslating business requirements to functional specification document\nIdentifying the impact and risk for the new or modified system\nLiaising with developers and testers to support implementing the new or modified system\nConducting due diligence for the Account opening forms.\nMonitoring registers such as cash, security items, deliverables, inward, outward, key movement & gold loan registers.\nMonitoring dormant, deceased claim, lien marked accounts & KYC documents of the customers\nMonitoring AML (Anti Money Laundering) such as high value transactions, genuine of cash transactions above 10 lacs and reviewing transactions in new accounts.\nEnsure that the daily CRL (Cash Retention Limit) is maintained and surprise cash verification being conducted randomly.\nEnsure that gold loan packets, deliverables, kits and security items are in dual custody.\nEnsure that all RTGS & NEFT transactions are successful.\nMonitoring routing accounts on a daily basis and suspense account on monthly basis.\nGenerating & validating daily reports such as Cash, Authentication, Batch Journal and exception reports.\nReview of requests lodged in E-tracker for customer requests and account opening forms.\nChecking of all vouchers for the day and review for correctness of authorization.\nEnsure updation of lockers issued in online module and locker access register.\n\nENVIRONMENT:  Flex cube, Windows 95/98/NT/2000, MS-Office, QC\n\nICICI Bank Ltd, Chennai\t\t\t\t\t\t\t\tJan 2007 to Sep 2011\nAudit Analyst\nRetail Banking\n\nResponsibilities:\nManaging a team of 21 members and taking care of the entire branch \nAnalysing the current system and understanding the operations of the Bank\nInteracting with the users and gather requirements\nProvide specifications for new or modified systems\nWorked with Business Users and Stakeholders if there were requirement changes to be on the same page.\nPerformed end to end testing of the new functionality designed before it went for the release\nLiaising with IT staff such as programmers to produce new systems\nMonitoring of various Registers such as Cash, Deliverables, Inward, Outward, Key movement and Fake notes register.\nSubmission of various reports to Corporate office such as CAT1, CAT2, CAT3, CAT5, COMP1, COMP2, PFORM and ISRA.\nMonitoring of Office Accounts.\nGeneration of Exception, Irregularity, Mitra, Service Wait time reports and unresponded entries on a daily basis\nReconciliation of reports such as Inventory status, Gold coin, locker, Deliverables, Travel Cards and I-KITS on a fortnightly basis\nMonitoring of KYC & AML transactions.\nConducting Customer service meet on monthly basis and submitting the same to Regional office.\nSubmission of Self Audit MIS and Control Returns on a monthly basis. \nPreparation of SOAX report for the branch on a Quarterly basis\nReconciliation of Fixed Asset list for the branch on a Quarterly basis\nInternal Audit Compliance\nPeople Management and Time Management\nScrutinizing the documents pertaining to Trade Finance and FOREX such as Outward Remittances, Import payment, Purchase and Sale of Foreign Currency.\n\nENVIRONMENT: Windows 95/98/NT/2000, Finacle, Siebel CRM, Finacle CRM, Finnone, MS-Office, QC\n\nJohnson & Johnson Ltd, Chennai\t\t\t\t\tJun 2006 till Dec 2006\nEDP Analyst \nSupply Chain – Material Management, Logistics, Reports\n\nResponsibilities:\nWorking in an ERP Environment - JD Edwards (MM)\nInspected existing system and documents, and reviewed new Business Requirement Documents\nConduct Requirement Walkthrough Sessions with Technical & QA teams to analyse on the management reports.\nRecord the desired reports in Excel with sample data and presented to the Development and Business users for sign-off\nMaintaining Stock Inward & Stock Outward register and preparing reports on a monthly basis.\nPerforming Inventory count and preparing accuracy report.\nInteraction with the user and Customers over phone as well as through Email and gathering requirements\n\nENVIRONMENT:  Windows 95/98/NT/2000, JD Edwards-MM, MS-Office\n\nSouth India Paper, Chennai\t\t\t\t\tJul 2005 till May 2006\nEDP Analyst\nSupply Chain – Inventory Control, Invoicing, Logistics, Sales & Distribution, Reports\n\nResponsibilities:\nPlacing indent on Manufacture & Arranging for clearance. \nGoods Receipt Note Preparation & Invoicing. \nInventory Control & Stock Reconciliation. \nPreparing Credit Notes / Debit Notes. \nGeneration of Various Reports (Weekly, Monthly & Yearly). \nPreparing Trial Balance, MIS, Balance sheet and Profit & Loss account. \nDocument the requirements gathered from the users and management \nProviding the customized reports based on the requirement\n\nENVIRONMENT:  Windows 95/98/NT/2000, Foxpro, MS-Office.\n\nEducational qualifications\n\nMasters of Computer Application (MCA) – Madras University, Chennai, India. (2005).\nBachelors of Computer Science (BS) – Madras University, Chennai, India. (2000).\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "critical thinking",
        "data analysis",
        "java",
        "jira",
        "leadership",
        "problem solving",
        "scrum",
        "sql"
    ]
}