{
    "id": "resume_ba86362a-b231-4dff-816a-86bc54a76490",
    "metadata": {
        "filename": "ronith s.docx",
        "processed_date": "2025-09-24T08:45:51.173286+00:00"
    },
    "raw_text": "dayakar@americanitsolutionsinc.net\n904-344-1035\n\n Summary:\nOver 9 years of experience in Software Development Life Cycle (SDLC) with nice blend of expertise and leadership, be it requirements gathering, analysis (OOA), prototyping, design (OOD), development (OOP) or maintenance and testing of client-server applications. \nGood experience in developing applications using Java and J2EE technologies with Servlets, JSP's, SOAP and REST Web Services, JSTL, Spring libraries, Struts, JDK 1.7, Java Beans, Applets, JDBC, XML, HTML, Java Scripting, MYSQL, RDBMS, Prime faces, ORM tools like Hibernate, HQL, Apache-Tomcat, JBoss, Oracle Web Logic Server, Glassfish Application Server. \nStrong experience in designing and developing component based reusable GUI based applications. \nExpertise in Java technologies like Core Java, J2EE, Java Script, Servlets. Expertise in Curam Framework. \nHands on experience in Curam Framework.\nExpertise in front-end/presentation tier development using Struts 1.2 frameworks with Struts Tiles, StrutsValidator, Servlets, JSP, JSF, JSTL, JQuery, JavaScript, HTML and CSS.\nExperience with Messaging Queue Technologies such as JMS and Rabbit MQ \nExperience in writing the UNIX and Linux shell scripts in order to execute the jobs. \nExperience in web application design using open source Spring, JSF& Struts Frameworks and \nJava & J2EE Design Patterns. \nStrong Experience in Oracle and backend programming. Good experience in SQL, PLSQL. Normalization, creation of stored procedures and function.\nExperience in implementing open source frameworks like Struts, Spring MVC, Spring Web flow 2.0, Hibernate, iBatis ORM (Object relational Mapping) and AJAX. \nHighly proficient in developing n-tier Enterprise application with J2EEdesign patterns like MVC, Business Delegate, Session Façade, DTO, DAO, Front Controller, Factory and Singleton \nSolid experience in lightweight POJO based frameworks like Spring 2.5 (Dependency Injection, IOC, Remoting, ORM, DAO, AOP, JMS and Business Integration). \nExtensively worked on Java, JSP, Servlets, Swings, MVC Architecture (Struts and Spring), Spring, Spring Web flow 2.0 Hibernate, EJB, JMS, AJAX, JSF, Web services, Java Script, HTML, Angular JS, Bootstrap JS, DHTML, JSTL, CSS, and Custom Tag Libraries to develop JSPs. \nGood Knowledge on JavaScript libraries which include Angular JS versions (1.0,2.0), React JS, Node js, backbone.js and GWT.\nAnalyzed and built Administration module for an website. \nExperience in developing B2B website using IBM WebSphere E-Commerce. \nHands on experience using IDEs like Eclipse, Rational Application Developer (RAD), Web Sphere Studio Application Developer 5.0Rational Software Architect (RSA). \nExtensively worked on relational databases like Sybase, DB2, MS SQL Server, Oracle 9i and MySQL. \nStrong in object oriented design/analysis, UML modeling, classic design patterns and J2EE patterns. \nDesigning and implementing scalable, RESTful and micro services-based back-end. The back-end is being written in Java using spring boot for simplicity and scalability. \nDeveloped RESTful web services interface to Java-based runtime engine and accounts. \nEnd to end application design and development using RESTful APIs, Micro-services, Spring boot, Spring Cloud, HTML5, CSS3, Bootstrap 3.0 and JQuery. \nProficiency in using Amazon Web Services API's, advanced AWS Services and worked on AWS compute services such as Elastic Computer Cloud (EC2), Rational Database Service (RDS), Lambda \nSubversion SVN, CVS, GIT and Visual Source Safe as versioning software tools. \nExperience in developing applications on Windows, UNIX and Linux platforms. \nHighly experience with Java complaint IDE's like STS, Eclipse, IntelliJ and RAD. \n\n\nTechnical skills:\n\nLanguages\t\t\t: Java, J2EE, C and C++, HTML, XML, JSPs, CSS, JSPs, Oracle \n                                                                   PL/SQL               \nJava Technologies\t\t\t: Core Java and Multithreading.\nJ2EE Technologies\t\t\t: Spring and Hibernate\nWeb Server Technologies\t\t: J2EE, JAX-WS, RESTful (JAX-RS) Web Services\nApp Servers\t\t\t\t: IBM WebSphere Application server 8.5, Tomcat 5/6\nOpen Source\t\t\t\t: Ant, log4J, Maven, SQL, Junit, Jasmine, Karma\nRDBMS (Database)\t\t\t:Oracle9i/10g/11g, SQL Server, My Sql\nVersion Controls\t\t\t: SVN, CVS, GIT\nOperating Systems\t\t\t: Windows XP/Vista/7, UNIX, Linux\nTools and IDEs\t\t\t\t: IntelliJ, Clion, Brackets, SQL Developer, Eclipse and STS,\n                                                                  Putty, Jenkins, Splunk, HP ALM QC 11.0\nUser interface tools\t\t\t: Angular JS, Node JS, Jasmine, Karma, Ext JS\nMethodologies/Design Patterns \t: OOAD, OOP, UML, MVC, DAO, Factory pattern, Session Facade, \n\t\t\t\t\tSingleton, Rational Unified Process (RUP), Test Driven \n\t\t\t\t\tMethodology\nFrameworks/API’s\t\t\t: Spring, Hibernate, Struts, Log 4j, REST, AJAX, JUnit\n\n\nProfessional Experience:\n\nCon Edison, New York City, NY                                                                                        Nov 2016 to Till Date\nSenior Java/J2EE Developer\n\nDescription: Consolidated Edison, Inc., commonly known as Con Edison or Con Ed, is one of the largest investor-owned energy companies in the United States, with approximately $13 billion in annual revenues as of 2016, and over $47 billion in assets. The company provides a wide range of energy-related products and services to its customers.\n\nResponsibilities: \nUsed Agile Methodology for developing project.\nWorked on Core Java. Implemented Alphanumeric functionality for bond number in Surety application. Implemented Junit using mockito framework. \nWorking with Business Analysts and project managers to develop multiple projects in parallel. \nDeveloped GUI layer using Java Script frameworks like JQuery, Angular JS, Node JS and other frameworks based on the project need.\nWorking with HTML5, CSS3, and JavaScript for mark up and applying styles for the project.\nPrimarily focused on the spring components such as Spring MVC, Dispatcher Servlets, Controllers, Model and View Objects, View Resolver.\nDevelop extensions or configurations within the Curam Framework. \nWorked on deploying applications on Apache Tomcat, Node JS.\nImplemented application level persistence using Hibernate and Spring\nUsed Boot Strap Framework for responsive design of the applications.\nWorked on Angular JS single page web application for legal application monitoring for service consumers.\n Designed and developed web interfaces and business logic using Jakarta Struts Framework (MVC architecture), JSP, Servlets, Java Beans, JDBC, AJAX, Java Script, HTML, DHTML and XML Technologies. \nAngular JS was used as the framework to develop SPA applications.\nDeveloped custom angular routes for application based on the user navigation to load pages.\nUsed frameworks like Karma and Jasmine for implementing TDD and BDD in our projects.\nSpring framework was used as the controller lawyer in back end to take care of the requests in the application.\nUsed JSF, HTML5, CSS3, React JS, Angular JS, jQuery and Bootstrap to build this SPA Single Page application.\nInject the Curam factory classes into the Spring context handlers \n Convert the Curam  persistence layer to Hibernate Database calls. \nInvolved in creating Front end screens using JSF, HTML5, CSS, JavaScript, jQuery, Node JS,Sencha 4,5, React JS, Bootstrap, Angular JS UI-Router,GWT (Google Web Toolkit) Grunt, & Gulp and parsed data from XML.\nUsed React JS to develop responsive application specified by conditions.\nJenkins was used as the Continuous Integration and Built tool to deploy applications.\nWorked on FORTIFY tool to see security breaches at code level and worked on fixing it.\nDevelopment of complete End to End testing plan and strategy for PFS application.\nPerformance analysis was performed on web sphere server in the development environment.\nWorked on creating workspaces for development teams in IBM RAD.\nWorked with Defect management installation setup on JIRA and integration of JIRA with Jenkins and Virtualization support for various internal teams for effective Analysis on release and framework issues.\nWorked on Oracle 11g, stored procedure from calls made from DAO and removed SQL injections as part of security breach avoidance techniques.\nWorked on Junit and mockito framework for PFS application.\nWorked on Monitoring Web activity for NAM, CM activities of applications.\n\nEnvironment: Java 1.8, Maven 3, Jenkins, DynaTrace, IBM RAD, JIRA, JQUERY, AJAX, HTML5, CSS3, Oracle 11g, Angular JS, PL/ SQLHTML, CSS, JavaScript, Hibernate, EJB,  JQuery, JSP, Servlet, MySQL, eclipse, ANT, Curam, CVS, Waterfall Model. JSP, Servlets, Java Beans, JDBC, AJAX, Java Script, HTML, DHTML and XML\n\n\t\t\t\t\t        \nClient:CVS Health, Woonsocket, RI\t\t\t\t\t\tOct 2014 to Oct 2016\nJava/J2EE Developer\t\n\nCVS Health is a leading pharmacy and retail chain based in Woonsocket, RI. The project that I was involved in gathering requirements and the development of PCPS Patient centric Prescription solution. The intent of this system is to show the dose calendar on the prescription Label and various application channels .The project was implemented on both core and target acquired stores.\n\n\nResponsibilities:\n\nAdapted Agile Methodology from specification, Analysis, Design, System integration, Testing, Deployment and Maintenance.\nInvolved in requirements gathering, analysis, design and testing.\nUsed Hibernate JPA in data access layer to access and update information in the database. \nImplemented the Persistence Layer needed for the services using JPA. \nDeveloped user interface using JavaScript, React JS, Node JS, HTML,GWT(google Web Toolkit), CSS.\nDesign and development of the Alliance application using Spring MVC and Hibernate.\nWorked on spring dependency injection, declarative transactions, AOP.\nUsed different Spring annotations like @autowire, @controller, @component, @Service at different layers. Created MongoDB collections and integrated with spring and MongoDB. \nDeveloped the custom tags for frequently used tags in project.\nCoded and developed EJB Components, both Session Beans and Message Driven Beans, modeling the business logic based on applications specified coding standards.\nFollowed Agile Scrum methodology, Test-driven development (TDD) and Continuous integration and Pair Programming.\nDesigned AWS infrastructure \nLaunch, configure and maintain VPC, Subnet, Internal Gateway etc. to manage AWS Network \nLaunch various AWS EC 2 instance to deploy various application.\nSuccessfully accomplished the complex installation of a site-to-site Open VPN between AWS and the \nCreated spring boot application by using maven. \nImplemented batch configuration in spring boot application.\nCustom Node JS proxy used to simulate API responses before the client implementation was complete and to proxy requests to finished client APIs, handling authentication custom headers virtual application root.\nBuild REST web service by building Node JS Server in the back-end to handle requests sent from the front-end jQuery Ajax calls and used JQuery for dynamic functionality of HTML5 and Translated wireframes into optimized program code using XHTML, CSS, JavaScript, Jquery, Ajax and DHTML\nInvolved in working with Hibernate as the ORM tool for data persistence. Used mappingfiles (hbm.xml) for the persistence classes.\nUsed ANT as a build tool build script. Log4J for logging errors and messages.\nInvolved in unit testing using JUnit, coverage using clover plug in.\nDeveloped several Spring /Servlets /JSP for MVC tiers to accomplish a variety of functionalities described above with respect to MVC design pattern, Command design pattern etc.\nUsed Java script, JQuery, JSTL and CSS for developing the JSP’S.\nCreated and injected Spring services, Spring controllers and DAOs to achieve dependency injection and to wire objects of business classes.\nDeveloped many rich, highly interactive responsive web sites and UI components with JavaScript, HTML5, and CSS3.\nUsed TOAD to get connected to Oracle to access the backend Oracle Database for verifying and validating the data inserted. \nUsed Spring 3.0 Framework for Dependency Injection, and integrated with the Hibernate framework.\n\n\n\nEnvironment: Java, J2EE, Spring MVC, EJB, Hibernate 3.2, JSP, RAD, Junit, Oracle 10g, Rational Rose Enterprise Edition 2000, TOAD, Windows, WebSphere, HTML 5, Ajax, JavaScript, Rest, JQuery\n\n\n\n\n\n\nInfinity Info Systems, New York, NY                                                                                    Oct 2013 to Apr 2014 \nJava/J2EE Developer                                                                                              \nDescription: Infinity Info Systems Corp. develops and delivers customer relationship management (CRM), business intelligence, and mobile CRM solutions for sales and marketing professionals. It offers CRM solutions for sales and marketing automation, business analysis, front and back office integration, mobile CRM, and more. \n \nResponsibilities:\nDesigned and developed Web site and Web based application and database for clients.\n Involved in SDLC analysis, design and development and testing phases of the application development using Scrum Agile methodology.\nPart of Sprint planning sessions and participated in the daily Agile Scrum meetings. \nInvolving in consuming, producing SOAP based web services using JAX-WS and tested the web services with SOAPUI.\nImplementing Maven and Jenkins used for the automatic build process.\nExpertise on working with the JavaScript, prototype JS and various MVC JavaScript frameworks node.js.\nUsing SpringORM module for integration with Hibernate for persistence layer.\nUsing SpringAOP in exception handling, which it reduces the development time to handle the exceptions.\nDeveloping screens using Angularjs, Dojo, CSS3 and Html5 and Designed Dojo widgets and reusable modules with Dojo.\nWorking closely with Software Developers and DevOps to debug software and system problems.\nAble to create complex JIRA workflows including project workflows, screen schemes, permission scheme and notification schemes in JIRA. \nLogged, tested and tracked issues and defects to closure and resolution in JIRA in partnership with Development Team.\nWorked on JavaScript frame work (AngularJS, Backbone, Bootstrap) to augment browser based applications with MVC capability. \nUsed javascript framework such as Angular JS (for data driven apps) and Backbonejs (for heavy DOM Manipulation). \nUsed Backbone JS to optimize in-browser use and to load the module and to improve the Speed. \nBuilt Rich Prototypes and Applications using HTML5, CSS3, JavaScript, jQuery, Ajax, JSON, AngularJS and Bootstrap with MySQL database.\nUpgraded Apache and Tomcat in NPE servers to latest version, configured and tested successfully. \nUpgraded Apache and Tomcat in Production servers to latest version, configured and tested successfully. \nUsing AngularJS, HTML5, CSS3 all HTML and DHTML is accomplished through AngularJS directives.\nUsed AngularJS for DOM Manipulation, Filters, and Directives.\nProvided support on DB2 client related applications. \n• Worked with databases SQL (DB2) to validate, filter, and updating data from clients.\nDesigned and implemented web module using Spring MVC.\nInvolved in creating UI using GWT, have used UIBinder framework along MVP pattern. \nInvolved in creating custom widgets would be rendered on top of GWT. \nInvolved in creating http inbound & outbound flows, Orchestrations, Transformations using MULE ESB. \nUsed MULE ESB to do the traffic routing between multiple systems and mapping of the data.\nDeveloped a REST web service API's using Mule services, implementing Spring MVC, and JDBC modules.\nCreating, Debugging and testing web applications using web services using RESTful, Javascript, JQuery, AJAX and SQL.\nImplemented RESTful web service using JAX-RS API.\n Used Mule ESB for application integration and deployed mule applications\nDeveloped server side utilities using J2EE technologies Servlets, JSP, JDBC.\nMaven and Jenkins used for the automatic build process.\nDeveloped various Oracle PL/SQL programming with stored procedures, packages, functions, triggers and other advance technologies.  \nUnit and integration test cases are being designed and developed using JUnit and JMockit.\nUsed Spring Tool Suite (STS) as IDE for development and deployed application on Web logic.\nImplemented the Model-View-Controller (MVC) design pattern using Java 2 Platform Enterprise Edition.\nUsed Rich Faces in an advanced UI component framework for easily integrating Ajax capabilities into business applications using JSF.\nSet up ActiveMQ for asynchronous communication and implemented the messaging modules using Apache Camel API.\nUsed ActiveMQ to communicate 2 Systems To and Fro Communication where Asynchronous Message Communication was required.\nImplemented JSF MVC framework to make separate behavior and presentation in application.\nDeveloped few pages with HTML5, AngularJS and CSS3. \nCreation Managed bean used to instantiate backing beans used in a JSF application and stores them in a Scope. \n\nEnvironment Java, J2EE,Spring 3,Spring Batch, Web Services (JAX-WS, SOAP, WSDL), JSP, ActiveMQ Java Script, AJAX, Angular.js, node.js, Backbone.js, Jquery, Dojo, SOAP, RESTful WebServices, SVN, Google Web Toolkit(GWT), Spring Tool Suite(STS), Maven, Log4j, JUnit 4, HTML5.0, CSS, AJAX,PL/SQL.\n\n\nC-Cubed Solutions, Bangalore, India                                         Oct 2011 to Sep 2013\nKoss Dispo Sheet \nJAVA Developer\nDescription: The Koss Dispo Sheet, Application Kbase and Knowledge Base are the tools designed to be operated by the call center agents who receives calls. Based on the customer code, which is unique, the agent can track the history of the customer and can assist him with his/her issues. The tool provides the facility of storing back the information into the database such as customer id, product name, issue, solution provided, address etc., for features assistance.\n\nResponsibilities:\nAnalyzed Business Requirements for the design and development of the tool.\nProduct coding/Implementation for prototype. \nWorked on the Spring framework like Spring IOC and Spring DAO. \nDeveloped ANT scripts to build and deploy the application in the JBOSS Application Server. \nUsed Hibernate to populate the data from the Database. \nUsed JavaScript and JQuery for validating the input given to the user interface. \nDeveloped the application using Spring MVC. \nInvolved in front end server side coding using JavaScript/HTML/CSS and Java, JSP, Beans, EJBs.\nDeveloped JSPs, JavaBeans and Servlets. \nCreated images/icons for web pages using Photoshop.\nInteraction with the clients for modifications after UAT. \nData validation and documentation for future changes.\nImplemented design patterns like MVC, Singleton.\nDesigned and Developed HTML pages and JSP pages.\nConfigured controllers using Struts Framework.\nServer side validations in the UI are achieved using Struts Validation.\nAchieved database persistence through hibernate.\nDeveloped and debugging of java files is done using Eclipse IDE.\nPerformed unit testing using JUnit.\n\nEnvironment: HTML/CSS, Java, JSP, Servlets, XML, XSL, Struts, Dreamweaver, JavaScript, Apache Tomcat 4.1, Oracle 7.0, Eclipse, Windows NT, Junit,UAT.\n\n\n\n\n\n\nUdyog Software, Hyderabad, India                                                                                     Aug 2008 to Sep 2011\nJava Developer                                                                                                        \nDescription: Udyog software is a pioneer in providing tax automation products, solutions for both direct and indirect taxes. The application developed offers various computation & filing services for account payable, account receivable and payroll transactions and is a preferred tax solution partner for various ERP vendors and implementers. \n\nResponsibilities: \nDeveloped the application using HTML, CSS, JavaScript, JSP, Servlets and JDBC. \nUsed JavaScript for client-side validations. \nInvolved in Documentation and use case design using UML modeling include development of Class diagrams, Sequence diagrams and use case Transaction diagrams. \nDeveloped activity, sequence and class diagrams using Unified Modeling Language (UML) and Rational Rose. \nUsed JDBC to connect to the My SQL database and written complex SQL queries to retrieve data from the database. \nDeployed the application in Apache Tomcat Server. \nUsed JUnit to perform unit testing. \nClient side validations are handled using Java Script. \nUsed Eclipse tool for application development. \nUsed Configuration Management Tools for version control which is built on CVS. \nParticipated in design and code review meetings with developers. \nUsed JSF framework in developing user interfaces using JSF UI Components, Validator, Events and Listeners.  \nCreated UI designs using Web 2.0 standards Created UI designs using Web  2.0 standards \nDeveloped the UI layout and front-end programming (HTML) for web application that matched requirements. \nUsing JavaScript and JQuery to improve overall design and UI of campaign websites. \nActively involved and designed the user interfaces using JSPs, CSS, and Javascript. \nUsed JAXB API to bind XML Schema to Java classes. \nDelivered presentations about cloud computing, NoSQL, and new developments in databases. \t\nUsed Spring-Core module for Dependency Injection and integrated view using Apace Tiles. \nConsumed Web services with Apache CXF Framework. \nCreated a build environment for Java using Jenkins, Git, Maven and Artifactory. \nInvolved in writing test cases for all the Java classes developed using Easymock and Junit framework. \n\nEnvironment: Java, HTML, CSS, JSP, JavaScript, Servlets, JDBC, My SQL, UML, SQL, JUnit, Eclipse, Maven, CVS and Apache Tomcat Server.\n\nEducation:  Bachelor’s in Computer Science from OU, India\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "communication",
        "css",
        "ec2",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "lambda",
        "leadership",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "rds",
        "react",
        "scrum",
        "sql"
    ]
}