{
    "id": "resume_4380facc-32bc-44da-a1d9-a0f72959ede8",
    "metadata": {
        "filename": "Sai kumar.docx",
        "processed_date": "2025-09-24T08:45:51.823409+00:00"
    },
    "raw_text": "SaiKumar\ntushar.k6@yahoo.com\n\nLinkedIn : https://www.linkedin.com/in/kumar-sai\n-----------------------------------------------------------------------------------------------------------------------------------------------------\nHighlighted Summary\n\nMore than 7 years of experience in design, development and maintenance of Java/J2EE applications with experience in core JAVA.\n\nHighlighted Skills\nJava, J2EE, JSP,  HTML ,JavaScript, Servlets,UNIX, LINUX, JavaBeans, CSS, SOAP, XML, XSD schemas, Eclipse, My Eclipse, NetBeans, IBM Websphere Portal, Angular.js, OOP, REST, SDLC, Spring RESTful Web-Services, Tomcat AX-WS,  MVC,  AJAX,  JSON,  JSP, Hibernate, Spring, Struts, Java Servlets, AJAX, Java Beans, JNDI, JMS,  RUP.\n\nSUMMARY\nStrong Programming Skills in designing and implementation of multi-tier applications using Java, J2EE, JDBC, JSP, JSTL, HTML,  web services, JSF, Struts, JavaScript, Servlets, JavaBeans, Java Thread, CSS, EJB, XSLT, Spring MVC . Extensive knowledge in developing applications in a single page (SPAs) using   various JavaScript frameworks like Angular Js, Angular 2, Backbone.js, Require.js, node.js, Grunt.js, React.js and Bootstrap. Experience in Gap Analysis on the instruments likefutures options, Credit Derivatives (credit default swaps), Bonds and interest rate Swaps. Worked on Operating Systems Windows Environment, UNIX and LINUX. Experience in developing Web Services using - SOAP, WSDL and developing DTDs, XSD schemas for XML (parsing, processing, and design). \n\nDevelopment Experience on different IDE's like Eclipse, My Eclipse, NetBeans, IntelliJ etc. Proficient in Java/J2EE technologies like JSP, Hibernate, Spring, Struts, Java Servlets, AJAX, Java Beans, JNDI, JMS, XML, web service using IDEs like Eclipse 3.1/3.5. Experience in UNIX, Linux and UNIX Shell Scripting. Experience with and solid understanding of Microservices. Working knowledge in multi-tiered distributed environment, OOP concepts, good understanding of Software Development Lifecycle (SDLC) and REST. Experienced on Unix, ant, SVN, Maven, Apache 2.2 configuration, deployment and troubleshooting. Developed Hadoop map-reduce jobs to detect fraud by analyzing tracking data.\n\nManual and Automated Testing of Client/Server based Applications and Web based Applications using Selenium Ide. Selenium RC, Selenium Web Driver, Win Runner and Test Director and Quality Center, Jira.  Good experience in implementing Cucumber, Gherkin, Junit, TDD and TestNG for unit testing, Ant and Maven tools to compile, package and deploy the components to the Application servers in different environments.  Experience in generating the Gherkin test cases to make sure the test coverage for the CucumberFramework. Expertise in database tools like SQL Server Management Studio, Enterprise Manager and SQL Server Business Intelligence Studio. Built applications for scale using JavaScript, NodeJS, and React.JS.  Used tools like Wily, Splunk, Yourkit, Jmeter, visualVM for application monitoring and profiling. Experience in developing and deploying session beans, entity beans representing different types of business logic abstractions.Good knowledge of workflow concepts such as BPM, BPMN, BPML and BPEL and experience in using encryption techniques like AES, DES, and RC4. \n\nExpertise in writing Sub Queries, Cursors, Functions and performed data analysis using SQL, SQL Server Management Studio, Oracle. Involved in configuring Tomcat web server, MySQL database server initially to work with servlets, MySQL database. Good experience in Agile (SCRUM) and Waterfall Methodology and worked with SVN, Git and Perforce for version control. Performed memory profiling to improve system performance by analyzing memory dumps, monitoring memory and CPU usage in the servers and redesigning a part of the system to addressmemory issues . Worked with Behaviour Driven Development process and Test Driven Development (TDD)Strong communication & relationship management skills, enthusiastic & self-driven, with a high degree of commitment.\n\nWork Experience\nFidelity Investments, South Lake, TX\t\t\t\t\t\t    January 2015 to Present\nSenior Java developer\n\nResponsibilities: \nResponsible for setting up AngularJS framework for UI development. Developed html views with HTML5, CSS3, JSON and Angular JS, worked on Node JS framework in order to develop dynamic and rich client web pages aslo  designed and developed proof of concept for Market Risk platform using NoSql (Cassandra) and MapReduce (hadoop)\nExpert knowledge in Financial Information Exchange (FIX) protocol applicable for Trading platforms\nInvolved Gap analysis for different instruments like credit derivatives, Bonds, Interest rate Swaps etc\nInvolved in complete server management of web application and their migration from traditional Infrastructure to AWS cloud and implemented web security for REST web services\nDeveloped flex API documentation using ASDoc, followed Agile/Scrum as a software methodology for the project and also developed application using Spring framework\nDeveloped the web application using Core Java concepts like Collections, Multithreading, OO concepts, Exception handling for developing application modules. \nUsed Endeca navigation Queries to return set of finincial records for a given store\nRectified Java thread-race condition and DB transaction boundary issue which caused serious transaction losses.\nWritten test cases for unit testing using JUnit testing Framework and performaed testing using JMeter. \nWorked in Agile methodology environment including, Test Driven Development (TDD) with Continuous Integration/Delivery\nConsumed REST based Microservices with Rest template based on RESTful APIs\nThe business logic of the application was developed using Java 8, Servlets, Spring, hibernate \nWorked on Servlets and Java Beans for making changes to the business logic, worked on serialization and deserialization of the data. \nIntegrated with Backend code Java 8, Restful Web Services, View Models for single page applications using Angular JS. \nApplyed Spring Framework for transaction Management and Spring JDBC for building ORM and Wrote multiple DAO's to fetch data from different tables and performed Transaction management. \nExplore single-page asynchronously data-driven UIs using REACT JS, REDUX, NODE JS, WEBPACK (ES6) and SASS\nUses Second Level Cache to enhance performance and Proper Memory Management and implemented Stateless and State full Session beans to capture user conversation and to achieve scalability, memory management and transactions, and Entity beans to bring the relational data to the object world. \nImplemented TDD for JavaScript code and Angular JS code with Jasmine test cases\nCoordinated with team on application of test-driven development (TDD) strategies to optimize system quality and enable rapid refactoring\nUsed Collections, abstract classes, interfaces and multithreading concepts extensively for the business logic\nUsed Spring concepts like IOC for building the framewor and involved in configuring hibernate mapping file. \nInvolved in coordinating with the trading desk users to understand the current issues/requirements\nImplemented various design patterns and design principles for the application, used Oracle 11g to manage data and create tables.\nDeveloped fully automated continuous integrated system using Git, Jenkins and custom designed tools developed in Python\nImplemented service methods and SQL queries, PL/SQL to interact with the Oracle DBMS \nUsed JIRA to keep track of bugs and issues\nPrepared DDL and DML for several tables in Oracle and Sybase. \n\t\nAT&T, Alpharetta, GA\t\t\t\t\t\t\t       January 2014 to January 2015\nFull Stack Java Developer\n\nResponsibilities: \t\t\t\nProviding JAVA/UNIX production support for a major Corporate Financial Application Suite (CFAS). \nCreated lesson learned for SPOC/SME to minimize the human errors and to refine the code as per company norms/technical standards. \nAOTS ticketing creating and live data error handling by organizing the meeting /on call with BSAs and developers. \nUsed Oracle ATG Ecommerce framework to deal with the ecommerce functionalities in order to maintain MVC architecture.\nWrote Angular JS custom directives and implemented service layer on top of Cassandra using core Java, JPA, Datastax Java API and Restful API. \nImplementing Java applications using distributed architectures such as Microservices and EDA \nDesigned and Developed the UI using Strut view component, JSP, Angular JS, JavaScript, HTML, AJAX, DHTML, CSS, and DOJO. \nUnit testing for Web application was tested by running on tomcat and jre servers from unix bo and also used JMeter for load testing the application.\nCreated a build environment for Java using Jenkins, Git, Maven, Artifactory, and a number of Reporting tools and used XPATH, XQuery and XSLT for XML transformations. \nHosted and consumed web services using HTTPs- SOAP protocol. Worked on defining schemas andWSDL for the web services.\nDeveloped the application using Eclipse as the IDE and used Eclipse standard/plug-in features for editing, debugging, compiling, formatting.\nParticipated in the implementation, maintenance and testing phases of REST API development.\nResponsible in creating Servlets, which route submittals to appropriate Enterprise Java Bean (EJB) components and render, retrieved information under UNIX Environment\nAdded dynamic functionality to the application by implementing jQuery and Angular JS. \nDeveloped the UNIX shell scripts to start and stop the Java scheduled jobs. \nWorked with JSF framework in developing user interfaces user interfaces using JSF UI Components, Validators.\nUsed JMS for the asynchronous exchange of critical business data and events among J2EE components and legacy system.\nInvolved in debugging the product using Eclipse 3.6 and JIRA Bug Tracking. \n\n\t\t\t\t\t\t\t\t\nKohl's, Menomonee Falls, WI\t\t\t\t\t\t     August 2011 to December 2013\nJava Developer\n \nResponsibilities: \nPerformed functional testing to identify various critical points in the application and automated it by using Selenium RC on different module of corporate web site.\nDesign and develop functional and Load Test frameworks and develop automated test suites (Selenium with Junit). \n Developed generic Selenium API to be reused by different teams and participated in automating the regressions test cases. \nCreated Web testing using Cucumber, Gherkin and Selenium WebDriver  \nPerformed scripting with shell for testing application and white box testing using Selenium IDE.\nDeveloped a web based application using Java, JSP, Servlets, HTML with SDLC (Software Development Life Cycle) model. \nDeveloped RESTful Web services for CIP using Java, Spring Boot, NoSQL databases like Couch base\nInvolved in deployment of the application at various environments (Development, QA Testing, Staging, and Production)\nExtensively worked in ATG Web Commerce framework for building and supporting Websites. \nDesigned, coded, implemented and tested a WordPress website for Kohl's and also performed system upgrades to WordPress websites, contributed modules and custom theme upgrades\nExtensively used Repositories, Nucleus, Droplets and Servlet pipeline in ATG Ecommerce Framework.\nUsed JSP and HTML for creating user interface. \nDeveloped Rest Web Services to produce application business services at Web layer level\nImplemented Struts DynaActionForms, MessageResources, ActionMessages, ActionErrors.\nUsed Angular JavaScript for client side validation \nDeveloped XML documents with XSD validations, XPATH, SAX and DOM parsers to parse the data held in XML documents\nDeveloped application on Struts MVC architecture aslo implemented MVC architecture with Hibernate as ORM framework\nUnderstanding the Business requirements. \nWritten SQL to retrieve and insert data from/into the database of Oracle 11g. \nDesigned, developed and deployed the EJB's onto the WebSphere Application Server 7.5. \nSuccessfully designed and developed a B2B(Prodesk) and B2C (eStore) ecommerce applications using Java and J2EE technologies. \nUsed Log4j as a debugging tool for logging application debugging messages. \nApplication designed and developed using Java Core, J2EE, JMS, Javascript, Struts, Hibernate, AOP CSS, Web Services Axis, and AJAX and involved in Code Review. \nInvolved in Unit testing and Integration testing of the application. \nTracing and Logging frameworks implemented using Log4j\n\nBritish Telecom, Dallas, TX\t\t\t\t\t\t\t October 2009 to July 2011 \nJava Developer \n\nResponsibilities: \nDeveloped application using Java, Spring, Hibernate, SQL/PL JSP, Maven, Junit, JS, CSS, JQuery, HTML, Unix etc. \nAs key developer involved in researching, analysing, coding, and testing all changes, drawing on user and technical resources to successfully complete the request. \nImplemented typical messaging service using JMS and JAXB to support EDI between different systems on job scheduler. \nInvolved in iiFramework enhancement, code refactoring, created APIs, controllers, tools and utilities. \nDerived best practice using OO Design patterns, TDD methodology, PMD Code analyzer, Cubartura Code Coverage etc.\nWorked directly with customers to gather detailed task list and provided solutions. \nWorked within a distributed team environment applying agile methodologies. \nInvolved in various client constraints to provide development consulting services as part of engaged teams. \t\t\t\t\t\t\nPilog India Pvt Ltd, Hyderabad, India\t\t\t\t\t    August 2007 to September 2009\nJr. Java Developer\t\n\nResponsibilities: \nDeveloped Servlets and Java Server Pages (JSP). \nDeveloped PL/SQL queries to generate reports based on client requirements. \nEnhancement of the System according to the customer requirements. \nCreated test case scenarios for Functional Testing.\nUsed Java Script validation in JSP pages. \nHelped design the database tables for optimal storage of data. \nCoded JDBC calls in the servlets to access the Oracle database tables. \nResponsible for Integration, unit testing, system testing and stress testing for all the phases of project. \nPrepared final guideline document that would serve as a tutorial for the users of this application. \n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "cassandra",
        "communication",
        "css",
        "data analysis",
        "git",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mysql",
        "node.js",
        "oracle",
        "python",
        "react",
        "redux",
        "scrum",
        "sql",
        "webpack"
    ]
}