{
    "id": "resume_5004f9b6-adb6-4474-b302-ce1f9f5f5627",
    "metadata": {
        "filename": "Sarath M.docx",
        "processed_date": "2025-09-24T08:45:52.916349+00:00"
    },
    "raw_text": "Sarath Kumar\nM: 469-324-9282\nEmail: sarathm.java@gmail.com\n\nPROFESSIONAL SUMMARY:\n\n7+ Years of  experience in Software Development Lifecycle (SDLC) core areas such as Analysis, Design, Implementation, Testing and Deployment of Object Oriented, Client-Server, Web-Based, Distributed and Enterprise Applications with Java/J2EE technologies.\nStrong experience in Software Development Methodology such as Agile (Scrum) Methodology, Iterative and Waterfall.\nExtensive  experience with both Core and Advanced Java concepts which include Java, Servlets, JSP, Java Script, JDBC, JSF, XML,EJB, Struts, Spring MVC, Ajax, jQuery, Hibernate, JDBC, and Web Services.\nExtensive knowledge in Front End technologies like JQuery, JavaScript, HTML, XML and CSS.\nHave good experience to implement Object Oriented design diagrams for Application system in UML, using IBM Rational Rose and Microsoft Visio.\nExpertise in using and implementing various design patterns such as Singleton, Bridge, Abstract Factory, Decorator, and Iterator etc. \nProficient in implementation of frameworks like Struts, spring, JSF, AJAX frameworks (Rich Faces, My Faces) and ORM frameworks like Hibernate.\nExperience in OOPS concepts like Inheritance, Encapsulation, Abstraction, and Polymorphism.\nWorked in Multithreading environment by Thread Synchronization, Thread Pool, Class level and object level threading.\nExpertise in designing and developing J2EE compliant systems using IDE tools like Eclipse, RAD (Rational application Development), NetBeans and JDeveloper.\nExpertise in Developing and Deploying applications using Webservers like Apache, Karaf 3.x, Kafka and Application Servers like Apache Tomcat 5.x/6.x/7.x/8.x,WebLogic, IBM WebSphere, JBOSS, and JRun.\nExperience in building web applications using various frameworks such as Spring Framework (2.0-4.0), Spring MVC (Model View Controller), Spring Boot, IOC (Inversion of Control), DAO (Data Access Object) and familiarity with AOP (Aspect Oriented Programming).\nWorked on Struts open source java framework utilizing Strut Tiles, Strut Controllers (Action and Forms) and Validation framework for client, server validation.  \nExtensive experience in Core Java concepts like Exception handling, Multi-threading, Synchronization, Serialization, IO, Collections framework, Java Beans. \nExtensive experience in developing GUI using HTML, CSS, JQuery, Java Script, EXT JS, DOJO, AJAX, Knockout JS, Bootstrap and Angular.js, Node.js, Backbone.js, Underscore.js. \nInvolved in development of SOAP based web services using WSDL, SOAP, JAXB, CXF, AXIS, JAX-WS and Restful web services using JAX-RS, CXF and JERSEY APIs. \nExperience using ORM framework like Hibernate/JPA for mapping Java classes with database and using Hibernate Query Language (HQL). \nKnowledge on service oriented architecture (SOA), workflows and web services using XML Test Driven Development (TDD) Environment, SOAP and Restful web services.\nExpertise in unit testing the applications using Junit Framework, Mockito and developed logging and standard mechanism based on Log4J, SLF4j.\nExperience in implementation of version controls tools like CVS, Tortoise SVN, Clear Case and GIT.\nExperience in Oracle 8i/9i/10g/11g, DB2, SQL Server, PostgreSQL, MySQL, MongoDB database programming using PL/SQL and standard built-in Oracle Packages.\nProficient with software build process and writing Maven and ANT Build Scripts for automated build and deployment process. Experience with Build tools like, ANT, MAVEN, and GRADLE.\nExperience in Agile software development process, Test Driven Development and Scrum.\nProduction Support-Provided development (quick fixes) and technical support for complex/ critical applications. Coordinated with other teams to resolve end-user issues promptly.\nExperience with code coverage tools like Clover, Jacoco, Eclipse Emma, coburtura.\nExcellent written and verbal communication skills, Analytical, Problem Solving skills, strict attention to detail and ability to work independently, lead/work within a team environment.\n\nTECHNICAL PROFICIENCIES:\n\n\nEducation: Bachelor’s from JNTU-India\n\nProfessional Experience:\n\nClient: GE Appliances, Louisville, KY                                                                                                                                      Feb’16–Till date\nRole: Sr. Java Full stack Developer\nDescription: This project is to provide a range of engineering services across the entire product life cycle, starting from conception, design, development and testing, to maintenance and support - all to address specific needs as customer products mature.\n\nResponsibilities:    \nInvolved in analysis, design, and developing middleware using Servlets, Java Beans, Hibernate, springs and doing enhancements and issues resolutions.\nExtensive uses of Angular JS directives to get JSON data using AJAX from RESTful API and modify DOM.\nDesigned the presentation layer GUI using JavaScript, JSP, HTML, CSS, Angular.JS, Customs tags and developed Client-Side validations.\nExperience in developing applications using AngularJS, Bootstrap like Grids, Toolbars, Panels, Combo-Box and Button etc.\nDeveloped Single page application and structured the JavaScript code using AngularJS.\nUsed React JS to make webpages rendering faster, instead of using ng-repeat in Angular JS used ngReact to achieve the same.\nMaking sure react is flexible and provides hooks that allow you to interface with other libraries and frameworks\nDesigned UI pages using JSP, HTML, Angular JS, Node JS, Java Script, CSS, AJAX, JQUERY, JSP, JSON and Tag libraries.\nFollowed Single Page Application (SPA) Pattern and used AngularJS MVC to build a cross-browser complaint application.\nDesigned and developed applications with Eclipse in java using STRUTS Framework running on Web Sphere Server.\nDeveloped the DAO layer for the application using spring, Hibernate and developed various logics and reports using HQL and Hibernate criteria.\nUsed Hibernate as ORM to map Java classes to data base tables.\nImplemented Spring MVC architecture and increased modularity by allowing the separation of crosscutting concerns using Spring Boot.\nInvolved with Spring IOC concepts to integrate Hibernate DAO.\nInvolved in writing Spring Configuration XML, file that contains declarations and business classes are wired-up to the frontend managed beans using Spring IOC pattern.\nDeveloped Web Services for data transfer using Restful WebServices\nExtensively used Core Spring Framework for Dependency Injections of components and Spring JDBC for managing all the database communication and exception handling. \nImplemented Multithread /Executor Thread to concurrent for distributed SOAP Web Services. \nExtensively worked with collections classes like Array List, Hash Map, Iterator, concurrent etc. \nUsed SOA to provide service enablement capability (SOAP and REST services) for seeded and custom integration interfaces within the oracle E business suite. \nInvolved in developing & exposing web services and also consumption of Web Services like Restful Web services. \nInvolved in exception handling testing using SOAP UI and Security of Mule endpoint through WSSR.\nImplemented Product-Retrieval Service as SOAP based service using Apache frame works.\nResponsible to integrate applications for web- based environment using SOA.\nInvolved in performing Unit and Integration testing (JUnit). Strictly followed Test Driven Development (TDD). Approach environment using agile methodologies.\nCreating & Exposing Restful Web Services using RAD editor and used Maven build for the deployment.\nInvolved in Unit & Integration testing for different Modules in the application. \nUsed Web logic as Application Server to host the Application. \nDeveloped REST services to talk with adapter classes and exposed them to the angular JS front-end. \nWorked on Restful web services which enforced a stateless client server and support JSON few changes from SOAP to RESTFUL Technology.\nDeveloped data objects to communicate with databases using JPA, Hibernate and JDBC frameworks.\nMiddleware Services Layer is implemented using EJB (Enterprise Java Beans-stateless).\nWrote Java Scripts validations to validate the fields of the Registration Screen and login screen.\nAlso used Ajax framework for server communication and seamless user experience.\nDeveloped Web Services components using XML, XPath.\nDevelopment of MQ Application programs for JMS environments using queues and messages. Working with JMS handling and managing exception conditions.\nUsed Java Collections API extensively in the applications.\nUsed JIRA for bug tracking, issue tracking and project management.\nInvolved in writing the batch jobs, UNIX scripts to load/manipulate the data.\nCreated SQL queries, NO/SQL, Stored Procedures, Functions for database layer by studying the required business objects and validating them with Stored Procedures using PostgreSQL. Also used JPA with hibernate provider.\nUsed GIT to implement version control.\nUsed log4j for tracking errors and debugging the code.\nEnvironment: Java, ReactJS, Java Script, HTML, STRUTS, JUNIT, Servlets, JDBC, JQUERY, JSON, AJAX, DOM, Jenkins, HQL, Spring Boot, Selenium, JIRA, Hibernate, DB2, JPA, Eclipse, EJB, JMS, AngularJS, log4j, NO/SQL.\n\nClient: RGIS, Marietta, GA                                                                                                                                                           Dec’13-Feb’16\nRole: Full Stack Java Developer\nDescription: RGIS is the market leader in supply chain, inventory, insights, merchandising, and optimization solutions.  The project involved in creating several new business components like order Fulfillment and internal purchase order etc. This project involved in writing several new DAO using hibernate for inventory database interaction and in automation scripting and building logging framework using Log4j. The main responsibilities was to co-ordinate development activities with Business analyst in an agile environment. Application was deployed on Web logic application server.\n\nResponsibilities:\nImplemented RUP development process on Software Development Life Cycle and done with effort estimations using Function point’s 3p estimations. \nUsed spring framework to inject services, entity services, transaction management, and concerns by factory class corresponding to the use case operation executing. \nDeveloped JSP, Ajax, jQuery for front-end design and page flows.\nExperienced in developing web-based applications using Java, XML, CSS, HTML, DHTML and JavaScript. \nInvolved in using spring concepts DI/IOC, AOP, Batch implementation and Spring MVC. \nImplemented Declarative transaction management using Spring AOP.\nDeveloped Application front end using Spring Framework.\nExperience on implementing the AngularJS in creating single page applications for the client.\nUsed React JS to make webpages rendering faster, instead of using ng-repeat in Angular JS used ngReact to achieve the same.\nMaking sure react is flexible and provides hooks that allow you to interface with other libraries and frameworks\nUsed spring JDBC Template to do CRUD operations with Database. \nCreated WSDLs as per wire frames, UI pages generated client jars using JAX-WS. \nUsed Jersey implementation for Restful web services. \nWork closely with the UI team and provide Restful API’s which deliver data in JSON format needed by the User Interface. \nImplemented REST web services for communication between web service client and service provider. Worked on implementation of Restful Web services for transmission of data. \nDefined rules using JRules that are defined for resources to show details on UI pages. Followed up with Business Analysts to create conditions business functions using JRules UI.\nInvolved in writing extensive Unit tests and integration tests using JUNIT to thoroughly test the code and maintain high coverage area.\nDeveloped several REST web services which produces both XML and JSON to perform tasks, leveraged by both web and mobile applications.\nAnalysis and Design of various modules using SOA and J2EE stack. \nCreated the front end using JSP, HTML, XML, and advanced JavaScript. Used Oracle as backend.\nProvided support for user acceptance testing & performance testing.\nInvolved in Web sphere server configurations, Data Sources, Connection Pooling, MQ Series Queues set up for messaging and deploying the apps on different servers in different environments like QA/IST/Production. \nInvolved in creating JUNIT test cases and ran the TEST SUITE using EMMA tool.\nImplemented client side validation in registration forms, login and logout forms using java Script.\nExtensively used JQUERY, JSON, AJAX and DOM scripting to create interactive web application like message posting \nCoded Tested and debugged Java code and Servlets using Eclipse.\nUsed ActiveMQ messaging to set up communication between applications in ESB. And flows are created for JAX-WS and JAX-RS web services. \nDeployed Elastic Search cluster to serve non-front-end traffic, reducing the load on customer facing search infrastructure by millions of requests day. \nDevelopment, testing Servlets and JSPs in the typical MVC Architecture.\nConfigured and deployed web application in JBoss server using Maven.\nImplemented Test driven development (TDD) using Junit and Mockito.\nInvolved in configuration and deployment of application on JBoss App Server.\nUse GitHub for code branching and merging when implementing new features. \nWorked on the SOA, RESTful, and consumed third party web services.\nExtensively used Maven to build the application. Used Log4j for logging and debugging. \nEnvironment: Java 1.7, React Js,JavaScript, AngularJS, DOJO, HTML, XML, XML Schema, DOM, SAX, SQL, Tomcat, Ant, Linux, Clear Case, Informix, Spring MVC, Elastic Search, Hibernate, Ajax, JQuery, Backbone.js, JavaScript, GIT, Water fall methodology, Maven, Junit, Mockito, JBoss.\n\nRegions Bank, Birmingham, AL \t\t\t\t\t\t\t\t\t         May’11-Nov’13\nRole: Java/J2EE Developer\nDescription: The Apply Web Rewrite (AWR) application is part of Regions bank Credit Card application which includes juniper application (legacy). The AWR application developed by Regions bank provides financing for customers applying through various partners such as APPLE, US AIRWAYS, SEARS. The AWR application is an enhanced customer Website used by various partners for applying Credit through an online secure channel.\n\nResponsibilities:\nWorked as a Developer and involved in analysis of requirements, design, development, Unit and Integration testing.\nInvolved in analyzing the user requirements and specifications for deciding the flex component needed to be developed and their interaction. \nCreated POJO layer to facilitate the sharing of data between the front end and the J2EE business objects \nUsed server side spring framework and Hibernate for Object Relational Mapping of the database structure created in Oracle, \nInvolved in Hibernate configuration properties setup mapping files using generators, associations inheritance etc. \nImplemented Message Driven beans to develop the asynchronous mechanism to invoke the provisioning system when a new service request saved in the database used JSM for this. \nTransformed XML documents using XSL. \nImplemented application level persistence using Hibernate and spring.\nDeveloped various components using Spring (MVC), JSP and HTML.\nInvolved in writing JSP's, JavaScript and Servlets to generate dynamic web pages and web content.\nUsed WebLogic for Design, Development and Deployment of applications.\nEnhanced and optimized the functionality of Web UI using Rich Faces, JSF, AJAX, CSS, XHTML and JavaScript \nUsed AJAX for the asynchronous communication to the server.\nWrote scripts in UNIX to process the batch jobs on a scheduled basis. \nHave used Facade, Singleton, Factory Design patterns.\nImplemented Spring MVC framework for developing J2EE based web application.\nUsed GOF Java J2EE design patterns. Used Business Delegate to maintain decoupling between presentation business layers. \nUsed JPA with Hibernate provider. \nInvolved in configuring web sphere variables, queues, DSs, servers and deploying EAR into Servers. \nInvolved in developing the business Logic using Plain Old Java Objects POJOs and Session EJBs.\nInvolved in Hibernate mappings, configuration properties set up, creating sessions, transactions and second level cache set up. \nInteract with Business Analyst and Host Subject Matter Experts (SME) to understand the requirements and for any clarifications required by the team, followed agile methodology and SCRUM meetings to track, optimize and features.\nDeveloped logging information using Log4j.\nDeveloped the application using Spring Framework that leverages classical Model View Layer (MVC) architecture.\nDeveloped hibernate DAO framework with spring framework.\nExtensively involved in developing core persistence classes using Hibernate framework, writing HQL queries, DB schema and PL SQL changes.\nDesigned and implemented the presentation layer using Java Server Pages, tag libraries, and cascading style sheets (CSS).\nResponsible for unit testing the application using JUnit.\nUsed tortoiseSVN as the version control.\nUsed JIRA for bug tracking, issue tracking and project management.\nUsed Jenkins for integrating the applications.\nUsed UNIX scripting for file transferring.\nDeployment of application on JBOSS Application server in clustered environment, managing the server, monitoring the server logs.\n\nEnvironment: Java 1.7, J2EE, CSS, Subversion, XML, JDBC 4.0, RAD, AJAX, JSF, jQuery, Intellij, XML Web Services, SOAP, WSDL, SAX, DOM, JAXB, Log4J, JUnit, Microsoft tools, Oracle 11g, PL/SQL, Unix, Spring 4.1, Hibernate 4, JBoss, TOAD, JavaScript, Angular.Js, Node.js, Jersey, Junit, JIRA.\n\nClient : UMB Bank, Kansas, MO                                                                                                                                                 Nov’09-Apr’11\nRole: Java/J2EE Developer\nDescription: The project deals with customer credit card system. Also helps customers to view their statements, search transactions, download statements, download transactions, view the recent transactions and can do the balance transfers online. The project Online Investment Service (OIS) was designed to facilitate trading in short term paper (Mutual funds, Repos, CDs, Commercial Paper, CRA, and Time Deposits) for high net worth corporate and individual customers. The system comprised Trading desks that were created internally (logical entity) to handle region specific customers and business entities namely Broker were created to provide an interface for the clients to place orders. \n\nResponsibilities:\nActively participated in requirements gathering, analysis, design, and testing phases.\nExtensively worked on IBM MQ using point-point, publisher/subscriber messaging Domains for implementing Exchange of information through Messages.\nUtilized Hibernate Polymorphic many-to-one associations for the purpose of referring instances of subclasses and participated in design of data base and created tables in ORACLE.\nInvolved in configuring web sphere variables, queues, DSs, servers and deploying EAR into Servers. \nDeveloped and debugged the application using Eclipse IDE. \nInvolved in Hibernate mappings, configuration properties set up, creating sessions, transactions and second level cache set up. \nInvolved in backing up database in creating dump files. And also creating DB schemas from dump files. Wrote developer test cases executed. Prepared corresponding scope traceability matrix. \nRan check styles, PMD Defects, find bugs etc. and fixed them if there are any. \nConfigured EMMA tool and ran test suite and made sure that 100 test coverage. \nImplemented Maven as build and configuration tool. \nUsed Apache Tomcat Application Server for application deployment in the clustered window environment Used Tortoise SVN repository for version control.\nImplemented various J2EE Design patterns like Singleton, Service Locator, Business Delegate, DAO, Transfer Object, and SOA.\nManaged and Maintained Oracle Database in Production domain\nWorked on AJAX to develop an interactive Web Application and JavaScript for Data Validations.\n Used Subversion (SVN) to implement version control System.\nCreated a deployment procedure utilizing Jenkins CI to run the Unit Tests, build Documentation using Natural Docs and create packages for installation and setup the application and its dependencies.\nUsed Maven to build the application and used Log4J for debugging. \nWorked in Spring AOP Interceptors in logging and auditing.\nExperienced in the installation, support, configuration and maintenance of WebLogic server.\nWorked in development of applications using Java and used multithreading for group post enrollment validation.\nDeveloped the code and deployed on the WebSphere (Web Application server) server.\nWorked in RDBMS implementation using SQL, PLSQL on Oracle database.\n\nEnvironment: Java,  J2SE, Spring, Hibernate, JSP, JSON, HTML, Oracle 10g, JQuery, JSON, HTML, CSS, AJAX, Node.js, web sphere, SQL, PL/SQL, XML, XSL, Eclipse, Spring web flow, Ajax, Rest web service.\n\nDream Soft IT Solutions, India.                                                                                                                                                   Aug’08-Oct’09\nRole: Software Developer\nDescription: Dream Soft IT Solutions is known for Customize Solutions Development in the fields of Software Solutions, Web Based Solutions, Industrial Automation, Search Engine, and Web   Hosting Solutions as their major categories of Business.\nResponsibilities:\nDesigned and implemented Java Classes, Interfaces, Model design, and interface layer design with other team members.\nDeveloped JSP’s and Servlets to dynamically generate HTML and display the data to the client side. Extensively used JSP tag libraries.\nInvolved in writing services to write core logic for business processes. \nInvolved in writing database queries, stored procedures, functions etc.\nUsed Java J2EE design patterns. Involved in client server side validations. \nInvolved in writing JDBC code to get data base connectivity. \nImplemented server side validations and developed model classes. \nInvolved in the Database structuring and Tables creation needed for the project. \nInstrumental in tuning the framework to meet the performance standards.\nDesigned and developed web-based software using STRUTS MVC Framework.\nUsed AJAX and Java Script to handle asynchronous requests, and CSS was used to keep uniformly in look of the application.\nEJBs in the application and developed Sessionbeans for the business logic at the middle tier level.\nCreated Test plan documents and testing using Junit Framework.\nUsed JAXB parser for parsing valid .xml files as defined by XSD.\nCreated and modified Stored Procedures, Functions and Triggers Complex SQL Commands for the application using PL/SQL.\nMonitored the error logs using Log4j and fixed the problems.\nDesigned JDBC Connection for data retrieval and updating purpose, also developed connection pool to avoid waiting time for database connection.\nUsed Tomcat server for application development with Eclipse.\n\nEnvironment: Core Java, JDBC, JAXB, WSDL, Rest, JSP, Servlet, HTML, JavaScript, CSS, Apache Tomcats, MySQL, STRUTS, Log4j, XSD. \n",
    "extracted_skills": [
        "agile",
        "angular",
        "communication",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mongodb",
        "mysql",
        "node.js",
        "oracle",
        "postgresql",
        "problem solving",
        "project management",
        "react",
        "scrum",
        "sql"
    ]
}