{
    "id": "resume_515d0e3c-892c-489b-9c49-a5c10562b886",
    "metadata": {
        "filename": "Shail_Tank-Business Analyst .docx",
        "processed_date": "2025-09-24T08:45:53.462405+00:00"
    },
    "raw_text": "Shail Tank\n\nSUMMARY\nAvailable on CTC basis. Please call/email 646442 9382 anthony.reddy at itmmi dot com\nOver 9 years of Business Analysis experience with all major Development Platforms like Web, Handheld Devices (IOS, Android, Nokia and Black Berry) and Desktop.\nOver 4 Years of multi-dimensional BA and leadership experience across project management, and functional domains. A rare blend of Strong Business Analyst and project management experience combined with excellent technical and analytical skills. Co-piloted with top decision makers to craft strategic technical solutions that boosted operational productivity within challenging timelines and providing automated solutions which are proven Time and cost effective to the organization. Successfully delivered complex IT projects and managed large teams both on-site and off-shore model. I am extremely proficient with Gathering Business Requirements, Business Process Flow, Business Process Modeling and Business Analysis. Adept in communications with senior management, business users, vendors, and internal teams to coordinate overall project delivery. Excellent Decision making, Team building and analytical problem-solving skills in conjunction with strong management background. Extremely meticulous and process oriented.\nOver 4 years of Experience as a Product Manager.\nOver 2 Years of Development Experience in .Net C# technology.\n\n\nArea of Expertise\n \nProfessional Experience\n\nCredit Suisse, NYC\t                                            Sr. Business Analyst/AML Business Analyst May 2016 – Till Date\n\nIt is one of the true global banks with an operation unit in NYC. I cater my duties as a Sr. Business Analyst for web applications along with Mantas Business Analyst in the AML Transactional Surveillance Group since May 2016 till date.\n\nResponsibilities:\nExecuting requirement gathering sessions (Meetings & brain storming sessions) with SMEs for the MANTAS and Web application projects. \nConducting Net Meetings and Conference Calls to gather requirements from business and am acting as a liaison between business and the IT Resources.\nConducting JAD Sessions with the offshore team to design a feasible solution.\nProviding Technical Assistance in identifying, evaluating and developing systems and procedures that meet the user requirements.\nConverting the captured requirements into a BRD.\nWorking with different SMEs to get the project Signoffs.\nManaging cross functional teams which are scattered by the geographical location. My teams are located in USA, India and UK. (Switzerland, London etc.)\nMapped the attributes provided by all source providers (Front Office systems) for Account, Account Address, Account to customer, Customer, Customer Address, Front Office Transaction (FOT), Front Office Transaction party (FOTP), Security, Settlement Instruction and Trade Execution feed files.\nWorking as am SME from Mantas for the Palantir implementation project. \nSupporting the source systems from Mantas team throughout the SDLC process.\nExtensively working with Data Mart Team to get the source system mapping implemented.\nUpdated the Data Mapping document to reflect the changes made during development phase via Change Requests (CRs) and defects.\nSupporting DataMart by responding to queries related to data mapping, data processing and data consolidation.\nWorking closely with Business Units, Development – Testing – Training and documentation teams during the entire Software Development Lifecycle.\nCreated and updated various process and functional documents like SAD, DataMart Consolidated Logic Document, ETL process Document, MD5 checksum implementation document etc.  \nConducting UAT and assisting business and the QA team by performing Functionality and Sanity Testing when needed.\nOn-boarded Mantas Americas on JIRA.\nProviding Oracle reports for the web tool via backend on ad hoc requests.\n\nEnvironnent: \nMantas 8.1.3, Oracle 11g, PLSQL Developer, MS Office 2013, SnagIt 11, Microsoft Visio 2007/2010, Quality Center 11.0 (ALM), Control-M, JIRA.\n\nT-Mobile, Parsippany – NJ \t\t      Sr. Business Analyst/Project Manager/Product owner\nMarch 2011- April 2016\nT-Mobile is one of the largest Telecom Company in the country. The company’s Environment is extremely dynamic and my Responsibilities of as a BA Incorporates Project Management for Cell Sites from Inception till the On Air Status and also acting as a Business analyst / Project Manager for over 40 Web – Desktop and Mobile Applications catering to multiple flavors of In-house customers.\n\nResponsibilities:\nMy Role is a mix of a Business Analyst and a Project Lead. I decide the project approach as well as the project plan – initiating from creating a Business Requirement from new Request to Validating the Final Built.\nPerformed structured and unstructured interview sessions with the Technical support team and Managers to understand the “AS-IS” process.\nConducted Net Meetings and Conference Calls (Bridge) to gather requirements from the SMEs.\nExtensively interacting with the Clients, Senior Management, Application Developers and Operational Team, have communicated / provided documentation of innovative solutions to exceed the achievement of the business objective. \nActing as the Product Manager for 16 Applications and Business Analyst / Project Manager for my 42 Applications.\nAnalyzed the gathered requirements and documented a BRD defining the process for the new and existing system(s).\nCreated Use Cases and Data Flow Diagrams from the Requirements and provided Process Models and Sequence Diagrams for the same.\nCreated Wireframes for the applications for all platforms (Web – Desktop – Mobile).\nDefined and implemented SDLC Time Line for the Projects.\nUpdated and Maintained the Online Business Requirement Documents Repository (InfoRouter). \nInitiated and completed planning and analysis of business problems to be solved with automated systems. \nPresented the Proof of Concept (POC) to Management and Business. \nProviding Technical Assistance in identifying, evaluating and developing systems and procedures that meet the user requirements.\nExtensively performed Impact Analyses based on the Requirements as multiple interfaces are amalgamated together for a process to execute.\nActing as an Administrator for the creation and maintenance of the SharePoint 2007/2013.\nIdentified Actors, created Use Cases and developed Use case and Activity diagrams.\nScheduled and Conducted User Acceptance testing (UAT) for all production releases. \nPerformed Functionality Testing to assist QA team. \nPerformed Load Tests in Load runner.\nProficient with Quality center 11.0 (ALM)\n\nEnvironnent: \nMS Office 2007/2010, SnagIt 8/11, Microsoft Visio 2007/2010, Quality Center 11.0 (ALM), Load Runner 9.2, SQL Management Studio 2003, Citrix Server, SDLC Management Dashboard (in house Project Management Tool), HOMER (in house Trouble Ticketing /  Work Order System), InSite (in house Cell Site Management Tool), Office Communicator 2007/2010.\n\n\nThomson Reuters, NYC  \t\t\t\t\t\t\t        Business Analyst\nApril 2010 – March 2011\nThomson Reuters is a leading source of intelligent information for business and professionals. They combine industry expertise with innovative technology to deliver critical information to leading decision makers in the financial, legal, tax and accounting, healthcare, science and media markets. The project needed to be work done with the developing team for “Thomson Reuters Messenger”, which deals with sharing files, quotes, rates and other important information amongst the brokers, Investors and employees\n\nResponsibilities\n\nCollaborated with the Project Managers and determined the project approach involved in the preparation of project plan.\nConducted interviews and JAD sessions to gather requirements from internal and external users / stakeholders. \nDefined the software development life cycle using RUP and documented future business process.\nDocumented, communicated, managed system requirements and maintained requirements traceability matrix to keep members up to date with the latest changes if any.\nConducted net-meetings and conference calls to facilitate requirements gathering process with business users.\nPerformed structured and unstructured interview sessions with the Technical support team Managers to understand “AS-IS” process.\nAnalyzed the gathered requirements and documented a BRD defining the process for the new system.\nIdentified the Actors, Use Cases and developed Use case diagrams and Activity diagrams to describe how the actors would interact with the system.\nImplemented User Requirement Specification Document (URS) and verified the functionality coverage.\nInteracted with Users, Developers, Project Manager and SMEs to understand the business process, identify enhancements and gather Business Requirements.\nDeveloped user manuals, presentations and training manuals as per project specifications and timelines.\n\nEnvironnent:\nRUP, MS Office, MS Visio, JAD Sessions, Erwin, UML, Microsoft Visio, Rational Requisite Pro, MS Excel, MS PowerPoint, SQL\n\nHigh Point, Lincroft – NJ \t\t\t\t\t\t\t       Business Analyst Feb 2009 – April 2010\nHigh Point is a provider of property and casualty insurance benefits. The Auto Claims project was on the Intranet claims processing system that adjudicated claims based on the business rules and policies. The adjudication process determines whether the claim should be paid or denied.  Complex or ambiguous claims were put in a PEND status and would require manual intervention by processors to adjudicate the claim.  Online adjudication was done using the claims online system, which was also used for entering and adjudicating paper claims that cannot be converted into electronic format.  The customer service department uses the online system to respond to queries from members or providers.\n\nResponsibilities:\nSimultaneously worked on the project and streamlining the Claim Processing System project and was responsible for their delivery.\nConducted triage meetings and came up with all required documentation throughout different phases of the project abiding by the quality standards of the company and keeping up with the scheduled time frames.\nManaged all the requirements using Requisite Pro and created traceability between requirements and various items.\nCreated Business Requirement Documents (BRD) after identifying all the user requirements.\nCoordinated with various teams onsite and offshore and was the point of contact across various teams involved in making the project a success.\nInteracted with business users to analyze impact on the existing system and the changes in the Aetna claim adjudication application. \nModeled business processes with emphasis on workflow driven requirement engineering and identified areas of improvement by automation.\nInvolved in cost and GAP analysis through various project phases.\nCreated use case diagram using UML 2.0 and managed the entire functional requirements lifecycle using AGILE.\nInvolved in handling business intelligence and responsible for implementation and delivery.\nInteracted closely with SMEs to understand and visualize the problem domain.\nWriting queries by using SQL and create sample databases for testing purpose \nWorked closely with the Business Owner to create UAT strategy, scenarios, and test scripts, based on “day-in-the-life” scenario.  Documented entry/exit criteria, project/product risks and created several other artifacts for product acceptance.\nReviewed test cases and defects created by QA team.  Assigned resources and coordinated defect resolution.\nInvolved in bug tracking using Quality Center\nPrepared and communicated daily test status report to management and team.\n\nEnvironment: \nAgile, Requisite Pro 7.0, Rational Rose, Test Director, UML, Edit Plus, Java Script, Web logic, J2EE Server, MS Office, UNIX, Windows, Java, HTML, DHTML, XML\n\nTarget Corporation – Minneapolis, MN       \t             \t\t \t         .NET Developer\nApril 2008 – Feb 2009\nCPR is a client server based tool for internal use. This application is used internally for Bid Room where stores take customer orders and send them to Bid room as bids order. Once the bid reaches bid room the associates generates bids for the orders.  Second phase of the project is to develop an application that updates the credit card information from flat file to the system’s database and generates report based on the credit card information. I have been involved in gathering requirement specifications, designing and developing the application that also includes prototyping and low level designing.\n\nResponsibilities\n\nInvolved in requirement analysis, GUI design, database design, and development and testing of the CPR using Microsoft Visual Studio 2008/2005.\nInvolved in High and low level designing of CPR.\nDeveloped a Win Forms Application by using WPF to design GUI and the key components of the CPR in C# and .NET framework 3.5\nDeveloped Custom templates and resources for changing appearance of the controls in WPF.\nImplemented WCF for developing web services for accessing data from database server.\nDeveloped Web Pages using ASP.Net and C#.\nDesign and development of classes using C#.Net, ADO.NET, XML for database connectivity.\nCreated and developed Properties and implemented routed events in C# and XAML.\nDeveloped 3DModule Animation in XAML.\nUsed Dataset, Data Reader and Data Adapter classes of ADO.NET for accessing data from the database server.\nDeveloped Win Forms (Windows Forms) Service for configuring a timer service in the application by using C#.\nWrote different SQL Stored procedures Triggers, and Indexes in SQL to manipulate the data.\nMaintained the user roles and security management.\nDeveloped a Setup Package to install Win Forms Application on client’s machine.\nInvolved in SQL Server 2005 Reporting Services to design various kinds of reports.\nDeveloped, Monitored and debugged the project.\nCreate project and product definition documents; such as functional specifications.\n\nEnvironnent:\nASP.NET 3.5/3.0, C#3.0, ADO.NET3.5/ 3.0, Visual Studio 2008/2005, Win Forms, Web Forms, HTML, DHTML, XML, XSLT, JavaScript, IIS 6.0, SQL Server 2005.\n\nAllstate Corporation, Northbrook – Illinois.                                       \t                     .NET Developer March 2007 – April 2008\n\nAllstate is one of the largest corporations of United States and sells 13 major lines of insurance, including auto insurance, home insurance, life insurance, and commercial insurance. Allstate wanted to build a portal for new features that would have to be accessible through the Customer Care Center interface. The company needed to sign in customers to two distinct systems while requiring only a single user name and password connecting two Web applications.. As the customers only had excess to their property and vehicle policies through the company's Web portal. Allstate also wanted to give access to their life and annuity insurance policies. To fulfill the requirements we used user authentication, identity management procedures, and a user interfaces.\n\nResponsibilities\n\nInvolved in web development using Microsoft Visual Studio 2005, Microsoft .Net Framework 2.0, C#, ASP.net, IIS, .Net, SQL Server 2005 (stored procedures, triggers, etc).\nFollowed entire SDLC life cycle in this project from Requirement, Design, Coding, Testing and implementation.\nDeveloped user interface using ASP.NET.\nExtensively used Master pages and Themes to suit client needs using ASP.NET.\nDeveloped data access components and business logic components using C# object oriented programming.\nExtensively worked on Web Services in order to make phone calls using our website.\nDeveloped Windows services for Job Scheduling.\nDeveloped Custom Exception Block to catch error and give a custom error.\nUsed ADO.NET for SQL Server database interactions using Data Adaptors, Data Reader and Dataset.\nDeveloped a complex SQL Stored procedure to manipulate Data.\nExtensively worked with Data Grid, Data List and Repeater to populate data with different templates\nWorked in Rich XML Support, Web enabled Analysis, Application hosting, Security, Full Text Search, improved developer productivity, Scalability and simplified database administration features of SQL 2005.\nTested the Various Modules of the System thoroughly and fixed the Bugs.\nPerformed unit testing by assigning the bugs to tester using Defect Tracking Systems (DTS).\nDeveloped preparation of High Level Design Document, Low Level Design Document and Design Review Checklist Templates.\nWorked in designing, normalizing databases, created tables, indexes, Stored Procedures of MS SQL Server 2005\nGenerated Reports using SSRS\nUsed VSS for maintaining the component and for release and version management.\n\nEnvironnent:\nVisual Studio 2005, .NET Framework 2.0 , C#, ASP.NET, ADO.NET 3.0, SQL Server 2005, Web Services,  XML, XSLT, Microsoft SQL Reporting Services (SSRS).\n\nEducation:\nNew York Institute of technology (N.Y.I.T), Master of Business Administration (MBA) May 2016\nMS University, Gujarat, India. Bachelors of Business Administration (B.B.A) Dec 2004\n\n",
    "extracted_skills": [
        "agile",
        "asp.net",
        "c#",
        "html",
        "java",
        "javascript",
        "jira",
        "leadership",
        "oracle",
        "project management",
        "sql"
    ]
}