{
    "id": "resume_06f77bc7-89f3-4f94-acc4-1a84280bfdce",
    "metadata": {
        "filename": "Shaker Resume.docx",
        "processed_date": "2025-09-24T08:45:53.674278+00:00"
    },
    "raw_text": "B Shaker                                                                             \nBusiness Systems Analyst/Scrum Master \nEmail: shaker.0516@gmail.com Phone no: 714-200-9052\nINTRODUCTION\n9+ years of experience in the field of business and data analysis supporting software solutions and analyzing business operations on various domains such as Banking,  Finance and Insurance. Worked in various software development environments including waterfall and agile methodologies including Scrum, Kanban, XP and SAFe. Implemented multiple projects in SOA architecture and dealt with APIs, SOAP and RESTful Web Services. Worked in the capacity of a certified Scrum Master by facilitating all scrum ceremonies, resolving Impediments and dependency issues. Proficient in data analytics – SQL querying, Ad Hoc / Canned report generation using tools like IBM Cognos BI and Tableau.\nPROFESSIONAL SUMMARY\nPossess excellent business writing skills required for documenting, Business Requirements, Functional Requirements, Non-Functional Requirements and System Requirements Specification.\nStrong Leadership skills in handling multiple teams and Offshore teams and ability to effectively communicate with senior management, third party vendors, technical staff and Business users to improve business value.\nExperience in conducting GAP analysis, Impact analysis, Feasibility study, Cost-benefit analysis, Risk analysis, and ROI analysis.\nGood Exposure in Mortgage domain and the acts like CFPB (Consumer Financial Protection Bureau), TILA (Trust in Lending), RESPA (Real-Estate Settlement Procedure Act), and TRID (TILA-RESPA Integrated Disclosure).\nStrong experience in all the phases of SDLC Life Cycle such as Analysis, Design, Development and Testing and UAT.\nKnowledge on UI development languages such as HTML5, CSS3, AJAX and Java Scripting languages.\nComprehensive knowledge of SOA related concept such as APIs, SOAP and RESTful Web Services, web methods, XML, JSON, XSD, WSDL, URI and web architecture, business engines and web orchestration.\nExtensive implementation knowledge of Databases, Data table structures, Data warehousing, Schemas, Data Marts, OLAP operations like drill Through, slicing/dicing using BI tools.\nExtensively interacted with the designers, developers to ensure functional implementation of business requirements and the QA team in executing Test Plans, Test Case scenarios, Test Logs, Test Objectives and Test Automation.\nHands on experience in Master Data Management (MDM), managing Data and ETL processes to support solution needs. \nProficient in writing user stories (INVEST format) and handling the requirement churn. Efficient at facilitating Estimation techniques such as Planning Poker, T-shirt sizing, Relative Mass Valuation and Prioritization techniques such as MoSCoW and WSJF methods. \nExperience in maintaining Scrum Artifacts like Product Backlog, Sprint Backlog, Burn down and Burn up charts.\nHands on various tools such as MS Word, MS Excel, MS PowerPoint MS Visio, Atlassian  Jira, Rally, Team Foundation Server (TFS) and MS Project Professional for planning, tracking and managing projects.\nExperience in creating SQL queries/ SQL scripts for data analysis including triggers procedures.\n\nTechnical Skill Stack:\n\nFarm Credit bank of Texas                                                                                             \nBusiness Systems Analyst/Scrum Master                                                                                    Sep 2016 – Present\nAustin, TX\nProject: Mortgage Loan Origination System\nProject Description: Scope of the project was to provide business users with a unified and integrated web based application for Mortgage Loan Origination and Processing. The application will be used from the initial contact with customer through the final closing documents. The system performs all the Business functions of the loan process such as set-up Accounting formation, New Loan set-up, the Appraisal, credit, and income. This is built to maximize loan efficiency, maintain current staffing levels and double production volume within the current fiscal year.\n My Roles & Responsibilities:\nUsed various Elicitation techniques like Document analysis, Group Discussion, requirement workshop, JAR session.\nCreated Sequence and Activity diagrams for better understanding of the process using UML tools.\nWorked with SMEs and Developers to develop and design the GUI of the system by using MS Visio.\nSupported multiple Scrum teams by tracking inter-team dependencies and ensuring those were being mitigated by working with the Product Owner by maintaining a risk log and creating a plan.\nUsed SharePoint to store the all the artifacts such as BRD, SRS, Communication plan and Traceability matrix (RTM) etc.\nAssisted UI and UX team in creating Mockups and Wireframes.\nAssisted in creating WebPages with the help of HTML5, CSS 3, AJAX and Java Script.\nUsed UDDI to identify relevant web services. Created Stub data for web service testing.\nSuccessfully transitioned Agile scrum team from Waterfall to Scrum and implemented Scaled Agile Framework (SAFe).\nInvolved in the Train Planning Event(PI) and team breakout sessions to groom features for each increment.\nFacilitated Scrum Daily Stand-ups, Sprint Planning, Sprint Review, Backlog Grooming and Sprint Retrospectives and efficiently time-boxed the events.\nLed story writing sessions with an aim of decomposing the scope into epics and user stories with product owners. Also, worked on the acceptance criteria for the above developed user stories.\nEnsured that every task is tracked and updated in JIRA tool by the team and regularly monitored the progress.\nAssisted the Product Owner and the Scrum team in prioritizing product backlogs using MoSCoW technique and in estimating effort through Planning Poker. \nUtilized Rally for metrics/reports, user stories and defect tracking.\nClosely worked with upstream and downstream dependency scrum teams to resolve the dependency issues. \nWorked on Mulesoft ESB in terms of mapping the web serives and APIs\nInvolved in the development of APIs and web services along with Middle tier developers also involved in developing the web orchestration for loan underwriting process.\nWorked on designing the request and response of web methods and test those in SOUP UI.\nAssisted the Web service team in defining the business rules in Business Rule Engine as per the Mortgage programs and rates.\nworked with end to end SOA teams and tested SOAP and RESTful web services using SOUP UI.\nCreated Requirement Traceability Matrix (RTM) to make sure all the requirements are covered with test cases.\nFacilitated UAT sessions for end users and collaborated with business team to get UAT sign offs.\nClosely worked with database developers and ETL developers in terms of data modeling and data mapping while migrating the data from source systems to target systems.\nExpertise in writing the SQL quires like Update, Create, Select, joins.\nFacilitated triage calls between development team and QA team for resolving issues.\nEnvironment: SAFe, Scrum, HTML5, CSS3, AJAX, node.js, MS Office suite 2013, MS Visio 2013, Sharepoint, Mulesoft ESB, Informatica Power Center 9.6, Cognos BI 10.4, SQL, Oracle 11g, Sharepoint2013, Jira, HP Quality Center, Teradata.\nJPMC                                                                                                                                              \nBusiness Data Analyst/Scrum master                                                                                   Feb 2015 – Aug 2016\nWilmington, DE         \n\nProject: Data Warehouse\nProject Description: The project specifically aimed to develop a data warehouse on Nonperforming assets for internal business analysis which helps in generate complex reports by using business Intelligence tool such as Cognos BI for better strategic decision making and Develop the Dashboards as per business requirements.\n My Roles & Responsibilities:\nCoordinated with business owners to Identify operation data sources(ODS) like mainframes, OLTP systems, CSV files.\nworked with Database architects to understand the Data flow in Data warehousing.\nClosely worked with Data Analysts/Developers to understood the database schemas of multiple operational databases.\nParticipated in developing user stories along with Product Owner, Dev lead and QA lead.\nActed as a liaison between management and Data Warehouse management team. Involved in Project Management activities like managing project scope, schedule management, creating project plans, project status and deliverables.\nResponsible for writing user stories in JIRA for each iteration based on the Charter and Epics.\nExtensively interacted with data analysts during the ETL operations in identifying the source databases from OLTP systems and implementing the transformation logic for achieving data uniformity in operational data store (ODS).\nPerformed Data mapping and logical data modeling also prepared ER diagrams for the system.\nExperienced in developing conceptual, logical models and physical database design for OLTP, OLAP systems and Master Data Management (MDM).\nClosely monitored burn down charts to keep track of outstanding work and tracked the velocity and capacity.\nConducted user sessions and created user stories based on the requirements gathered in sessions.\nResolved impediments during the collaboration meetings discovered in daily standup meetings.\nCoordinated with the Cognos BI developers in building packages and developed various reports like Cross Tab, Master Detail and different charts including Line, Column, Area, and Pie Charts for analysis.\nUsed Visio to prepare Use Case, business process flow (BPMN), sequence and activity flow diagrams.\nUsed various SQL commands like Create, Delete, Update, and Inner, Outer, Left, and Right Joins to update the database and retrieve data for data analysis and validation along with creation of stub data.\nCoordinated the execution of Unit Testing, Data Migration Testing, Performance & Service level testing and User Acceptance Testing (UAT).\nEnvironment: Scrum, HP ALM, MS Office Suite, Rally, MS Visio 2010, SQL Server Services, Cognos BI, Informatica, Oracle\n\nFiserv                                                                                                                                   \nScrum Master                                                                                                                                   May 2013 – Jan 2015\nAlpharetta, GA \n\nProject: Wealth Management System\nProject Description: The idea was to develop a fully-featured software application, a Wealth Management System, as a single solution that would replace the Excel spreadsheets, CRM functions, calendar requirements, treasury services etc. The application includes a cock-pit like UI functionality for the advisors to have a 360-degree view of the investment instruments along with vast analyses and reporting functionalities.\nMy Roles & Responsibilities:\nGathered Business requirements by conducting JRP session, One on One interview and Group sessions with Stakeholders and business Users\nInvolved in Developing asset allocation models diversifying risk by researching funds using fundamental analysis.\nFacilitated sprint planning meetings, daily standup meetings, sprint review, sprint retrospectives.\nClosely monitored burn down charts to keep track of outstanding work and tracked the velocity and capacity.\nShadow and assist some of the Product Owner activities by providing high level estimates, prioritizing stories for the sprint and maintaining backlogs and release plans. \nResolved impediments for scrum team members by facilitating collaborative meeting.\nFacilitated Sprint review meeting to demonstrate potentially shippable product to stakeholders.\nFacilitated Sprint retrospective meetings to gather feedback. Made sessions interactive using Idea boards.\nProficient in Rally for defect, task tracking.\nFacilitated Scrum of Scrums to resolve dependency issues between different teams.\nManage the assignment of user stories to relevant BAs based on the feature and process expertise. \nSuggested several process improvements within the ratings process and suggested solution options to automate manual data entry tasks performed by Data Managers.\nperformed manual testing in each sprint and recorded the Test Status and raised  the tickets on Defects by using HPALM.\n\nEnvironment: .Net, Scrum, HP ALM ,Windows (98/XP/7/Vista/8), MS Office Suite, Jira, , SQL, Oracle, Tableau, HTML, CSS, Json, XML, Soup UI, HP ALM, Jira,\n\nFactset Research Systems, Hyderabad, India                                                                                 \nBusiness Analyst                                                                                                                              Feb 2010 – Nov 2012\nProject Description: Scope of the project was to develop a intranet application to maintain and tack the tickets raised by the Factset Economics from the different team like production, Validation, QA/Monster. \nMy Roles & Responsibilities:\nCollected and documented business processes as well as business rules and Performed GAP analysis.\nParticipated in the identification, understanding, and documentation of business requirements, including the applications capable of supporting those requirements. \nResearched and assessed client systems and business processes.\nTranslated the business needs into system requirements, communicating with the business on a non-technical level, and with the System Analyst on a more technical level. \nInvolved in walkthroughs with business team, architects and developers to refine the requirements.\nGenerated use-case diagrams using UML.\nImplemented Traceability Matrix and User Requirement Specification Document (URS) to verify the functionality.\nStreamlined clerical work processes and mapped to the automated system.\nInvolved with the Software Quality Assurance (SQA) Team to develop Test plans.\nEnvironment: MS Visio, UML, SQL Server, SQL, MS Office and Windows 2000\nICICI Lombard, Hyderabad, India\nBusiness Analyst                                                                                                                               June 2008- Jan 2010\nThe scope of the project was to create a single, integrated system that will execute the calculation of sales compensation, for both external producers, based on consistent and reliable information captured from pre-determined data sources, improving business processes and controls, ensuring compliance and flexible reporting capabilities.\n\nMy Roles and Responsibilities:\nInterfaced with subject matter experts (SMEs) and users to gather business requirements.\nCommunicated project status regularly to key business stakeholders and lead UAT testing activities coordinating with users.\nSuccessfully conducted (JAD) Joint Application Development sessions with the cross-functional team members for discussing various shared issues to ensure that business requirements are met and requirements are understood at all levels.\nImproved efficiency within the team by redesigning work flows and business processes.\nPrepared use case documents using MS Visio and UML.\nExecuted and designed SDLC cycle from inception to deployment (Requirement Analysis, Test Planning, Test Cases, Script Development, Test Execution, Test Reporting, Test Result Analysis and Defect Retesting).\nDeveloped complex SQL scripts to validate data integrity in the application.\nDeveloped test cases and test scripts and performed testing using HPQC.\n\nEnvironment: Waterfall, SQL, MS Visio, MS Project, MS Office Suite, HP ALM, Teradata\nEducation Details:\nBachelors in Mathematics from Osmania University, Hyderabad, India.\nMasters in Computers Information Systems from California University of management and Sciences. \nCertifications:\nScrum Master Certification from International Scrum Institute\nProfessional Scrum master I (PSM I) Certification\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "css",
        "data analysis",
        "html",
        "java",
        "jira",
        "leadership",
        "node.js",
        "oracle",
        "project management",
        "scrum",
        "sql",
        "tableau"
    ]
}