{
    "id": "resume_89361a7d-6ae2-424c-87e8-58985a1689fd",
    "metadata": {
        "filename": "Shiuli Mahmud.docx",
        "processed_date": "2025-09-24T08:45:54.105485+00:00"
    },
    "raw_text": "SHIULI MAHMUD\nSr. BSA/Project Coordinator\n\n30 Liberty Avenue, Jersey City, NJ-07307\n\nPROFESSIONAL SUMMARY\nOver 10 years of experience as a Business Analyst, Project Coordinator, Product Owner, Six Sigma (Black Belt), Operations Management, Business Consultant, etc.\nExperience in Insurance, Healthcare, Manufacturing, Financial Services, Retail Banking, Utility Management company and Real Estate domains..\nApplied Six Sigma, Lean and KT tools and techniques to define measure, analyze, improve and control project processes. \nStrong skills in Project Management, IT Security and Regulatory compliance, interpersonal relationships, and communication (written and verbal).\nAdept in working within cross functional &amp; geographically dispersed SCRUM teams acting as a Product Owner for various modules within the Portal including Software Products\nProject Coordination experience by planning, executing, controlling / tracking, documenting, capturing, managing, and communicating requirements and following up throughout the Software Development Life Cycle (SDLC) and project life cycle.\nSkilled in developing Business Requirements Document (BRD), USE Cases, Functional Requirement Specifications (FRS), Systems Design Specification (SDS), UI, Business Continuity Plan (BCP), GAP analysis, Cost Benefit analysis, Impact analysis, Risk analysis, Establishing process controls and its Management, Testing, and preparing Training and Knowledge Transfer manuals. \nExperience with Rational Unified Process (RUP) methodology, Unified Modeling Language (UML), Visio, and Requisite Pro, knowledge of Agile /SCRUM and Waterfall methodology.   \nExperience in conducting Joint Application Development (JAD) sessions with end-users, SME (subject matter experts) team, development and QA team for project meetings, walk-through and customer interviews.\nCoached team members in understanding Six Sigma, Lean and KT principle\nData analysis skills using Minitab, Excel, Six Sigma tools, Pivot tables/ Pivot chart reports, SQL etc.\n\nEDUCATION & CERTIFICATION:\nPh.D. in Environmental &amp; Resource Engineering (Graduated in 2013)\nSUNY ESF College, Syracuse, New York\nMaster’s Degree on Computer Science\nIFESCU, Bangladesh\n\nBlack Belt Six Sigma Certified\nGreen Belt Six Sigma Certified\nProject Management, American Project Management (APM), California\nOSHA Training, RIT (Rochester Institute of Technology): NewPage Company (10 Hours in-site).\nCPBIS-PIMA Management Course for Enhanced Performance; IPST, Georgia Tech University, Atlanta.\nInternational Scrum Master certification\n\nTECHNICAL SKILLS:\n\nPROFESSIONAL EXPERIENCE:\n\nClient:\tCygnet Info-Tech                                                                                                \t\tJuly 2017 – Till Date\nRole:\tSr. Business Analyst/Project Coordinator \nRoles and Responsibilities\nAnalyzed business opportunities and offered practical and innovative solutions to customer.\nDeveloped new products according to the customer requirements, \nCoordinated with marketing and media departments to build innovative marketing strategies for the company.\nHold planning meetings for the team and split the effort into effectively measured pieces of work \nResponsible for preparing Software Requirement Specification (SRS).\nProduct management executive responsible for defining entire product portfolio vision, strategy and roadmap, often times acting as the executive for product. \nCreated Process Work flows, Functional Specifications documents.\nProduct management executive responsible for defining entire product portfolio vision, strategy and roadmap, often times acting as the executive for product. \nAnalyzed and developed Business Requirements documentation, which identified the work area definition of the proposed application from the user perspective.\nAnalyzed system test requirements, Functionality, developed Test Plans, Test cases, Prepared Test Data and managed them using Test Manager\nCoordinated with different people in Project to keep track of all the bugs and updating the track of the bugs using Test Director\n\nClient:\tRSNY (Healthcare Facility)                                                                                       (January, 2017 -June, 2017)\nRole:\tSix Sigma – Project Coordinator \nRoles and Responsibilities\nSupported organization-wide performance/quality improvement and compliance programs and served as a project manager for multiple priority initiatives.\nEngaged with management and administration to identify organizational goals, resources and constraints. \nGuided the project team, conducted appropriate analysis, met project goals, managed timeline, and worked with the business owner to successfully implement the annual action plan, new processes, technology or strategies.\nParticipated in performance measurement and contributed to development and execution of quality management and improvement plans\nProduced tangible operational and financial results for the Healthcare Facility.\nSupported front line staff and Process Owners with identifying, scoping and executing projects. \nActed as a change agent to instill Lean Sigma culture throughout the organization.\nModeled and simulated, through physical mock-ups and virtual (mathematical modeling, space modeling and statistical analysis) to analyze existing systems and prototype potential design changes. \nCollected and analyzed data for determining an improvement strategy, participated in project phase reviews, documented project status, and coached existing and new Lean Sigma trainees through improvement projects. \nUsed high level of organizational skills to manage projects, timetables and implementations. \nUsed advanced interpersonal skills to direct and coordinate the activities of multiple departments, to positively communicate and worked with professionals at all levels of the organization.\n\nClient:\tNorthwestern Mutual Life Insurance and Financial Services, Milwaukee, WI  \t\t(Sep’14 – March’16)\nNote: Joined as a Business Analyst (Product Owner) for one project, and then served as a Business Consultant within the same company.\nRole:\tSr. Business Consultant\t\t\t\t\t\t\t\t\t \nRoles and Responsibilities\nAs a Business Consultant, I was involved in the following tasks –\nGathered the client requirements and managed the requirements of an IT Security improvement project to upgrade from HP Nemo system to HP Autonomy system. \nActed as a liaison between the different stakeholders involved. I was the primary interface between the Client and Project Team and was responsible to provide the Project Technical team with client requirements as user stories. \nDelivered client requirements in a timely manner and ensured client satisfaction by handling unique project situations, under minimal direction.\nEvaluated Project Risks and created risk management plans.\nEstablished process controls after extensive data analysis and managed it.\nWorked closely with the clients daily in understanding reporting issues, problem analysis, identifying process issues, setting deadlines, providing possible recommendations, seeking feedback from the technical team and communicating that to the business clients.\nValidated the deliverable created by IT developers against functional specifications.\nCreated User Guides for some functionality of HP Autonomy Application.\nCreated/ Maintained technical documents, e.g. User story documents, change request documents, transition documents, New request documents/ defect tracker, POC document, test results documents, etc and many such documents.\nCreated several Process Maps.\nHelped the Testing team by conducting performance tests on different functionality of the newly implemented HP Autonomy Application, to ensure that it met NM requirements.\nStrong writing and communication skills. \nSelf-reliant on setting deadlines and prioritizing reporting works. \t\t\t                   \nOrganized demo sessions for internal and external customers.                                                             \nCoordinated with different teams involved in a POC project, e.g.  IRM, Sharepoint Team, HP team, Actiance Vantage team, etc.\n\nSr. Business Analyst (Scrum Product Owner) \nThe day-to-day management of the Product Backlog and full participation in all sprint ceremonies like the Sprint Planning Meeting and daily stand-ups.\nEnsured that the requirements are clear and complete, made adjustments in line with overall business value and ultimately accepted or rejected the software development works.\nMaintained the product backlog for my team.\nExecuted responsibilities with an understanding of the product vision, strategic objectives, and     priorities.\nPrioritized stories in the product backlog for a specific team, according to business value.\nHelped in Planning and execution of the Enterprise Service Request Center to process work requests. \nIdentified and managed the project risks and managed it according to the risk management plan.\nExperienced with agile software development methodologies.\nTranslated high-level strategy & product direction into features, epics and user stories; prioritize in the product backlog for selection for sprint backlog.                                                                                                                    \nServed as the primary interface to the Scrum Team and was responsible to provide team with user stories and help the team define the business-driven test cases.                                                                                                \nUsed SQL Server Reporting Services to follow Management decisions.                                                            \nIdentified product release content and time line.\nConveyed the vision and goal at the beginning of every release and sprint to Development Teams.\nRepresented the stakeholders, end users and customers to the team, answers questions, and provided direction.\nAssisted with the elaboration of the user stories and requirements.\nParticipated in the planning meetings, reviews (demo) and retrospective meetings\nCoordinated with other Agile Product Owners to coordinate release planning for cross-product initiatives.\nWorked as the primary interface to the Scrum Team and was responsible to provide team with user stories and help the team define the business-driven test cases\nAccepted or rejected product development results from a team\nIdentified and prepared materials for and, as needed, delivered internal training for new features.\n\nClient:\tBarclays, WI, DE\t\t\t\t                                         (July’12 – March’14)\nRole:\tSix Sigma Business Analyst\t\t\t\t    \t          \nBarclays Bank is a financial institution offering a variety of bank accounts. The application is built in client/server technology to create and maintain various accounts and account types. Users can perform various tasks like verifying balance, payment of recurring bills and transfer of funds between accounts.\nRoles and Responsibilities\nDetermined user/business/functional requirements. Created vision, scope, and use case documents; business process models, use case diagrams, activity diagrams, and state chart diagrams.\nTranslated non-technical needs from clients into technical specifications for the internal project team.\nUtilized RUP to configure and develop process, standards, and procedures.\nPerformed GAP and Risk analysis of existing system and evaluated benefits of new system.\nConducted Joint Application Development (JAD) sessions with stakeholders throughout SDLC to resolve open issues.\nValidated technical designs created by IT developers against functional specifications.\nWorked with QA team to design test plan and test cases for User Acceptance Testing (UAT).\nInvolved in Risk assessment and creating risk mitigation plan.\nCoordinated work plans between project manager and client using MS Project.\nCreated documentation for training and Help Desk teams.\nWorked with clients, and subsequently, coordinated with internal designers, developers, and PMs to complete a solution.\t\t\t\t\t\t\t\t\t                   \nUsed SQL Server to meet client requirements in reporting.\nCreated measurable business improvement by partnering with leaders, process owners and project teams to identify strategically relevant improvement opportunities and converted those opportunities into successfully completed projects using Lean Six Sigma methods and tools.\nMapped processes and business offerings, and conducted Requirements Elicitation Discovery Sessions, Solution Assessment & Validation, Pareto Analyses, and Current State-Future State Sessions with all stakeholders and Subject Matter Experts (SME) for several business and technical functions. Business Process Improvement included Root Cause Analyses, Cause-Effect Diagrams, Entity Relationship Diagrams, and Class/Context Diagrams.\nEstablished controls based on six sigma analysis and managed it.\nActed as a change leader throughout the organization to establish a process management culture and facts-and-data mindset. Helped to drive establishment and refinement of metrics that give visibility into opportunities, insight into root cause and accountability for improvement.\nProvided consultative support on improvement recommendations, including changes in the organization, management methods, work practices and process design.\nMined data, conducted statistical analysis and established persuasive and compelling business cases to support recommendations and aid business leaders in prioritization.\nTrained, mentored and coached leaders and team members in applying Continuous Improvement approaches and Lean Six Sigma methods and tools.\nDeveloped and utilized tools, techniques and templates for structuring and organization information in support of decision making processes.\nProvided leadership with project status updates and monitor all aspects of projects to achieve the project objectives on time and to the specified cost, quality and performance.\n\nClient:\tEaton Corporation, Cleveland, Ohio \nRole:\tBusiness Analyst                \t     \t   \t \t                                          (March’11 – June’12)\nI worked as a Six Sigma Business Analyst at Eaton to assist the Product Manager to help out end customers (data center managers) to control and lead the continuous improvement of their data centers. I was involved to ensure process improvement efforts are driven throughout the organization to help Eaton serve customers safely, reliably and efficiently and to develop a high performance culture. I also assisted in performing high level testing on the entire system as well as in developing the Test Plan, writing of Test Cases and Scripts for manual, and automated testing for the web- application.\nRoles and Responsibilities\nFollowed (RUP) methodology for creating artifacts\nFacilitated (JAD) Joint Application Development sessions to identify business rules and requirements and then documented them in a format that can be reviewed and understood by both business people and technical people\nResearched on Best Industry Practices and explained the Business Users of the benefits and costs associated in implementing the same \nParticipated in design walk-through with Subject Matter Experts (SME’s) to baseline the business architecture.\nUsed MS Visio to carry out business modeling and created use cases, use case diagrams, and activity diagrams.\nInteracted constantly with the Business Users and Project Manager to keep them current with the latest updates\nInvolved in requirement scoping and analyzing high priority requirements for implementation\nSupported the QA manager in creating various testing scenarios for integration and system testing\nSupported the QA team while conducting Unit and Functional Testing\nAssisted the Business Users at the time of Application testing and User Acceptance Testing \nIdentified process improvement projects and successfully deployed and supported six sigma techniques.\nDeveloped the risk management plan, established controls based on six sigma analysis and managed it.\nDeveloped and maintained collaborative relationships with business process owners to support changes and innovations within the company and the successful deployment of six sigma techniques.\nCoached, mentored and lead cross-functional project teams through the phases of Lean Six Sigma in order to produce transformation results on key initiatives covering quality, productivity, cycle-time and growth.\nDesigned, developed and lead training and support programs at various levels of Lean Six Sigma and supported project selection, scoping, delivery, review and reporting to ensure effective application of six sigma tools and alignment with business vision and strategy.\n\nClient:\tNewpage Paper Corporation, MD\nRole:\tOperational Excellence Manager- Lean Six Sigma                                                      (February’08 – Jan.’11)\nHeadquartered in Miamisburg, Ohio, New Page is a leading producer of printing and specialty papers in North America, with $3.1 billion in net sales. New Page mills have a total annual production capacity of approximately 3.5 million tons of paper. New Page has facilities in Wisconsin, Minnesota, Michigan, Kentucky, Maryland and Maine.\nTheir Luke operation was established in 1888. Today it has one Kraft pulp mill and two paper machines. At this location, the company can produce 480,000 tons per year of coated free sheet and specialty paper.\nProject 1: Improved the quality of all the raw materials used in paper coating Newpage Paper Company by meeting their specifications. \nRoles and Responsibilities\nDefined the project: purpose, scope, and resources in the charter\nDetermined project goals to fit customer needs (Voice of the Customer)\nCollected baseline data on suspected problem\nPlotted the data in time order\nUsed Pareto charts to pinpoint occurrence\nCalculated process sigma & Standardized the Six Sigma System.\nCreated detailed process maps to analyze waste and bottlenecks\nFocused on the problems identified in the \"Measure\" process\nBrainstormed as many potential causes as possible\nSelected a few of the most likely causes and collect data on them\nUsed statistical methods to quantify the effects\nBrainstormed many ideas for improvement\nSelected solutions: select criteria to assess alternative solutions, then evaluate alternatives through testing\nDeveloped plans, including tasks, timeliness, budget, resources, and stakeholders\nPlotted the selected solutions using PDCA cycles\nImplemented plans, including the means by which you will check results\nInterpreted the charts to quantify effects of solutions\nEvaluated overall results against the methods used to achieve them\nDocumented the new methods in order to develop standard work procedures\nProvided training to those who will use new methods\nMonitor implementation and make course corrections\nCreated a process to update and improve the method\nSummarized and communicate key lessons learned to others\nRecommended next project to further increase sigma level\nAssisted the Operations excellence Director to put requisition of raw material purchase both by rail cars and trucks in SAP and used Proficy software. \nMade weekly work schedules for 30 people of the machine coating department.\nUsed SAP system to manage raw material purchase history and record quantities for inventory.\nConducted monthly inventory of raw materials and record it.\nHelped the data warehousing team to develop database on vendors, raw materials, daily scheduling of railcars and trucks with raw materials to keep account of the inventory, etc.\nAssisted the Project Manager in documentation, keeping liaison with the stakeholders, in the day to day operations / duties of the coating department and filled in his position in his absence.\nProject 2: Improved the quality of the raw material properties (Viscosity and solid content %) in all paper grades of New Page Paper Company.\nRoles & Responsibilities:\nStated the problem, specified the customer set, identified the goals, and outlined the target process, and developed Project Charter.\nDecided what parameters needed to be quantified, worked out the best way to measure them, collected the necessary data, and carried out the measurements by experiment.\nIdentified gaps between actual and goal performance, determined causes of those gaps, determined how process inputs affect outputs, and ranked improvement opportunities.\nDevised potential solutions, identified solutions that are easiest to implement, tested hypothetical solutions, and implemented actual improvements.\nGenerated a detailed solution monitoring plan, observed implemented improvements for success, updated plan records on a regular basis, and maintained a workable employee training routine.\n\nProject 3: Helped the management to make decision on the performance of two machines to test paper properties and reduce variability in the process. It also helped them to make decision on purchasing an expensive paper testing machine worth 25,000$ at New Page Paper Company.\nRoles and Responsibilities\nDefined the goals of the project and that of the customers (both internal and external).\nMeasured the customer needs as well as the goals of the management.\nAnalyzed the options, existing process to determine the cause of error origination and evaluate corrective measures.\nAnalyzed a new process or a corrective step to the existing one to eliminate the error origination that meets the target specification.\nVerified the performance of both the designs and its ability to meet the target needs.\n\nProject 4: Helped the quality department to analyze the effects of different process and raw materials changes on paper properties over the years for different grades of papers at New Page Paper Company.\nRoles & Responsibilities:\nQuantified the value of the project to the company.\nDefined issues Operationally, Statistically and practically and developed a Project Charter.\nDevelop the SIPOC (Suppliers-Inputs- Process-Outputs- Customers) map to understand the process\nIdentified Performance Matrices.\nBench-marked Functional, Internal and Competitive Standards.\nMeasured variables with the help of different maps and Models.\nAnalyzed the results using different data analysis methods.\nOptimized the process\nImproved the process for Six Sigma breakthrough.\nControlled the process to hold breakthrough improvements.\nStandardized the Six Sigma System.\nEvolved cultural norms and breakthrough transformation.\n\nClient:\tDell, New York\nRole:\tSix Sigma Black Belt                                                              (March’06 – January’08)\nReduced the number of product returns from different sales regions of a Computer company through the application of six sigma tools in a simulation project and thus saved $1,274,805/ yr.\n\nRoles & Responsibilities\nDeveloped the project charter, Mapped the process\nBe the strong liaison between Product Management and development to ensure a transparent and productive workflow environment\nAssist other team members, scrum development team, and enterprise architecture in developing solution delivery best practices\nWork with teams to continuously improve product ownership and other agile processes. \nUnderstood the voice of the customer to define the problem well.\nCollected baseline data on defects and their possible causes.\nWork with program management to track schedule against the roadmap, and escalate risks and issues. \nPlotted defect data over time and analyzed for specific causes.\nCreated and stratified frequency plots and used Pareto analysis.\nCreated detailed process map.\nDeveloped a focused problem statement.\nExplored potential causes and organized them.\nCollected more specific data and used statistical data methods to quantify cause and effect relationship.\nCreated possible solutions for root cause.\nSelected solutions and developed plans for implementation, measured results and evaluated     benefits.\nControlled the process. Developed and documented standard practices.\nTrained the teams.\nCreated processes for updating procedures and Monitored performances.\nSummarized and communicated learning.\nRecommended future plans.\nTransferred data from various sources like MS Excel, MS Access, and SQL Server using SSIS and then created reports using this data using SSRS. \n\nClient:\tSUNY ESF, New York   \nRole:\tSix Sigma Black belt                           \t           \t\t(November’05 – February’06)\nIncreased profit of $1.9M dollars in a Bioprocess simulation project conducted for the Green Belt Six Sigma Certification.\nThe State University of New York&#39;s College of Environmental Science and Forestry (ESF) at Syracuse. Established in 1911, is a pioneer in teaching the science of pulp and paper manufacture, chemical and Bioprocess engineering.\nESF launched its Paper Engineering curriculum in 1920, making it the oldest such program in the United States.\nToday, ESF&#39;s curriculum comprises one of the finest paper programs in the world. In 2006, ESF launched a new degree program in Bioprocess Engineering, the first and only program of its kind in the northeastern United States.\nSince then, it conducted many researches in Bioprocessing, which has been considered for commercialization. The current project was an effort to establish the Design of Experience (DOE) to find out the best conditions of the commercial reactors that will maximize profits.\nRoles and Responsibilities\nDefined the project and identified the process to develop a charter.\nMeasured the CTQ’s (Critical to Quality) and evaluated the measurements.\nDesigned the Experiment (DOE); estimated the process capabilities.\nAnalyzed the results using different methods.\nImproved process performance by implementing changes.\nEstablished control system to maintain the gains.\n",
    "extracted_skills": [
        "agile",
        "communication",
        "data analysis",
        "leadership",
        "project management",
        "scrum",
        "sql"
    ]
}