{
    "id": "resume_15f8e6e3-7883-47af-8eb6-1c90e7d709cc",
    "metadata": {
        "filename": "Sravani Battu.docx",
        "processed_date": "2025-09-24T08:45:55.082098+00:00"
    },
    "raw_text": "Sravani B \t\t\t\t\t\t\t\t\t\t\t     Full Stack Developer\n\nPROFESSIONAL SUMMARY:\n6 years of experience in all phases of the software development life cycle (SDLC) starting from requirement gathering to software design, development & implementation, delivery, test planning and production support. \nInvolved in implementation of various web based, multi-tier applications using Java/J2EE. \nExperience in Java based technologies, which include Core Java, JSP, JDBC, Restful Web services and frameworks such as Hibernate, Spring-Boot. \nHands on experience in Project Planning, Problem solving, tracking to resolve long-pending issues encountered during projects.\nExperience in designing, developing and implementing Multi-tier, Client/Server, Enterprise and Web applications using Java/J2EE.\nExtensive experience in working with MVC Architecture, Hibernate and Spring Framework.\nExtensive experience with Hibernate ORM tools.\nVery good understanding of web-based technologies such as JSP, JSF, HTML, CSS, PrimeFaces and JavaScript.\nExpertise in developing and implementing web applications using Java and J2EE Technologies includes Core Java, JDBC and JSP.\nExperience in configuring, and troubleshooting JMS, JDBC and HTTP adapters.\nStrong knowledge in Object Oriented Programming concepts.\nExtensive knowledge in Core Java, Collections API and Multithreading.\nExcellent skills in creating and accessing various databases using SQL Queries, NoSQL Couchbase Database, Postgres,\nH2 in-memory Database, PL/SQL on various databases like MySQL, Oracle 10g/11g.\nExtensive experience in programming, deploying, configuring, fine-tuning middle-tier J2EE Application using Apache Tomcat 6.x/7. x.\nHands on experience IDE’s like IntelliJ and Eclipse.\nHighly result oriented and pro-active, proven abilities to learn new technologies quickly and implementing them successfully in production.\nStrong Inter personal communication skills & ability to work independently as well as in a group.\nExperience working on Hadoop, Spring-XD, Kafka, Hive and Spark.\nSKILLS:\n\n\n\n\n\n\n\nPROFESSIONAL EXPERIENCE:\nEquifax, Alpharetta, GA\t\t\t\t\t\t\t\t                                  Jan 2016 – present\nFull Stack Developer\n\nDescription: The project Talon is a platform being developed for Equifax customers to track their consumers against a high-risk list of individuals or entities while on-boarding. It provides a Search/match feature to the customers as a core capability and interacts with a third party Informatica tool to score and categorize an individual or business against a compliance database to perform Due Diligence.\n\nThe project follows a 2-week agile model of implementation based on Scrum. I have contributed for major modules of the core capabilities. The core implementation revolves around Spring Boot, Maven, NoSQL Couchbase Database, Postgres, in-memory H2 and developing User Interface for case management and search-match using Liferay, JSF PrimeFaces, Swagger UI.\n \nResponsibilities:\n\nDeveloped multi-tier J2EE application for the important modules of the project like Screening, Matching, Keying and set up customer and business Configurations using Spring Boot, Maven. \nExperience working on Hadoop, Spring-XD, Kafka, Hive and Spark.\nUsed JPA for database persistence, Postgres PGAdminIII, H2 in-memory database, NoSQL Couchbase database to store and retrieve customer and business hit records. \nProduced and Consumed Restful (JAX-RS) Web Services using Postman Rest Client, Swagger UI, to interact with different applications from Informatica and third-party tools. \nPerformed unit testing using JUnit, test functional behavior and performance using JMeter.\nHave been a responsible Scrum Master for a few sprints.\nInstalling, configuring and maintaining Continuous Integration, Continuous Deployment, Automation and Configuration Management tools.\nExpertise in deploying enterprise applications on WEB /Application servers like Apache Tomcat.\nInteracted with customers to compile Runbooks and other design document. \nCoordinated test plans and build for System testing, UAT, Pilot with QA. \nExperience in Chef Management tool.\nExperience in XML related technologies like XPath.\nInvolved in peer code reviews.\n\nEnvironment: JDK 1.7, Agile Development Process, JSF, Spring 3.0, Web Services, Spring-boot, Hibernate 3.0, JMS, JSP, HTML, CSS, JSF, XML, XPath, LOG4J,XSLT, JavaScript, Junit 3.8, JMeter, GIT, NoSQL Couchbase Database, Postgres, Oracle, H2 in-memory Database, Hadoop, Spring-XD, Apache-Kafka, Zookeeper, Ambari, Liferay, Chef, Jenkins, SonarQube, Cucumber, Intelij-IDE .\n\n\nWells Fargo, Atlanta, GA\t                                                                                      \t                   Jan 2015 – Dec 2015\nApplication Developer\n\nResponsibilities:\n\nGathered system requirements for the application and worked with the business team to review the requirements and went through the Software Requirement Specification document and Architecture document.\nDesigned and developed web-based software using Spring MVC Framework and Spring Core.\nWorked on the JAVA Collections API for handling the data objects between the business layers and the front end.\nUsing Agile methodologies to plan work for every iteration and used continuous integration tool to make the build pass before deploying the code to other environments.\nInvolving in design, development, testing and implementation of the process systems, working on iterative life cycles business requirements, and creating Detail Design Document.\nUsed Spring ORM module to integrate with Hibernate.\nImplemented Hibernate framework to connect to database and mapping of java objects to database tables.\nInvolved in writing the Maven build file to build and deploy the application.\nWorked on GIT version Control Systems.\nDesigned the user interface of the application using HTML5, CSS3, JSF 2.1, JavaScript.\nUsed Log4J to capture the logging information and JUnit to test the application classes.\nDesigned and developed Web Services to provide services to the various clients using Restful.\nPrepared Unit and System Testing Specification documents and performed JUnit and System testing of the application.\nReviewed the code for ensuring adherence to Java coding standards.\nDeveloped Functional Requirement Document based on user’s requirement.\n\nEnvironment: JDK 1.7, Agile Development Process, JSF, Spring Framework, Web Services, Hibernate, JMS, JSP, HTML, CSS, JSF, XML, LOG4J, JavaScript, SQL, Postgres, Junit, GIT, Eclipse-IDE.\n\nSynctra Solutions, India\t\t\t\t\t\t\t\t\t             Jan 2011 - July 2013\nApplication Developer                                                                                                   \n\nResponsibilities:\n\nInvolved in various phases of SDLC such as requirements gathering, modelling, analysis, design of application using SCRUM AGILE methodology.\nDesigned and implemented application using JSP, Spring MVC, Spring IOC, Spring Annotations, Spring AOP, Hibernate, Oracle.\nImplemented Maven build tools to build jar and war files and deployed war files to target servers.\nHave worked on Oracle 10g database for storing and retrieving the application data.\nCreated connections to database using Hibernate Session Factory, using Hibernate APIs to retrieve and store data to the database with Hibernate transaction control.\nWrote multiple SQL queries.\nExperience creating multiple types of joins.\nInvolved in Web Administration like setting up Data Sources, deploying applications.\nUsed Continuous integration tool Jenkins for deploying the project.\nUtilized various JavaScript and jQuery libraries bootstrap, AngularJS for form validation and other interactive features.\nUsed putty to connect to different environments of the application.\nWrote Unit test cases using Junit\nWorked closely in scrum agile environment.\n\nEnvironment: JDK 1.7, Spring Framework, Hibernate, Oracle, SQL, JavaScript, jQuery, Junit., Eclipse IDE, Powershell.\n\nEDUCATION:\nWestern Michigan University, Kalamazoo, MI, USA \t\t\t\t\t             Aug 2013 – May 2015              \nMaster of Science, Electrical and Computer Engineering\n\t\nJawaharlal Nehru Technological University, Hyderabad, India\t\t\t\t             Sep 2008 – May 2012\nBachelor of Technology in Electrical and Electronic Engineering \n",
    "extracted_skills": [
        "agile",
        "communication",
        "css",
        "git",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "mysql",
        "oracle",
        "powershell",
        "problem solving",
        "scrum",
        "spark",
        "sql"
    ]
}