{
    "id": "resume_c4f2a832-9ec6-4acf-8fd3-96f414a54e63",
    "metadata": {
        "filename": "Sudhakar Reddy.docx",
        "processed_date": "2025-09-24T08:45:55.962833+00:00"
    },
    "raw_text": "Sudhakar Reddy P\nJava/J2ee Developer - American Software Resources\nNaperville IL\n \nEmail:  psrleo81@gmail.com              \t\t\t\t\t Mobile: 201-535-3300\n \n\nHaving 9+ years of extensive experience in developing web and Client-Server applications using Java/J2EE technologies. \nStrong in Object Oriented Analysis, design (OOAD) programming (OOPs) core design patterns, J2ee design patterns, SOLID principles, UML Diagrams and best practices. \nGood working experience Spring Boot and Spring Microservices.\nExpertise in JSP, Servlets, spring 4.0 (Boot, Core, Security, AOP, ORM, Transaction Management).\nExpertise in using JPA, Hibernate and Spring data (MySQL)\nSolid experience in 12 Factor Application principles and Netflix OSS (Eureka, Zuul, Feign, Ribbon)\nGood working experience with Apache Storm, Kafka, and Zookeeper.\nGood working experience Writing Unit Test cases to test REST endpoints. \nExperienced in planning and executing all phases of software life cycle development using waterfall and RUP project life cycle methodologies. In addition, training communication and co-ordination with end users in the software process have been the strong area. \nExpertise in developing the multi-tier web applications in both Spring MVC and Struts MVC that ensures clear separation of layers and rapid application development\nGood working experience In-Memory cache frameworks (Hazelcast distributed cache, Redis).\nProficiency in core java concepts like Threads, Exception handling, Generics, Strings etc. \nWorking experience in Webservice (SOAP) and Restful webservice. \nExtensive Working experience with repositories like GIT, VSS, Perforce, Harvest & SVN. Experience in build tool like Maven, Ant.\nExpertise in developing in Spring Security, Spring Batch and Spring Integration.\nHaving the working experience in UML design using Rational Software Architect 7.0 and Rational Rose 7.0. \nStrong Experience of working with RAD, WASD5.0, Spring Tool Suite, JDeveloper, Eclipse, Net Beans.\nStrong working experience in java testing frameworks such as JUnit and Cucumber\nExperience working on UNIX platform and aware of Unix commands. \nGood working experience with code quality management tools like sonarQube, Jacoco.\nExcellent working knowledge of writing XML documents and parsing them using SAX parsers.\nHaving experience to the frameworks like Bootstrap, AngularJS, jQuery, ExtJS and NodeJS.\nPossess application Server experience with Web logic, IBM Web Sphere Application Server., JBoss and Tomcat.\nStrong in analytical and problem solving abilities. Good in Data Structures and Algorithms.\nStrong expertise with Agile, Scrum and TDD methodology \nExperienced in Relational databases such as Oracle versions from 7.x to 10g, DB2-UDB, SQL Server 2000, MySQL, Postgres, MongoDB and LDAP. \nRevelation to the domains such as Health Care, Education, Exports Sales and Content Management. Worked with reputed clients like Medco, Stanford, Deloitte and Open Text Corporation.\nWorking knowledge of continuous integration and continuous deploy mechanism and technologies like Jenkins, Maven etc. \nHaving some exposure with Hybris e-commerce framework, CMS Frameworks like Liferay and Magnolia.\nInvolved in designing MongoDB multi-sharded cluster and monitoring with MMS.\nGood understanding & expertise in web technologies like HTML, DHTML, Java script, AJAX. \nDesign highly available, cost effective and fault tolerant systems using multiple EC2 instances, Auto Scaling, Elastic Load Balance and AMIs.\nUsed middleware tools like JMS MDB's, MULE, TIBCO and configured Connection Factories and Topics/Queues.\nHaving experience in creating Docker images using maven Docker plugin  \nHaving some exposure with Lucene, Apache SOLR search engine\nPossess good experience with Java build tools such as Ant, Maven and Gradle.\nHaving the knowledge in the PEGA tool and finished certified the training in PRPC 6.1.\nGood experience in enabling REST endpoints Security Using OAuth2 in the Mule REST console.\nHaving working knowledge Migrating complex, multi-tier applications on AWS\nHaving the working experience in the Middleware tool Websphere Message Broking and Java Web DynPro. \nQuick learner and excellent team player, ability to meet tight deadlines and work under pressure. Good organizational skills, troubleshooting skills, and personal skills.  \n\n\nEducation:\nBachelor of Technologies (Electrical & Electronics Engineering) from JNTU University, May 2003.\nCertification:\nSun Certified Java Programmer with aggregate of 72%(SCJP java version 1.5)\n\nSoftware Skills:\nOperating System               \t    :  Windows XP/NT/98, Unix, Solaris.\nLanguages                              \t    : Java, J2EE, PEGA, JAVA WebDynPro.\nWeb Languages                  \t    :  Servlets, JSP, JavaScript, HTML.\nRDBMS                               \t    :  SQL Server, ORACLE, DB2\nApp/Web Servers               \t    :  Tomcat 5.0, BEA Web Logic, IBM Web Sphere, JBoss\nFramework                  \t:  Spring, Spring Boot, Spring Microservices, Spring Data Spring AOP, Spring Security and OAuth, JSF, STRUTS,  Hibernate, Spring, EJB, Web services , Spring Boot,   Spring Micro services, Hadoop & SPRING MVC.\nWeb Services\t: JAX-RS (Jersey, Spring REST), SOAP JAX-WS Web Services\nVersion controller         \t:     Microsoft Visual Source Safe 6.0, SVN, Perforce,    Harvest, GIT\nDesign tools\t: Rational rose, AQT, Rational Software Architect\nMiddleware tools\t: WebSphere Message Broking.\nOther Technologies\t: Mule ESB, Jenkins, Bamboo, Apache Storm, Zookeeper, Kafka\nUnit Testing\t: JUNIT & Mockito\nTools\t: Putty, SOAP UI, Post Man, RAC, MoboXtream, Connect, MDHT, IntelliJ Idea, File Zilla, DB Visualizer, swagger, , Sonar Lint, Jenkins, DB Visualizer, SourceTree, GitBash, Ubuntu, JIRA, Websphere message broker.\n\n\nWork Experiance:                                                                                         \nTech Lead Java / J2EE Developer\tAugust-2016 to present\nAzuba - Napersoft -Naperville, IL\n\nProject Description:\t\nAzuba is an independent cloud based health information platform that enables consumers to automate the secure management of their health information at no cost to the consumer. Azuba enables consumers and caregivers with mobile access to the consumer’s health and medical records across healthcare providers (physicians, hospitals, pharmacies, labs, dentists, urgent care, etc.), payers (insurance companies) and Health Information Exchanges (HIEs) while securely sharing that information with other providers, caregivers and family.\n\nResponsibilities:\n\nInvolved in gathering and analyzing the requirements, designing, developing, and testing. \nMavenizing the applications using Spring Boot framework and integrated with code quality tool sonarqube. \nInvolved in two micro services (Patients, Users) development using Netflix OSS and spring boot\nDesign and implemented the backend layer using Hibernate and Spring data. \nImplemented logging using log4j and Spring AOP.\nInvolved in the UML Design, applied OOAD and SOLID Design Principles. \nApplied GOF design pattern on creational design pattern like Singleton, Factory and Abstract Factory, Structural design pattern like Adapter, Decorator, Façade patterns and Behavioural such as Strategy, Command, and Template Patterns respectively. \nImplemented the Restful webservice for various microservices and coding different layers like Business, DAO and Model Layers. \nInvolved in the identification of the Restful API services for the given user stories\nInvolved in the Project Setup process of routing and filtering requests to a micro service application using the Netflix Zuul edge service library.\nDeveloped Zuul API gateway for Authentication using Redis Cache.\nWorked on Java Multithreading, Collections & Coherence Framework.\nInvolved in the integration of the third party Connect Open source and its configuration\nDeveloped Web services to allow communication between applications through SOAP JAX-WS as well as Restful JAX-RS webservices\nMajor contribution to Building Swagger Specifications (API Documentation) for Restful Web Services.\nConfigured and implemented the MDHT code integrated with the application and transforming the CCDA document to the java source code.\nExplored the CONNECT 4.5 open source tool as integration feasibility study to Azuba tools.\nImplemented junit tests and mandated 90% min. code coverage. \nInvolved in implementing the web services and testing with soapUI.\nInvestigate, debug and fixed potential bugs or defects in the implemented code. \nDrove performance-tuning efforts for the systems engineering team.e.g. Performance. \nWorked on migrating complex, multi-tier applications on AWS\nExtensive experience in designing MongoDB multi-sharded cluster and monitoring with MMS.\nDesign highly available, cost effective and fault tolerant systems using multiple EC2 instances, Auto Scaling, Elastic Load Balance and AMIs.\nConfigured a virtual host for Development and Test environments.\nInvolved in the integration of the third party Direct Connect for secured mail transmit\nReview the code and assign the rework to the team with optimized solution. And also create and assign defect to the team.\nInvolved in coordinating with the team members in application development activities.\nUnit Testing, Test plan creation. Defect analysis and fixing. \n\n\nEnvironment:\nJava,  Spring Boot, Spring Microservices, Spring Data, Spring AOP, Hibernate, JPA, Restful Webservice, SOAP Webservice, Zuul, Eureka, Redis, Hazelcast,  MDHT, Connect Open Source, Direct Mail, Soapui, Angular JS, MongoDB, Swagger, Telosys, Junit, MySQL, Maven, Glassfish server, JBoss, Apache Kafka, Elastic Search, ESB Mule, Mule, SOAP UI, Eclipse, SVN, IceScrum.\n\n\nTech Lead  Java / J2EE Developer\t\t\t\tOctober-2015 to August-2016\nChild Support - Deloitte - Pennsylvania Avenue NW , Washington, DC\nProject Description:\nProvides caseworkers with a prioritized list of cases and a concise and fast way to find information about a case. Supervisor are able to better understand their teams and caseworkers performance, while Local Office Directors Four D Directors can find out their States and local Offices relative performance and how it compares with their peers and set goals to improve.\n\nResponsibilities:\n\nGetting the Requirement from the client and Writing SRS/CRS document.\nUsed Spring BOOT to create spring applications. \nImplemented the Restful webservice for various microservices and coding different layers like Business, DAO and Model Layers. \nDesign and implemented the backend layer using Hibernate and Spring data. \nInvolved in the UML Design, applied OOAD and SOLID Design Principles. \nImplemented the modules  spring 4.0 (Boot, Core, Security, AOP, ORM, Transaction Management)\nImplemented the caching mechanism in Hibernate to load data from database.\nMavenizing the applications using spring boot framework and integrated with code quality tool sonarqube. \nImplemented the GOF design pattern on creational design pattern like Singleton, Factory and Abstract Factory, Structural design pattern like Adapter, Decorator, Façade patterns and Behavioural such as Strategy, Command, and Observer Patterns respectively. \nDesign and Development of the Object Oriented applications using OOA and OOD techniques using Rational Rose. \nInvolved in the implementation with Apache Storm, Kafka, and Zookeeper.\nApplied 12 Factor Application principles and Netflix OSS (Eureka, Zuul, Feign, Ribbon)\nDeveloped PL/SQL queries. Actively worked on stored procedures.\nDesigned Use Case Diagrams, Class Diagrams and Sequence Diagrams and Object Diagrams to model the detail design of the application using UML.\nInvolved in designed microservices using Netflix OSS, and ELK Stack.\nSecuring REST endpoints with JWT tokens\nCreating Docker images using maven Docker plugin\nImplemented Java Multithreading to refresh the cache at a given set of time interval.\nExtensive experience in designing MongoDB multi-sharded cluster and monitoring with MMS.\nInvolved in coordinating with the team member from onshore and offshore in application development activities.\nUsed hazelcast cache module to store rest tokens to with time to leave interval to clear the session.\nWorked in implementing on RESTful and SOAP based web services.\nInvolved in the code reviews to verify the coding standards and Java documentation by using customized eclipse plugins like checkStyle and PMD.\nReview the code and assign the rework to the team with optimized solution. And also create and assign defect to the team. \nInvolved in implementing the web services and testing with soapUI.\nDesigning and deploying enterprise-wide scalable operations on AWS\nDeveloped SOAP based web services to provide services for front-end web.\nUI Development using HTML5, CSS3, Bootstrap, JavaScript and jQuery\nProvide the status to the onshore team and of the offshore team on a daily basis.\nMigrating complex, multi-tier applications on AWS\nGenerated WSDL file using Apache CXF and extensively used Soap UI for services testing.\nEffectively handling change requests by proposing and supporting the design, development and testing.\nResponsible for the source code maintenance using version control using SVN system. \nUnit Testing, Test plan creation. Defect analysis and fixing.\n\nEnvironment:\nJava,  Spring MVC, Hibernate, JPA, Restful Webservice, SOAP Webservice, Swagger, Telosys,  MySQL, Maven, Glassfish server, JBoss, ESB Mule, SOAP UI, PMD, CheckStyle, Docker, Eureka, Zuul, Feign, Ribbon , Hazelcast, Redis, ELK Stack, JWT Tokens, Eclipse Juno,MongoDB, SVN, IceScrum.\n\n\n\nSr. Java / J2EE Developer\t\tNovember-2013 to September-2015  \nGlobal Contract Management System - IBM - Madison Avenue, New York\n  \nProject Description:\n\nGlobal Contract Management System is a web application that creates and manages contract documents such as Offer Letters and Certification of Acceptance and follows a work flow for creating and handling customer leasing contracts.\n\nResponsibilities:\n\nGetting the Requirement from the client and Writing SRS/CRS document.\nDeveloped application Spring BOOT and Spring Microservices.\nImplemented the Restful webservice for various microservices and coding different layers like Business, DAO and Model Layers. \nCreated WSDL & Generated data objects using WSDL, Java, Spring, JAX-WS, Axis, apache CXF and developed mapping code for several Web Services interfaces for various profile management endpoints. Design and implemented the backend layer using Hibernate and Spring data. \nInvolved in the UML Design, applied OOAD and SOLID Design Principles. \nImplemented the modules  spring 4.0 (Boot, Core, Security, AOP, ORM, Transaction Management)\nImplemented the caching mechanism in Hibernate to load data from database.\nGood experience in enabling REST endpoints Security Using OAuth2 in the Mule REST console.\nMavenizing the applications using spring boot framework and integrated with code quality tool sonarqube\nDeveloped SPRING framework using IOC, Factory Pattern, JMS and applied Spring MVC and Spring WebFlow. \nDesign and implementation client pages. \nStrong working experience in java testing frameworks such as JUnit and Cucumber\nInvolved in coordinating with the team members in application development activities.\nInvolved in preparing the prototype for the complete application.\nDeveloped database scripts and procedures using PL/SQL.\nReview the code and assign the rework to the team with optimized solution. And also create and assign defect to the team.\nInvolved and have working experience with Apache Storm, Kafka, and Zookeeper.\nJ2EE to communicate legacy COBOL based mainframe implementations.\nInvolved in debugging the product using Eclipse and JIRA Bug Tracking\nDesigned Use Case Diagrams, Class Diagrams and Sequence Diagrams and Object Diagrams to model the detail design of the application using UML.\nProvide the status to the onshore team on a daily basis.\nUsed Maven script for building and deploying the application.\nInvolved in the code reviews to verify the coding standards and Java documentation by using customized eclipse plugins like checkStyle and PMD.\nSystem Integration testing at application developer level.\nExchanged data between front-end and back-end over HTTP Protocol using SOAP and WSDL, and XML data packets format.\nDeveloped Java multi-threaded batch offline bulk upload tool, web applications using Spring, Servlets and UI layer using JSPs, JavaScript, HTML, CSS, Angular JS.\t\nWorked on Rest based Web services for MULE ESB flows. \nCreation of the Queues in the WMB (WebSphere Message Broking tool) and creation of work flows with esql files and deploying in the form of BAR broker archive file. This involves in the creation of message flow by accepting the data format provided and validated accordingly and sent back to the Queue. There are different nodes i.e. out, catch & fault.\nInvolved in development of Unit test cases and testing the application using \nJUnit.\n\nEnvironment:\nJava, Spring, Hibernate, JSF, Restful Webservice, DB2, Websphere 7.0, Restful webservice, SOAP Webservice, Websphere message Broking tool, Rational Software Architect,  Rational Rose, RTC, AQT, DB2.\n\n\n\n\nSr. Java / J2EE Developer\t\t\t\tJuly-2012 to October-2013\nClient Benefit Administrator -Medco - Franklin Lakes, NJ \n\nProject Description:\nClient Benefit Administrator is the application which allows to create the plan Instances using the available plans in CBM application.CBA uses the entities available in the CBM and creates the an instance plan as expected by different clients.CBA has client hierarchy as Client, activity, Business Modules and Instance, it has data hierarchy as client, carrier, contract, group.\n\nResponsibilities:\n\nDeveloped SPRING framework using IOC, Factory Pattern, JMS and applied Spring MVC and Spring WebFlow.\nUnderstanding the requirements from the client.\nInvolved in technical design and development.\nDeveloped business modules with JSP, Servlet, Struts framework, Java, XML/XSL and EJB technologies.\nDesign and Developed using WebService using Apache Axis on JBOSS.\nDeveloped SOAP based web services to provide services for front-end web.\nCreated WSDL & Generated data objects using WSDL, Java, Spring, JAX-WS, Axis, apache CXF and developed mapping code for several Web Services interfaces for various profile management endpoints.\nInvolved in the UML Design and OOAD design patterns.\nEnabling REST endpoints Security Using OAuth2 in the Mule REST console.\nImplemented Java Multithreading to refresh the cache at a given set of time interval.\nDeveloped SPRING framework using IOC, Factory Pattern, JMS and applied Spring MVC and Spring WebFlow.\nExperience working on UNIX platform and aware of Unix commands.\nExchanged data between front-end and back-end over HTTP Protocol using SOAP and WSDL, and XML data packets format.\nUsed middleware tools like JMS MDB's, MULE, TIBCO and configured Connection Factories and Topics/Queues.\nHaving the knowledge in the PEGA tool and finished certified the training in PRPC 6.1.\nInvolved in coordinating with the team members in application development activities.\nPreparation of Functional Document, High Level designs Document, Test cases, Code review documents. \nDeveloped HQL queries for CRUD.\nUsed Maven script for building and deploying the application.\nStore persistent JMS messages or temporarily store messages sent using the store-and-forward feature.\nDesign and implementation client pages using Spring MVC \nDevelopment of Controller business logic, DAO classes implementation. \nAdministration of the application server and performance tuning the application.\nSystem Integration testing at application developer level.\nInvolved in debugging the product using Eclipse and JIRA Bug Tracking\nDocumenting all the deliverables according to standards.\nUnit Testing, Test plan creation. Defect analysis and fixing.\n\n\nEnvironment:\nJava, Spring, Spring MVC, Hibernate, PEGA, DB2, Websphere 6.0, Rational Application Development tool(RAD),Rational Software Architect, Restful Webservice, SOAP,  Rational Rose,Harvest Repository,  Wily server monitoring, Filezilla, Putty, Remedy ticket tool.\n\n\nJava / J2EE Developer\t\t\t\tAugust-2010 to June-2012\nWebViewer  - Open Text Corporation - 7th Avenue, New York\n\n Project Description:   \nWeb Viewer is an application for displaying, navigating, searching attributes, printing documents in Web-based scenarios and for appending comments to these documents. The documents are stored in Livelink ECM – Archive Server or any other supported repository.Business documents need to be captured, and they need to be readily accessible after they have been captured. Livelink ECM – Imaging accommodates both the need to scan documents and the need to view electronic documents. All companies have to cope with business-critical paper-centric processes, such as order management, accounts payable, and contract management. \nResponsibilities:\nInvolved in the UML Design creation of Class Diagrams and Sequence diagrams\nDesign and implementation client pages using JSF \nUsed Hibernate to persist and retrieve data from database. \nInvolved in preparing the prototype for the complete application.\nInvolved in coordinating with the team members in application development activities.\nDesign, develop, architect presentation, business, persistence and control layer components utilizing MVC architecture and using Struts, Spring and Hibernate frameworks. \nDeveloped SPRING framework using IOC, Factory Pattern, JMS and applied Spring MVC and Spring WebFlow.\nDeveloped code for AOP (Aspect Oriented Programming) to put Logging with the help of Log4j, and also worked on implementing profiling aspect in to application to address issues like performance and tracing the application failure.\nWorked on GUI internationalization using JSP and Core Java\nWorked proficiently in core java concepts like Threads, Exception handling, Generics, Strings etc.\nPerformed Validations on UI data using JSF validators and JavaScript.\nUsed Maven script for building and deploying the application.\nExchanged data between front-end and back-end over HTTP Protocol using SOAP and WSDL, and XML data packets format.\nUsed HTML, CSS, JSP, JSTL to develop user interface.\nConfigured a virtual host for Development and Test environments.\nStore persistent JMS messages or temporarily store messages sent using the store-and-forward feature.\nDevelopment of Backing bean business logic. \nIdentify the bottlenecks in the code and work towards to fix the application performance issues.\nInvolved in code review to make sure that better coding standards are followed.\nUnit Testing, Test plan creation. Defect analysis and Bug fixing.\n\n\nEnvironment:\nJava, JSF, Hibernate, Spring, MSSql, Weblogic, Eclipse, Perforce, JConsole, Rational Rose.\n\n\nJava / J2EE Developer\t\t\t\t\tOctober-2008 to August-2010 \nFeedback - Stanford University - Serra Mall, Stanford, CA\n\n\nProject Description:  \n \nDevelop a Web-based database application for authors to create and manage feedback surveys, for students to submit and view evaluation data, and for administrator to manage the process. Provide role-based access to input, search and view data via the Web.  Create downloadable reports and allow ad-hoc reporting based on defined access levels. \n\nResponsibilities:\n\nDesign and implementation client pages using JSF \nContributed for application design and along with the day to day development activity I have also managed the Database as a database administrator.\nDevelopment of Backing bean business logic. \nDeveloped business modules with JSP, Servlet, Struts framework, Java, XML/XSL and EJB technologies.\nPerformed Validations on UI data using JSF validators and JavaScript.\nInvolved in debugging the product using Eclipse and JIRA Bug Tracking\nWorked on GUI internationalization using JSP and Core Java\nDeveloped HQL queries for CRUD.\nInvolved in preparing the prototype for the complete application.\nDevelopment of Backing bean business logic. \nExtensively used EJB and various J2EE (JSP/EJB/JMS) component for the implementation of the modules.\nIdentify the bottlenecks in the code and work towards to fix the application performance issues.\nUnit Testing, Test plan creation. Defect analysis and Bug fixing.\n\nEnvironment:\nHibernate, Spring, JSF, EJB Tomcat Server, SQL Server,\n MyEclipse4.0, SVN. \n \n  \n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "communication",
        "css",
        "docker",
        "ec2",
        "git",
        "hadoop",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mongodb",
        "mysql",
        "oracle",
        "problem solving",
        "redis",
        "scrum",
        "sql"
    ]
}