{
    "id": "resume_6d630274-e040-4f8a-bf49-b430d42f843a",
    "metadata": {
        "filename": "Tanmay_Dam_Resume_BA.docx",
        "processed_date": "2025-09-24T08:45:56.624626+00:00"
    },
    "raw_text": "An accomplished and result driven professional with more than 10 years of experience in areas of Business Analysis, Project Management, Testing and Production Support  having excellent organizational, interpersonal & communication skills.\n______________________________________________________________________________________________________\nTANMAY DAM\n500 W Rand Rd,                                                                                                                 Mobile: +1 602-350-9460\nApt#A302,                                                                                                                          Email: tanmaydam.14@gmail.com\nArlington Heights,\nIllinois-60004\n______________________________________________________________________________________________________\n    \nObjective   \n\nLooking for a Business Analyst/Consultant position that will effectively utilize my acquired expertise, creative talent and commitment to excellence. Desire a position with career growth potential.\n\nKey Strengths\n\nMulti-faceted individual with expertise in delivering integration solutions as well as IT business growth & sustenance with acumen and strategic decision making.\nTechnology Specialist on various Microsoft technologies such as BizTalk, SQL and IBM certified MQ System Admin.\nCertified and well versed working with Waterfall, Agile scrum methodology and ITIL standards.\nPossess excellent Communications skills to carry out both one-on-one and focus group interviews with SME’s and different business unit teams on eliciting detailed requirements.\nExperience in conducting and gathering requirements through Joint Application Development (JAD) sessions.\nAbility to analyze and document the business requirements in the form of Business Requirement Document (BRD), Functional Requirement Document (FRD) / Functional Specification Document (FSD), Requirement Traceability Matrix (RTM), Request for Proposal (RFP).\nWorked on major methods of customer data collection and linked how this data can inform business decisions. Worked on descriptive Analytics for operations, learning how to use historical demand data to build forecasts for future demand.\nReceived Incident tickets and requests from end-users, analyzed them and either responded to the end user with a solution or escalated it to the other IT teams.\nExtensive experience in developing Use Cases, creating Screen Mockups .Hands on experience in reviewing Test procedure, test cases, test scripts, and conducting User Acceptance Testing (UAT), Quality Assurance (QA) and sanity testing.\nExpert for assigned functional applications, support development of business impact analysis categories and perform ongoing IT maintenance. Also worked as an interface with multiple applications to ensure End-to-End management in accordance with the needs of project sponsors and stakeholders. \n\nCertifications\n\n\nProfessional Background\n\nSyntel Inc.\nBusiness System Analyst-US (Banking and Insurance)                                                            Feb 2015 - Present                                                                                                     \n\nBusiness/Information Analyst – Allstate                                                                                     \n\nClaims project which deals with data storage and management to effectively extract reports and manage the claims system.\nWorked with a 5 member team across 2 locations.\n\nInformation Analysis & Reporting:\n\nPlayed a key role in construction of a large data warehouse, consolidating multiple reports and improving information flow. Company needed consistent way to generate reports and control the flow of information.\nCollected business requirements from all areas of responsibility. Historical data was stored with capability of extraction.\nAnalyzed large amount of data extracted from the ETL process and created custom reports as per the business requirements.\nCreated scripts to optimize and rationalize data as part of a project which resulted in improved reporting and decision making for business.\nCreated functional and technical documents for a project which needed data extraction from multiple sources and then consolidation of data as per the defined criteria. The delivery led to maximize the customer information and improve the operations capabilities.\n\nLead Business System Analyst - American Express (AMEX)                                               \nStrategic Market Capabilities (SMC) project which deals with the Mass Migration of AMEX credit card products.\nThe technology team enabled card portfolio conversions and guided the Time to Market strategy, boost card sales. \nWorked with a 8 member team across 3 locations.\n\nBusiness Analysis:\n\nAs an integral part of Cards & Payments division, lead a critical work-stream which involved migrating more than 2 million accounts ensuring American express is in compliance with regulatory and contractual obligations.\nBased on the spend-analysis, predictive modeling and marketing strategies segmented the target volume to analyze top 25% customers of product portfolio to suit the value-proposition for new card products.\nConceptualized and provided support for automating a significant business process which was a manual, time-consuming process and migrating it to a cloud-based intuitive web application thereby reducing substantial efforts and savings.\nCreated Program charter, Business Case, Requirement and stakeholder docs for projects and worked with senior leadership and stakeholders for approvals.\nProvided strategic business solutions to technology initiatives and worked as a liaison between client and technical organization by planning, conducting and directing the analysis of business problems.\n\nProject Management:\n\nDeveloped project plans, schedule and work breakdown structure for projects.\nWell versed on SDLC with Waterfall and Agile methodologies.\nCommunicated project status, progress on deliverables, and risks/issues to stakeholders and leadership in a timely manner. Successfully lead all phases of diverse technology projects.\nBusiness strategist; planned and managed multimillion-dollar projects aligning business goals with technology solutions to drive process improvements, competitive advantage and bottom-line gains.\nExcelled at liaising between business and technical areas to achieve on-time, on-budget and on-spec project completions. Created reports for senior leadership regarding status of the project.\n\n\n\n\nScrum Master:\n\nImplemented Custom Kanban board that resulted in reduction of Cycle time by 20% thus increasing team's throughput in less than 8 weeks.\nEnabled improvement in team delivery commitments and capacity planning for sprints by identifying & tracking tasks that increased customer satisfaction.\nFacilitated Release Planning, Sprint Planning, Backlog Grooming, and Retrospective meetings\nRemoved team impediments on a daily basis to allow the team to deliver the sprint goals and deliverables.\nFacilitated Daily Scrum Meetings and Monthly Reviews meetings. Conducted sprint retrospective and followed up on action items for continuous improvement.\n\nDelivery Management:\n\nCreated Implementation Plans and performed walkthrough’s with multiple application teams.\nManaged data from multiple systems to create management reporting and trend analysis.\nStreamlined existing processes and recommended process improvements.\nPrepared and maintained detailed project plans, status reports, and issues logs. Managed multiple teams & stakeholders for end to end project execution.\nTracked and documented execution matrix. Solved critical issues in a time-sensitive environment.\nExecuted and monitored multiple successful executions, co-coordinating with teams across various applications.\n\n\nInfosys Limited \nTechnology Analyst-US (Financial Services & Insurance)                                                    July 2007 – Feb 2015\n\nTechnology/Business Analyst - American Express (AMEX)                                                   \n\nBanking operations project which deals with the Global Credit Card Issuance (GCI) Management. \nWorked with a 12 member team across 3 locations.\n\nBusiness Analysis:\n\nPlanned the project enhancements, reviewed the project implementation plans. Prepared knowledge management documents to improve process, functional aspects of the project.\nDefined project scope, charter, goals and deliverables in support of business goals and worked with senior leadership and stakeholders for approvals.\nProvided technical/functional assistance in identifying, evaluating and developing systems and procedures.\nEnsured that the processes, procedures, and products used to produce and sustain the software conform to all requirements and standards specified.\nPartnered with developers to automate manual processes, saving time and money while decreasing errors. \nIdentified the business needs, Business Processes & Interface Specifications and then documented them.\nDrove regular meetings with client leadership, business partners to provide projects status updates and current issues.\n\nProblem & Incident Management\n\nResolved the problems in Card Issuance applications in a systematic way by following American Express set processes and procedures.\nIdentified and recorded the problem with all relevant data. Classified the problems based on the criticality of the impacted business process. Resolved the problem and provided the root cause analysis report.\nProvided problem management reports like PMR (Problem Management Record), Aging etc. to Technology Leadership.\nBrought disrupted business services back as quickly as possible and identified the underlying problem that is causing the incident.\nPerformed root cause analysis of the incident and put permanent fix to it and report to the assigned Incident Manager for closure of the incident.\n\n\nChange Request Implementation:\n\nUsed standardized methods and procedures for efficient and prompt handling of all change requests.\nCreated Change Management Records (CMR)/Request for Change (RFC) for any change that needed to be installed in production.\nPrepared detailed installation and fall-back instructions for the changes for smooth execution.\nApproved/Closed change records that have impacts to application components.\n\n\n Senior Software Engineer – Union Bank of Switzerland (UBS)                                             \n\nBanking operations project which deals with various modules of Message broker, Cash Management, Payment transfers and Test Data creation. \nWorked with a 5 member team across 2 locations.\n\nHandled 2 applications within the Cash Management & Payments space.\nResponsible for creating SWIFT inbound and outbound messages through Access db.\nUse of SWIFT handbook for Message formats.\nTesting, Compliance filtering, tracking the message flows and resolving issues if any. \nCoordinated and responded to complex business requests, completing the deliverables on-time with client appreciation.\nProvided support activities related to message flows.  \nHandled tickets and issues using the Remedy System.\n\nAchievements\n\nInfosys SPOT Award for outstanding performance in Project Implementation.\nSyntel Client Appreciation Award on behalf of American Express for the dedication, professionalism and ability to exceed customer expectations on the assigned projects.\nSyntel SPOT Award appreciation for the dedication, enthusiasm and ability to exceed expectations which has always delighted the customer and leadership.\nSyntel Champion Award for Achiever of a special award for onsite employees for contribution in organization level initiatives, participation in cross functional projects, sharing innovative ideas, improvising customer experience with continuous display of Syntel AGILE Values.\n\nIT Expertise\n\n\n\nEducation\n\nBachelors in Information Technology from Mumbai University, India\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "leadership",
        "project management",
        "scrum",
        "sql",
        "swift"
    ]
}