{
    "id": "resume_1d93f28d-5e73-4b9a-a4ad-ddb41d5807cb",
    "metadata": {
        "filename": "Tarun RESUME-BSAT.docx",
        "processed_date": "2025-09-24T08:45:56.743208+00:00"
    },
    "raw_text": "Tarun\t\t\t\t\t\t   \nSr. Business System Analyst\n                                         \nPROFESSIONAL EXPERTISE\nExtensive experience of over 8 years working in the IT industry as business analyst and business system analyst, specializing in Banking, Financial Services and Investment sectors.\nA thorough understanding of the various SDLC methodologies and hands on experience working in Waterfall, Waterfall/Scrum/Kanban Hybrid and Agile-Scrum Framework with an in-depth knowledge of other industry standard SDLC methodologies such as Scrum, Kanban and SAFe 4.0. \nPossess core leadership skills including communication, decision making, problem solving, empirical analysis, critical thinking, documentation, visual modeling, facilitation, elicitation, stakeholder analysis, issue management, conflict resolution, team building, and resource management.\nAdept at coordinating with Stakeholders, Subject Matter Experts (SMEs) and End Users to understand, analyze and gain consensus of requirements through a techniques such Prototyping, Brainstorming, Interviews, Focus Groups, Joint Application Design (JAD), Joint Application Review (JAR) sessions.\nExperience in preparing Project Deliverables such as Project Charter, Work Breakdown Structure, Business Case, Business Requirement Document (BRD), Functional Specifications Document (FSD).\nProficient in Requirement Traceability Matrix (RTM), Data Mapping Document, RACI Matrix, Test Plans, Test Scenarios, Test Cases, Test Procedures and Test Reports.\nDeft in prototyping wireframes, mock-ups and illustrating diagrams i.e. UML Use Case diagrams, Activity diagrams, Sequence diagrams, business process flowcharts and Data Modeling diagrams such as Conceptual, Logical, Physical, and Entity Relationship diagrams.\nExpertise in performing GAP Analysis, SWOT Analysis, Cost Benefit Analysis, Risk Analysis, Feasibility Study, Fishbone Analysis, Tree Hypothesis, Benchmarking and Root-Cause Analysis \nAdept at creating User Stories and slicing Epics into Features and using Horizontal and Vertical slices based on business value and mentored best practices of TDD, BDD and ATDD. \nProficient in the writing user stories according to INVEST criteria and sub tasks by following SMART criterion, Acceptance criteria, Definition of Done , and Definition of Ready in Scrum \nFacilitated Sprint ceremonies for each sprint in Scrum Methodology as the Scrum Master and maintained Scrum artifacts such as impediments list, sprint burn-down, sprint burn-up charts.\nExperienced in Estimation techniques such as Planning poker, Bucket system, Relative Mass Valuation, T-shirt sizing; and Retrospective techniques such as Sail Boat, Star Fish, Glad Sad Mad \nAdept in writing and executing CRUD operations and complex SQL queries including complex joins, unions, grouping, aggregation, nested sub queries, triggers & stored procedures\nKnowledge of Data Warehouse architectures - Hub and spoke, federated, independent, centralized, along with ETL process, Star/Snowflake Schema, Facts, Dimensions, OLAP, MOLAP,  HOLAP\nAdept in analytics & reporting tools like Power BI, Tableau, and IBM Cognos for OLAP\nIn-depth knowledge of Hadoop Ecosystem including HDFS, YARN and libraries such as Hive, Pig, Spark, Impala, Sqoop, Flume, Storm, Oozie, Ambari, Mahout, and Kafka. \nIn-depth knowledge of SOA architecture , web services, APIs - SOAP, REST, XML, and JSON.\nExperienced in supervising Black-box Testing, System Testing and User Acceptance Testing (UAT).\nKnowledge of various regulatory acts such as PCIDSS, PCISSC, PA-DSS, Bank Secrecy Act, Dodd Frank wall Street Reform and Consumer Act, Sarbanes Oxley Act, Basel I,II,III FINCEN, OFAC.\nKnowledge of Credit card Transaction Life Cycle, Card Member Management Life Cycle, Credit Card Dispute Resolution Process, Anti Money Laundering process and various AML modules such as KYC, SAR, and CTR.\n\n\nCERTIFICATIONS \nScrum Master Accredited Certification (SMAC) Authorized Certification Id: 33547688508871\nGoogle Analytics Certified Professional Reference ID: 8769046847\nCertified lean Six Sigma White Belt- Management and Strategy Institute\nTECHNICAL SKILLS\n\nWORK EXPERIENCE\nSr. Business System Analyst\t                                                                        July 2016 – January 2018\nMaster Card, O’ Fallon, MO\n Centralized Credit Card Disputes Management System \nThe project was to re-engineer company’s credit card disputes management system. It involved the design and development of performance analysis of dispute resolution including integration of cross functional platforms. The project also involved enhancement of the application for correspondence delivery.\nRESPONSIBILITIES:\nElicited requirements from stakeholders and end clients applying Interviews and JAD techniques to gather functional and non functional requirements and reach consensus.\nAssisted Project Manager in overall scheduling, budgeting and creating Work Breakdown Structure\nInvolved in Business Process Reengineering (BPR) by conducting Process modeling, SWOT analysis, Document analysis, and GAP analysis to analyze As-Is business process and the To-Be system. \nCaptured the high-level requirements in Accompa requirements management tool and integrated the same with Atlassian’s Confluence and JIRA to trace epics and user stories to high level requirements\nAssisted Product Owner and tech lead in defining Acceptance Criteria, DOD and DOR\nAssisted UI/UX teams in creating wireframes, mock-up screens and created use case diagrams, use case documentation, sequence diagrams, data flow diagrams and Activity diagrams for To-Be system, and Reporting UIs using Balsamiq, MS Visio\nConducted business analysis workshops with the disputes management team to create a current state process model in MS VISIO depicting the process inefficiencies\nLead business requirement meetings to create the future state process model in MS VISIO\nCreated dispute resolution process workflow diagrams using BPMN 2.0 in MS Visio\nGathered API requirements to integrate MCCGUI, Alta’s documentation and translation console, GCM, Wisdom, Genesis with enterprise Global Disputes Management enterprise platform. \nWorked with the Development team to integrate Alta’s REST API. MCCGUI’s Rest API and Genesis’s Rest API with the Global Disputes Manager and assisted in API Documentation\nExecuted CRUD operations and other SQL queries such as joins, nested queries and functions\nAssisted testing team in testing REST and SOAP web services in HPUFT\nCollaborated with SME’s, Compliance and Risk Experts to ensure exception handling, risk mitigation and compliances were implemented, documented and satisfied implementing marketing strategies \nCollaborated with GCM Admins and Opsnet team to manage card holders’ and merchant’s claims\nAssisted UI/UX team in the design and development of new user experience & user interface specifications\nInvolved in writing test cases & test plans to test the vertical slice of functionality being delivered\nAssisted the tester in understanding various test scenarios, test scripts and underlying test steps to be followed in order to test the functionality end-to-end.\nEffectively utilized HP ALM, HP QC to manage test plans, test scenarios, test scripts and test execution.\nSupported and maintained Requirement Traceability Matrix (RTM) for requirement analysis and design\nPartnered with QA team to ensure appropriate test coverage at various release levels\nTested the whole systems and workflows of settlements in Issuer, Acquirer and merchant prospective\nPerformed Blackbox, UAT, A/B testing, and wrote test cases in Gherkin’s format on Cucumber \nGenerated Reports and KPI through analytics for management to inspect, adapt and measure ROI\nCoached teams to write effective user stories using INVEST criteria, and tasks using SMART criteria, defined Acceptance criterions, and Definition of Done. Used various Estimation, Planning and Retrospective techniques such as Agile Poker and Star Fish, ORID, and Mad Sad Glad.\nPrepared and delivered effective communications regarding progress and status for both internal and external stakeholders \nParticipated in Scrum ceremonies like Sprint Planning, Daily standups, Sprint Reviews, retrospectives and Backlog Grooming sessions \nAssisted Product owner and development team in prioritizing, slicing, and estimating the user stories\nCoached scrum team to be self-organizing, transparent, cross-functional and accountable \nParticipated in various scrum ceremonies and workshops of other team to improve the learning of my team and organized multiple team building activities to improve the team’s collaboration & productivity \nEncouraged teams to participate in other code reviews and involve in collective learning process\nProactively assisted scum master in identifying and removing blockers and impediments while identifying dependencies and mitigating risks and issues in sprints\nDocumented all workshops, retrospective and other ceremonies notes in Confluence for transparency\nIntensive knowledge of Credit card Transaction Lifecycle, Card holder management Lifecycle and Credit card dispute resolution process and Understanding of PCISSC, PCIDSS and PA-DSS.\n\nENVIRONMENT: Agile Transformation- Accompa, Confluence, JIRA (v-6.6.3), Cucumber(v-2.3.0), MS Visio(v-15.0), MS PowerPoint, MS Excel, Balsamiq (v-3.4), OPSnet, MCCGUI, GCM, Wisdom, Aspect, HPQC, Gherkin, Rest API, JSON, SOAPUI, Oracle DB, PL/SQL\n\n\nBusiness System Analyst                                                                                             January 2015 – June 2016          \nBank of America, Pennington, NJ\nProject 1: AML Case Management\nThe project was to enhance and re-platform our bank’s Anti Money Laundering case manager. The new system fully integrates modules like Know Your Customer (KYC), Suspicious Activity Report (SAR), sanction screening and Currency transaction reporting (CTR). The new case manager made it easier for financial analysts to work on each case and file the reports to various compliance institutions.\nRESPONSIBILITIES:\nKnowledge of the Dodd-Frank Act, the Bank Secrecy Act, Financial Crimes Enforcement Network (FinCEN), Office of Foreign Asset Controls (OFAC) regulations, and Sarbanes-Oxley Act.\nAssisted in identifying documents needed to develop Suspicious Activity Reports (SAR) as required by Bank Secrecy Act and FINCEN for generating reports and red flags to report fraud, money laundering, patterns and inconsistencies activities.\nIntegrated third party services for enhanced due diligence (EDD) on our on-boarding customers, companies and ID documentations using REST API.\nAssisted data analyst in data mapping for Enhanced Due Diligence and Further Due Diligence. \nIntegrated Red Hat open source Business Process Management (BPM) Suit that combines Business Process Management as well as Business Rule Management.\nDeployed Horton works data platform (HDP) to migrate to Hadoop ecosystem and integrated Kafka with Storm and HBase for real time analytics on streaming data.\nIdentified various data sources that have to be stored in the Hadoop Distributed File System (HDFS). Used Sqoop to transfer data between HDFS and structured data sources and Flume to load streaming data.\nUsed SQL queries to retrieve data such as Select queries nested queries, Joins, Unions etc.\nUsed JIRA for issue tracking, user story management and requirement traceability.\nInvolved in testing activities such as test plans, test scenarios, test cases and test scripts.\nAssisted with User Acceptance Testing, developing and maintaining quality procedures, and ensured that appropriate documentation is in place. \n\nProject 2: RapidPAY \nThe project involved enhancing the payment gateway by using a technology-driven approach with upgraded security measures for online banking. The key features included in this project were the secured authorization processing and enhancement of automatic bill pay options. I was also engaged in creating interfaces for Bank of America involving FOREX Module.\nRESPONSIBILITIES:\nOrganized and Conducted the JAD sessions for requirement elicitation.\nElicited demands from the stakeholders and analyzed them for consistency, completeness and flexibility.\nInteracted with SME’s, asking detailed questions and carefully recording the requirements in a format that can be understood and reviewed by both technical and business people.\nCommunicated effectively across company contacts and clients including the regulatory and compliance authority, internal team about the project requirements, schedules and launches.\nCreated user stories and defined acceptance criteria as conditions to satisfy the user story.\nAssisted the project manager to construct a project plan that included Project Schedules, Milestones tracking, and Meeting minutes using Jira.\nDeveloped use case documentation and business process modeling and flows using MS Visio.\nCreated Wireframes and mock ups using Balsamiq and MS Visio, to effectively communicate the user-interface platforms to the system development teams.\nResponsible for identifying and documenting business rules and creating detailed diagrams including Happy and unhappy flows and Data flow diagrams.\nAssisted QA team in performing different levels of testing including SIT, UAT, and regression testing.\nInvolved in implementation by assisting in the preparation of training module. Helped the end users getting accustomed to the system by live demonstrations and system tutorials.\nEnvironment: Agile – Jira (6.0), HPALM, HPUFT (11.5) UML, MS Excel (2013), Oracle (11g), MS Visio (15.0), Red Hat JBoss BPM, Horton Works Data platform Balsamiq2.2, Apache Sqoop, Flume, Kafka, Storm, HBase, HDFS, Hive, Atlas\n\nBusiness Analyst\t\t                                                                              November 2013 – January 2015\nState of Wisconsin, Madison, WI\nThe project was undertaken with the aim of creating an Enterprise Data Warehouse system to provide budget allocation, expenditure tracking and enhanced financial reporting by integrating different data sources to State Data Center. The Legacy system had non-integrated databases which were core to business processing. The new integrated system would provide ease of access, analysis, transparency and enhanced reporting capabilities.\nRESPONSIBILITIES:\nElicited database and reporting requirements by facilitating JAD sessions, conducting Interviews, and brainstorming with the business owners, stakeholders and data warehouse team.  \nCreated artifacts like Business Requirement Document (BRD) and Functional Requirements Document (FRD) to document the requirements and Data Mapping document and stored them in Sharepoint\nInvolved in the process of creating data flow, E-R, conceptual and Logical Model diagrams.\nPerformed Risk Analysis and created Work Breakdown Structure along with Project Manager.\nConducted data profiling after identifying the source data source using Informatica IDQ\nAssisted database developers in normalization and transformation of data and data types, by creating Star Schema dimension modeling, enabling source to target column name and data mapping \nHelped Data Analysts in developing rapidly changing and conformed dimensions and fact tables \nUsed Informatica Power Center in identifying business rules, and defining passive and active transformations like constant, look-up, data type conversion and data transformation\nWorked along with ETL developers using Informatica Workflow Manager, by assisting them in Extraction, Transformation, and Loading operations while documenting and monitoring ETL logs\nAssisted testing team and was responsible for creating and monitoring Requirements Traceability Matrix, test cases, test plans, defining User Acceptance criteria and tracking defects.\nAssisted in developing OLAP cubes and Performed Rollup, Drill down, Slice and Dice operations\nResponsible for creating dashboards and customized visualizations to present the reports as per business requirements that helped in strategic decisions and validated reports using Power BI\nENVIRONMENT: Waterfall, MS Office (MS Word, MS Excel, MS PowerPoint), Tableau, Informatica, MS Visio, MS Project, HP ALM, Wireframes, Mock-Up Screens, SQLServer, SharePoint, UML\n\nBusiness Analyst                                                                                            April 2012 – October 2013\nBANK OF INDIA, Mumbai, India\t\nBOI SECURE OTP\nThe project dealt with the credit card transaction authorization based on mobile number and origin of the transaction. The system would be able to verify the registered number and location with the transaction details and would send one time password to approve it accordingly.\nRESPONSIBILITIES:\nInvolved in Pre-Analysis of project with SME (Subject Matter Experts) and Developers\nConducted Gap analysis to analyze the ‘as-is’ environment and to derive the To-be environment of the process to identify and validate requirements.\nFacilitated JAD sessions with SME’s and multiple teams for requirement gathering and refinement.\nAnalyzed the gathered requirement and created requirement documents such as BRD and FSD.\nCreated Software Requirement Specification (SRS) document to describe all data, functional and behavioral requirement of the system. \nUsed Microsoft Share point for centralized content management and document management.\nWrote Use Case and built Use Case Diagram/ Activity Diagram using MS Visio.\nCreated Requirement Traceability matrix (RTM) using HP QC tool.\nUsed JIRA for allotting task and issue tracking, user story management and requirement traceability.\nWorked with QA team to design Test Plan and Test Cases, Test Scripts for UAT and regression testing.\nENVIRONMENT: JIRA (4.4), MS Visio (v14.0), SQL, HPQC, MS Word (2010), MS PowerPoint (2010), SharePoint (2010), UML\n\nJr. Business Analyst                                                                                              December 2010 – March 2012\nHDFC BANK, Mumbai, India                     \nPayZapp\nThe scope of the project was to develop the core banking application for HDFC Bank India operations. Due to the myriad of advantages that comes along with core banking, the integration of various IT capabilities was critical to the success of this project. Core banking functions such as deposit accounts, loans, mortgages, and payments were implemented as part of this project. \nRESPONSIBILITIES:\nGathered requirements from key stakeholders and SME’s to define the scope and requirements of the online banking system.\nWorked closely with Project Manager for any change request and helped to do Impact Analysis.\nDefined the context of the system by creating various Use Cases for the development system requirements specifications encompassing Functional and Non-Functional requirements.\nDeveloped plans for verification and validation of requirements at all levels so that developed software successfully satisfies user expectations and business needs.\nWorked closely with the development team to verify that business needs are fulfilled and deliverables are produced within a specified budget, quality and time.\nCreated Requirements Traceability Matrix (RTM) using HPQC tool.\nDeveloped UML Diagrams (normal flows/alternative flows) for modeling dynamic aspects of Online Banking System.\nDeveloped data maps for retrieval of information from existing account systems and outlined security measures for accessibility and transmission of information.\nCreated ad-hoc reports using MS-Excel and Pivot tables to do the calculations. \nWorked with the QA team to design Test Plan and Test Cases for the User Acceptance Testing (UAT).\nENVIRONMENT: Waterfall MS Project (2010), HTML, MS Visio (v12.0), MS Office (2010), XML, UML, HPQC\n\nJr. SQL Developer                                                                                                August 2009 –November 2010\nZomato, Gurgaon, India                                                                                                  \nZomato is an Indian restaurant search and discovery service.  It provides information and reviews about restaurants, including menu images for the restaurants that did not have their own website. \nRESPONSIBILITIES: \nCreated and maintained a database of restaurants.\nCreated Tables with Attributes and Constraints and inserted Data into tables.\nConverted integrity constraints - primary and foreign keys, unique and check constraints\nCreated Stored Procedures to make it easier for Supervisors to view data.\nCreated Triggers to make sure no duplicate records exist in database.\nENVIRONMENT:  Waterfall MS SQL Server (v10.0), MS Office Suite (2007), SQL Server Reporting Services (2005)\n\nEDUCATION:  Bachelor of Science, Indira Gandhi National Open University, New Delhi, India\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "confluence",
        "critical thinking",
        "hadoop",
        "html",
        "jira",
        "leadership",
        "oracle",
        "power bi",
        "problem solving",
        "r",
        "rest api",
        "scrum",
        "spark",
        "sql",
        "tableau"
    ]
}