{
    "id": "resume_ac6bd6e3-cceb-423f-b7a5-b25699a76a3a",
    "metadata": {
        "filename": "TeresaNeetipudi IT BA.DOCX",
        "processed_date": "2025-09-24T08:45:57.309786+00:00"
    },
    "raw_text": "TERESA NEETIPUDI\nteresaneet.ba@gmail.com\n(773) 494 1379\nPROFESSIONAL SUMMARY\nAbout 8 years of experience as a Business Systems Analyst with successful delivery of multiple projects with a detailed and thorough understanding of Healthcare, Banking, Insurance, and Communications sectors. \nExtensive experience in gathering and defining the Business Requirements (BRD); translating them into functional requirements (FRS) by using various Elicitation methods and techniques.\nThorough understanding of Software Development Life Cycle (SDLC) and Software Development Methodology (SDM) process methodologies like AGILE,RUP, UML, SCRUM, feasibility analysis, gap analysis, scope and impact analysis of the software systems throughout the different phases of SDLC.\nExperience in conducting JAD sessions, project meetings, reviews, walk through and customer interviews.\nExpertise in Document Management, File Management; Process/Information integration by using MS SharePoint and Project Repositories.\nExpertise in developing Workflows, Process flows and Data flow diagrams.\nDeveloped Use Case Diagrams, Class Diagrams, Sequence Diagrams,Activity diagrams using UML to make users and developers understand the system.\nExtensively worked on defining Testing Methodology, Test Plans, Test Scripts, Test Strategy, SIT, UAT and Post Production Validations.\nMaintaining the Requirements Traceability Matrix (RTM) across deliverables of a project.\nExperience in conducting data testing within ETL (Extracting, Transforming, Loading) process testing cycle.\nInvolved in revising existing systems and procedures to correct deficiencies and maintain more effective data handling, conversion, scheduling, multitasking of functions, tasks input/output requirements and storage.\nExcellent knowledge, understanding and hands on experience working in various domains like Health Insurance, Auto Insurance, Property and Casualty, Banking and Financial, Communications etc.\nExcellent Communication Skills, Interpersonal Skills and Team Leadership qualities and outstanding Organizer with solid planning and problem solving skills.\nHands on implementing projects from idea to implementation and creating training manuals and user guides.\n\nSKILLS\nBusiness Analysis: SDLC Methodologies (Agile; Water Fall; RUP) and framework; Documentation of BRD (BARR), FRD, RTM, Gap Analysis, Data Analysis, Impact Analysis, Visio / Process Flow Diagrams, RAID Log, Project Plans, Road Maps, Project Assessments.\nUAT Testing: Preparing Test Plan, Test Scripts, Test Execution Dashboards, & etc.\nTools and Technology - \t\n\n\nPROFESSIONAL EXPERIENCE\n\nCharter Spectrum (Communications), St Louis MO                                              Feb 2015 – Till date\nBusiness Analyst/ Project Coordinator\n\nDefines and documents customer business functions and processes. Consults with functional unit management and personnel to identify, define and document business needs and objectives, current operational procedures, problems, input and output requirements, and levels of systems access. \nActs as a liaison between departmental end-users, technical analysts, and information technology analysts, consultants in the analysis, design, configuration, testing and maintenance of case management systems to ensure optimal operational performance. \nParticipate in design reviews to ensure adherence to the organization’s standards, and requirements traceability matrix maintenance. \nParticipated in the Requirements gathering sessions; Rewrote the existing requirements as a result of identified backlog issues/glitches which came in via Service Management.\nConverted these rewritten Business Requirements into functional and technical requirements and created the Functional Specifications, and managed the entire functional requirements life cycle using AGILE.\nExperience with the Project Management Tool, JIRA to develop Epics ad User Stories from the functional requirements.\nCreate application test data as needed to validate assigned requirements in support of API realization testing activities, where applicable.\nProvides support during the SIT, end-to-end, and user acceptance testing for software inconsistencies between the deliverable and the design specifications.\nManages data and prepares Executive Summary dashboards and Power Point and PDF files for the status updates of the projects. \nWorking with the higher leadership on mock up, development, and implementation of requested reporting needs, and also involved in publishing and maintaining management dashboards.\nWorking with the QAs on the test execution, smoke tests post the deployments.\nWorking with the Test Data Management team on the data required for test execution.\nCoordinating with the offshore teams on the test implementations.\nWorking closely with the Business on the Change Requests development, processing and implementation.\nExperience working on CRM (Customer Relationship Management), ERP (Enterprise Resource Planning), and HRM (Human Resource Management) tools. \n\nAmerican Family Insurance (AmFam), Madison WI                                        Apr 2013 – Feb 2015\nSr Business Analyst\n\nPreparation of BRDs (Business Requirements Documents), FRDs (Functional Requirements Documents) and High Level Logical Data Models; supporting documents containing essential business elements, detailed definitions and descriptions to analyze and document business data requirements.\nFollowing and implementing IIBA protocols, standards and methodologies in given projects.\nThorough knowledge and understanding of various life insurance products offered i.e. Term and Permanent (whole, universal, variable and survivorship) to create and enhance web applications. \nTo create UML Diagrams like Use Case Diagrams, Sequence Diagrams, Activity Diagrams and Process Flow diagrams to elaborate the new processes using Rational Rose software inclusive of Requisite Pro.\nTo create prototypes, UIs and wireframes via iRise Studio for various stakeholders during the project phases and create tables, reports to use SQL for data analysis and assist in data warehousing for various applications.\nTo create and manage project templates, use case project templates, requirement types and traceability relationships in Rational Requisite Pro.\nTo implement change management strategies and conduct impact analysis as and when needed.\nTo collaborate with Quality Assurance Analysts in Rational Clear Quest to track defects and Rational Clear Case to maintain consistency in the builds.\n\n\nHealth Springs (Cigna Healthcare), Nashville TN           \t                          Apr 2012 – Mar 2013 \nBusiness System Analyst \nWorked on Member Management, Eligibility, Claims, and Provider modules within FACETS.\nConducted extensive analysis on migration and conversion of Provider and Member data, Group configurations, premium billing, benefit set-ups, fee schedules, provider pricing, capitation set-ups, etc from Legacy system to FACETS. \nClarified QA team issues and reviewed test plans and test scripts developed by development team and QA team to make sure all requirements have been covered in scripts and tested properly. \nInvolved in documenting the business process by identifying the requirements and also involved in writing the system requirements. \nWorked with the development teams to break down large and complex user stories into simplified versions for execution, on Agile projects.\nWorked in creating interfaces for various external vendors and created Technical Specifications for the 835 and 837 I and P files with their changed and new contents to create 5010 complaint files.\nCreated workflow diagrams, process flow and data flow diagrams. Assisted team with Data Mapping and Data Extracting Strategies for data migration. \nAnalyzing the business needs for the reports and documenting the requirements in SSRS forms. \nAnalyzed EDI ANSI X12 file mapping and reported in analysis spreadsheet. Performed validation of 837 (P, I) & 835 format files.\nEffectively communicated user acceptance test results between users and development team and provided recommendations for change control requests (CCR). \n\nCitizens Bank, Philadelphia, PA                                           \t\tNovember 2010 – April 2012 \nBusiness Systems Analyst/ Test Coordinator\nResponsibilities:\nGathered  requirements  from  key  stakeholders,  and customers to define the scope and requirements of online mortgage application.\nDocumented, and elicited business requirements from SMEs by writing user stories resulting in clearer, more detailed and more complete understanding of project deliverables, using JIRA.\nWorked closely  with  the  development  team to  verify  that  business  needs  are fulfilled and deliverables are produced within specified budget, quality and time.\nInvolved in designing Business Objects Universes, Queries, and Reports.\nDefined the context of the system by creating various use cases.\nDeveloped  system  requirements'  specifications  encompassing  Functional  and Non-Functional requirements.\nDeveloped UML models for modeling static and dynamic aspects of Online Banking System.\nDeveloped data maps for retrieval of information from existing account systems.\nOutlined security measures for accessibility and transmission of information.\nApplied a standard change control process in tracking defects originating from post-requirement phases.\nDeveloped plans for verification and validation of requirements at all levels so that, developed software successfully fulfilled user expectations and business needs.\nAssisted the database designer in data modeling through ER diagrams to identify tables, attributes and relationships between tables.\nWorked on creating documentation for the project on daily basis using MS Visual Studio, MS Word and created reports using MS Excel. \nWorked  on  3  new  and  2  previously  written  MS  Excel Macros  Custom Spreadsheets\nDrafted  test  strategies  and  test  plans  to  verify  accuracy  of  the  functionality,security, fault- tolerance, performance and successful system integration.\nAssisted in documenting User Manual and facilitate UAT and provide follow upto resolve the issues.\nConducted Regression testing and interacted with developers to resolve technical issues.\nTested applications in different browsers for Browser compatibility.\nCreated Test Scripts and Performed Functional and Regression testing usingCaptured and executed Test scripts.\nStatus  reporting  for  test  execution,  defect  resolution,  productivity  and  bug statistics. \n\nMVP Health Care, NY                                                   \t\t                        Oct 2007 - Jan 2010\nJr. Business Analyst/ Test Coordinator, Satyam Computer Services, India \nResponsibilities:  \n\nInvolved in various activities of the project like information gathering, analyzing the  information  gathered,  documenting  the  Business  Requirements as well as functional and system requirements.\nCollected  useful  requirements  to  design  the  user  approval  and  entitlement of the executive system.\nWorked with different resources from different teams for gathering requirements to build documentation. Also gathered requirements via brainstorming sessions and questionnaires from the stakeholders/ business users.\nWrote the Business requirements, System Requirements and Technical Design Specifications.\nAlso created the File specifications for different documents.\nFollowed waterfall methodology.\nPrepared business process models used MS Visio to create Use case diagrams.\nPrepared Integration  Test  Plan  which was used by functional team as well  as development team for doing a detailed testing on the business application.\nCreated ops- job sheets for scheduling jobs.\nWrote training materials which were used as the medium of training the users in production.\nInvolved in transitioning of the implemented projects to the service team.\n\nEDUCATION\nPost Graduate Diploma in Business Management (PGDBM), Osmania University, Hyderabad India.\nMaster of Social Work (MSW) in Medical & Psychiatry, Osmania University, Hyderabad India.\nBachelor of Social Work (BSW) in Administration, Planning and Policy, Osmania University, Hyderabad India.\n\n",
    "extracted_skills": [
        "agile",
        "communication",
        "data analysis",
        "jira",
        "leadership",
        "problem solving",
        "project management",
        "scrum",
        "sql"
    ]
}