{
    "id": "resume_fb35c33e-916e-4334-a017-573f4b7fcb87",
    "metadata": {
        "filename": "Uday_Maripelly.docx",
        "processed_date": "2025-09-24T08:45:57.419205+00:00"
    },
    "raw_text": "\nUday Maripelly\nSENIOR QA AUTOMATION ENGINEER - BofA\n\nJersey City, NJ 07306\n\nudaymaripelly4_2pq@indeedemail.com - 8162996342\n\nExperience in working with Software Development life cycle (SDLC) and Software Testing Life Cycle (STLC) models - Waterfall, Agile/Scrum.\nExpertise in various aspects of the Software Development Lifecycle including Requirements Analysis, Test Planning, Test Execution and Maintenance.\nExpertise in various types of testing like Automation Testing, Manual Testing, Integration Testing, System Testing, Smoke Testing, JUnit Testing, Black box Testing, Database Testing, GUI Testing, Web / UI and User Acceptance Testing (UAT).\n\nExtensive experience in preparing documentation on Change Control, Quality Control, Risk Management, QA Status Reports, QA Summary Reports, QA Test Logs, Issues Report, Defect Control.\nExpertise in Automation Testing of Web Applications and an end to end testing using Selenium WebDriver, Selenium Grid, JAVA, Ruby, TestNG, Maven, Apache POI.\nExtensive experience in Quality Assurance using Manual and automation tools which include Selenium RC/ IDE/WebDriver/Grid, Quality Center, Cucumber, Appium, Jenkins, SOAP UI and TestNG.\nExpertise in documenting defects with the high level of detail, accuracy, and informative recreation steps using Quality Center, JIRA, TFS, Rally, Bugzilla etc.\nExecuted Selenium test scripts on different browsers like Firefox, IE, Chrome & Safari and operating systems like Windows, Linux using TestNG, Java, and Selenium.\nUsed selenium WebDriver and TestNG to automate parallel testing.\n\nImplemented batch run of desired test cases using TestNG annotations like Groups, Parameter, and Data Provider.\nMaintained Selenium & JAVA automation code and resource in source controls SVN, GitHub, over the time for improvements and new features.\nExperience working on XPath for handling complex and dynamic elements in Selenium using different methods in XPath such as Contains, Starts-With.\nDesigned, implemented automation frameworks Keyword Driven framework, Data Driven framework, and Hybrid framework.\nUsing Cucumber developed Features, Scenarios, and Step Definitions for Behavior Driven Development (BDD).\nWorked on Appium to develop Automation Testing scripts for native and Web Apps for mobile devices. Work experience in integrating Automation scripts (Selenium WebDriver API) on Continuous Integration tools Hudson/Jenkins for a nightly batch run of the Script.\n\nExperience in creating Cucumber BDD (Behavior-Driven Development) framework and automating BDD scenarios in Eclipse using Java. Experienced in automating web services like SOAP and REST using Java and Groovy.\n\nExperienced in Web Services testing using SoapUI. Validated request and response SOAP and RESTFUL Web service call with Assertions. Experienced in Web Services Testing using SOAPUI and Postman tools. Validated request and response SOAP and RESTful Web service calls.\n\nDeveloped Hybrid framework from scratch using Selenium Web Driver. Developed Test Scripts to implement Features, Scenarios, and Step definitions for BDD (Behavior Driven Development), TDD (Test Driven Development) using Cucumber in Gherkin format.\n\n\nExperienced in using HP Quality Centre/Application Lifecycle Management (ALM), MKS Integrity, APPM, and JIRA for Test Cases design, defect tracking and management. Have knowledge of Rational Clear Quest, Bugzilla defect management tool.\n\nExperience in working with cross-functional groups, different levels of management and liaison between system users, company management, and development team.\nStrong understanding of Web technologies and Programming languages, The Web, Database and Application Servers and N-Tier Architectures.\nExperience in reviewing the deliverable and conducting QA review meetings. Experienced in all aspects of quality testing including process design and standards, effort estimation, resource forecasting and fulfillment, and task and risk management, functional, performance, regression and roll-back testing.\n\nWilling to relocate: Anywhere\n\nAuthorized to work in the US for any employer\n\n\nWORK EXPERIENCE\n\nSENIOR QA AUTOMATION ENGINEER\n\nBofA\t-\tCharlotte, NC -\n\n2016-01 - Present\n\nWORKING\n\nDeveloped the automated test script for regression test suite in an application using Selenium tool.\n\nCreated automation framework using Hybrid framework -- Data Driven and Page Object Model (POM) to test web application. Worked on Selenium Grid for automation script in Java for cross browser testing. Used TestNG annotations to group the test methods for functional testing.\n\nDeveloped test scripts to automate the process of testing in Selenium WebDriver. Developed Selenium scripts to find, verify, select, edit and perform various operations on web elements. Used Select class to perform operations on the drop-down list.\n\nDeveloped Selenium scripts to get the data from the web page by using the methods like getUrl, getTitle, getAttribute, getText. Developed scripts to navigate to various iframes and to handle multiple windows and performed operations on the web elements.\n\nDealt with Accessing Links & Tables using Selenium WebDriver and Ajax call in Selenium Web Driver. Performed operations on the database using JDBC APIs.\nValidating XML tag values after generation of XML when web service calls w.r.t to the DB values stored in Database (SQL). Involved in writing SQL queries to span database for required result\nPerformed Structural Testing, Functional Testing and Non-functional Testing Database Testing Used Selenium WebDriver API with TestNG to automate tests on cross browser and cross platform environment.\nSetting the priority to the test cases using the TestNG framework.\n\nUsed various TestNG annotations like @Test, @BeforeSuite, @AfterSuite, @BeforeTest, @AfterTest, @BeforeClass, @AfterClass, @BeforeMethod, and @AfterMethod.\nPerformed browser (IE, FIREFOX, Chrome, Safari) and platform (Windows 7/8/XP) compatibility testing in a virtual machine environment. Wrote Selenium script for taking a screenshot and also used Actions class to perform mouse and keyboard events. Involved in automating the popups using the Alert interface. Configure Jenkins build job for continuous Integration and for Regression Testing.\n\nInvolved in using Maven build tool to manage framework dependency jar files. Used Apache POI to read data from external sources and provide them as a parameter to the locators in the test script.\nGenerated test logs using Log4j for various log levels. Created .au3 files using AutoIt to interact with the desktop windows to upload files.\n\n\nUsed SVN to maintain and manage the build scripts, test data used, and other documents related to the project.\nImplemented selenium synchronization by conditional synchronization using the sleep method and unconditional synchronization using the implicitWait and explicitWait methods.\nUsed Rally to track and resolve defects.\n\nUsed Cucumber by creating the Features and Step Definition files in java to execute test scripts.\n\nTested, resolved and documented the issues in the Test environment and ensure the software is working while producing a high-quality final product. Deploy the application out of the test phase to be released into Stage environment.\n\nPerformed Soap and Restful Web Service Testing using SoapUI and validated response using Assertions.\n\nRegression testing, rollout planning. Solution release & Post-release Production maintenance.\n\nSchedule and prioritize work and plan a sequence of testing activities that accomplish the planned targets. Set priorities and provide reports to the management.\nInvolved in Database testing for Oracle Server.\n\nValidating XML tag values after generation of XML when web service calls w.r.t to the DB values stored in Database.\nInvolved in writing SQL queries to span database for required result.\n\nMentored team members in design and analysis activities.\n\nAssisted in the training and orientation of other staff and end users.\n\nEnvironment: Java, Selenium WebDriver, TestNG, Selenium Grid, Maven, Jenkins, Eclipse, Oracle, SVN, Cucumber, Rally, AutoIt, SoapUI, Apache POI, JBehave.\n\nSENIOR QA AUTOMATION ENGINEER\n\nST JOSEPHS HEALTH SYSTEMS -\n\n2013-12 - 2015-11\n\nReviewed design documents & business requirements to learn the function and scope of the application.\n\nAnalyzed the SRS (System Requirement Specifications) and developed Test Suites to cover the overall quality assurance testing.\nInvolved in complete QA Life Cycles and in writing and implementation of the Test Cases.\n\nUsed HP performance center for analyzing and validating application with business requirements.\n\nDocumented Test Cases for Functional Testing and Backend Testing.\n\nUnit testing documentation developed using Excel. Artifacts were created and listed for UAT validation. Writing/validating Use Case Documents\nConducted Functionality testing during various phases of the application. Performed integration and functional testing for different applications.\nCreated manual Test Cases in HP QC/HP ALM for various User Stories.\n\nDeveloped automated test cases for all manual tests cases provided.\n\nImplemented automation using Selenium WebDriver, JAVA, TestNG, and Maven.\n\nDealt with Accessing Links & Tables using Selenium WebDriver and Ajax call in Selenium Web Driver.\n\nWrote Selenium script for taking a screenshot and also used Actions class to perform mouse and keyboard events.\nImplemented the selenium synchronization using the wait and sleep methods.\n\nPerformed operations on the database using JDBC APIs.\n\nUpdated Framework functions when needed, executed them and generated reports.\n\nDid Java coding extensively for Data Driven framework and Keyword Driven Framework by using TestNG framework along with Selenium, Maven.\n\n\nUsed various TestNG annotations like @Test, @BeforeSuite, @AfterSuite, @BeforeTest, @AfterTest, @BeforeClass, @AfterClass, @BeforeMethod, and @AfterMethod.\nExpertise in implementing the hybrid selenium automation framework using Java, Object Identification technique, Data-driven technique.\nProficient in Using Apache POI to drive data from excel files to run the test cases.\n\nPerformed continues the integration of the test cases periodically using Jenkins and configured it to email reports during a build failure.\nManaged the testing process, schedule batch tests, log and track defects using HP quality center.\n\nDeveloped SQL queries to test the data after executing transactions like upload processing and check Processing in batches. Used SQL and Crystal Reports for querying underlying database tables.\nExpertise in POM.xml to get required dependencies from a central repository, add plugins, ran scripts using pom.xml file, grouped test suites by assigning profile ids.\nDeveloped associated project documentation, schedule, design specifications, test plan, test scenarios/ scripts, performed gap analysis, and test tracking reporting/monitoring for all phases of testing including B2B user acceptance testing.\n\nEnvironment: Java, Selenium WebDriver, Selenium IDE, TestNG, Apache POI, Extent Reports, Cucumber, Eclipse, Windows, Oracle, Maven, SQL server\n\nQA ANALYST\n\nWALMART\t-\tBentonville, AR -\n\n2011-01 - 2013-09\n\nReviewed and analyzed Business Requirement Documentation (BRD) to gain an understanding of POS implementation.\nReviewed Functional requirement and Use Cases documented in Requisitepro.\n\nWorked on POS self-checkout. POS QA Testing was involved in the setting of QA Test environment with simulated POS test environment. Created manual Test Cases in HP QC/HP ALM for various User Stories based on Release and Sprint Plan.\n\nCreated test scenarios and test cases based on functional documents and User stories.\n\nInvolved in End to End test of whole application. Used SQL queries to retrieve the data from the database and validate the data by comparing source with targets\nTested different functions of the POS system like scanning, payments, and returns. Moreover, make sure that the system met the requirements and expectations. Performed data validation testing using POS system.\nCreated test strategies to detail testing activities from requirements gathering through defect management through UAT promotion to production.\nExecuted test cases and test scripts for manual and automation testing. Defects are raised in the HP Quality Centre/HP ALM for logging, tracking and reporting bugs in the application.\nInvolved in End to End Validation of Point of Sale (POS) application and Managed and closely participated in the Project Management of POS Initiatives.\nSetting Test plan and Test Lab in the Quality center for the projects to create and access requirements, defects, test cases and reports for the status. Involved in UAT of the applications by providing users with test cases and scenarios, and guiding them through the testing process.\n\nCreated and executed detailed test cases with step by step procedure and expected results and maintained the test logs, test reports, test issues, defect tracking using Quality Centre. Used Selenium for regression testing and running the automation suite.\n\nResponsible for software QA and analysis, with emphasis on performance testing and functional decomposition of web-based (SOA) and legacy systems architecture.\n\n\nConducted test case reviews and presented the test cases/test scenarios to the team members for all iterations.\nInserted checkpoints where needed, to compare the current behavior of the application being tested to its behavior in the earlier version using Selenium.\nExecuted SQL queries to verify the database for the relevant test cases. Documented the defects in Quality Centre and assigned them to relevant developer.\n\nEnvironment: HP Quality Centre, Selenium, ALM, JavaScript, Java, HTML, DHTML, UAT, CSS, IBM WebSphere, RAD, DB2.\n\nSOFTWARE TEST ENGINEER\n\nTNS INDIA -\n\n2009-08 - 2011-11\n\nAnalyzed business requirements and functional documents, created the test strategy document that define the test environment, phases of testing, entrance and exit criteria into different phases of testing and resources required to conduct the effort.\n\nDrafted test plan which included testing objectives, testing phases, scenarios and test environment after a thorough analysis of the business rules.\nCreated manual test cases, reviewed with different stakeholders to validate the functionality.\n\nCoordinated with different Stake Holders to prepare user guide and knowledge acquisition of the system.\n\nWrote PL/SQL Queries to retrieve the data from various Tables and to test the database.\n\nPerformed the Back-End integration testing to ensure data consistency on front-end by writing and executing SQL statements.\nConducted backend testing using SQL queries to validate data for database.\n\nDeveloped descriptive programming and maintained local and global Object Repository in QTP.\n\nInvolved in manual testing and automated test scripts by using QTP.\n\nDeclared Checkpoint and worked on Object Repository by using QTP.\n\nPerformed Data Driven test for backend testing using with QTP.\n\nGathered the Business Requirements and maintained them in Quality Center.\n\nAnalyzed and assigned defect to responsible team in Quality Center.\n\nReported, logged and tracked defects using Quality Center.\n\nCoordinating with Business users/ UAT Testers during UAT phase, providing them with UAT guidelines, supporting and attending user's queries on the application.\nConducted and coordinated integration and user acceptance testing (UAT) prior to the release of new data feeds into production.\nInteracted with the development team to fix the defects as per the defect report.\n\nAttended meetings involving Developers, DBAs and Analysts, Project Manager for tracking changes and change management.\nDelivered test results in appropriate format for approval of the project team.\n\nParticipated in daily status meetings with testing team and providing the necessary feedback.\n\nProvided weekly status to the project manager as well as users.\n\nReported the status of testing activities to the teams and management as necessary.\n\nEnvironment: Manual Testing, Quality Center, QTP, UNIX, VBScript, Oracle, SQL, PL/SQL, Contact Center Operations, MS Outlook.\n\n\nEDUCATION\n\nBachelor's\n\n\nSKILLS\n\nSQL, JAVA, INTEGRATION, INTEGRATOR, ORACLE\n\n\nADDITIONAL INFORMATION\n\nMethodologies\n\nAgile (Scrum), Waterfall, SDLC, STLC\n\nLanguages\n\nJava, HTML, XML, Gherkin, C, Restful, Soap, WSDL\n\nIDE\n\nEclipse, SQL Developer\n\nTest Framework\n\nKeyword Driven, Data Driven, Hybrid, Page Object Model (POM)\n\nWeb Debugging Tool\n\nXPath, Fire path, Firebug\n\nUtilities\n\nAuto IT, Wget\n\nBuild Tool\n\nAnt, Maven\n\nBug Tracking Tools\n\nJIRA, Quality Centre\n\nOperating Systems\n\nWindows (XP, Vista & 7, 8, 10), Mac, Linux, Unix\n\nTest build, Integration Tools\n\nMaven, ANT, Jenkins, SVN, Git\n\nDatabases\n\nSQL Server, MS Access, Oracle, MySQL.\n\nMS Office tools\n\nOutlook, Word, Excel, PowerPoint.\n\nBrowsers\n\nInternet Explorer, Mozilla Firefox, Google Chrome, Safari\n\n",
    "extracted_skills": [
        "agile",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mysql",
        "oracle",
        "project management",
        "r",
        "ruby",
        "scrum",
        "sql"
    ]
}