{
    "id": "resume_6bd0b40d-f8a9-4485-9150-90ff4e23d660",
    "metadata": {
        "filename": "Ujvala BA Feb 20.docx",
        "processed_date": "2025-09-24T08:45:57.498933+00:00"
    },
    "raw_text": "Ujvala Bypa\nBusiness Analyst\nContact no. (415) 813-8870\n    Email Id: ujvala.b.1@gmail.com\n\nPROFESSIONAL SUMMARY\n\nCertified Agile Scrum Master and Business Analyst with 8+ years of domain experience in Financial Services, Healthcare and Telecom.\nProficient decision-making, leadership, presentation, communication, problem-solving and analytical skills with ability to interact at all levels.\nHands on experience in accomplishing outstanding results with the Business Stakeholders, Development and Quality teams.\nTracked and effectively communicated team velocity and sprint/release progress to all affected teams and management\nUpdated Agile tracking systems to provide transparency on product and sprint backlogs\nWorked with the Scrum Team and the Product Owner to negotiate the minimum viable product for delivery\nExcellent work ethics and analytical skills coupled with excellent communication, written and interpersonal skills describing a committed team player.   \nPossess thorough experience in full end-to- end SDLC, Agile methodology to manage and deliver projects.\nExperience with Data Mappings from source to destination databases with hands on requirement gathering for ETL.\nExperience in scheduled and ad-hoc report generation using MS Excel, SSRS, PowerPivot.\nKnowledge of Health Insurance Portability and Accountability Act (HIPAA) standards, Electronic Data Interchange (EDI) and ASC X12N code sets 4010/5010, ICD-9, ICD-10 and HL7.\nPossess thorough experience in full end-to- end SDLC, Agile methodology to manage and deliver projects.\n In-Depth Knowledge in facilitating Joint Application Development (JAD) and Joint Requirement Planning(JRP) sessions, interviews, workshops and requirement elicitation sessions with end-users, clients stakeholders and development team. \nExperience in conducting GAP analysis, Impact analysis, Feasibility study, Cost-benefit analysis, Risk analysis, Root cause analysis, Business Process Reengineering and SWOT analysis.\nExperience in Data Analysis; writing SQL queries (T-SQL & PL-SQL) especially stored procedures, joins, triggers and views. \nA team player with experience in handling remote teams esp. managing schedules and meeting agenda.\nExperienced in creating visually attractive Reports using Excel and SQL Server Reporting Services (SSRS).\nWorked with business teams and user groups to identify, analyze, and document business Intelligence opportunities/requirements and developed functional requirements. \nWorked with QA testing teams, while interacting with business users and gathering user’s requirements to develop necessary Test plans, Test Cases and Test script.\nExperience in designing schemas, ER diagrams, creating databases, data mapping and executing queries using SQL.\nExperienced in training users and developing training manuals\nStrong team building, conflict management, time management and escalation protocol skills.\nOrganized and facilitated Scrum ceremonies including Sprint planning, Backlog grooming, daily stand-up meetings, reviews, retrospectives, Sprint and other related meetings.\nExperience in.passion for or willingness to learn about Expertise Marketing\n\n\nAREAS OF EXPERTISE\n\nBusiness Skills: Business Requirements, Business Process Analysis &amp; Design,\nRequirement Gathering, Use Case Modeling, JAD/JRP Sessions, Gap\nAnalysis and Impact analysis.\n\nProcess/Model Tools: MS Visio, Rational Unified Process (RUP), Rational Rose, Rational Requisite Pro,UML, Use Case Diagrams, Sequence Diagrams, Activity Diagrams, MS Office.\n\nScrum Master Process: Product Backlog, Sprint Backlog, Release Burndown charts, Task board, Daily Scrum, Sprint Planning, Sprint Reviews, Retrospectives & Backlog Grooming\n\nTest Tools : Test Director, Win Runner, Load Runner.\n\nLanguages: SQL, UML, J2EE, .NET, HTML, XML, and Visual Basic 5.0/6.0\n\nDatabases: MS Access, Oracle 8i/9i, DB2, MS SQL Server.\n\nRisk Management Tools: FMEA, Fast Track, CAPA, JIRA Service Desk, Oracle Service Cloud, Salesforce, SWIFT,NACHA\n\nRequirement Management Tools: HP ALM, Blueprints, ERP, JIRA, VersionOne, TFS (Team Foundation Server), IBM Rational DOORS and Jama.\n\nOperating Systems: UNIX, Linux, Windows 95/2000/NT/XP, MVS, and MS-DOS.\n\nOffice tools: MS Office 2003 (Word, Excel, Power Point, Outlook), MS Visio,\nMS Project, MS Access, and MS FrontPage.\n\nPROFESSIONAL EXPERIENCE\n\nScrum Master/Sr.Business Analyst \nJan 2017 to Till Date\nBlackhawk Network Holdings, Pleasanton, CA\n\nProject Description: The project is to being a part of the Center of Excellence (COE) team you will work alongside financial professionals and business leaders, gaining opportunities to grow and develop to build a strong FP&A foundation.  Involved in; target setting, reporting & analysis, planning and forecasting, and guiding the strategic direction across BlackHawk Network Holding’s.\n\nRoles and Responsibilities:\n\nActed as Scrum Master for Product teams with a focus on guiding the teams towards improving the way they  work.\nActed as a Project Manager when necessary in communicating with IT team and stakeholders on project status including prioritization, risk management to support decision making\nAssisted team to remove impediments by having an understanding the control and release processes, business requirements (test plan). \nAssisted with internal and external communication, improved transparency, and radiated information\nAssisted with prioritization and resolution of software defects\nWorked on payment scheme like Wires/ACH/RTP \nWorked on payment tools like SWIFT/NACHA\nWorked with clients on assisted my team on  payment services ,positive pay, reverse pay, stop pay and security and fraud prevention\nBuilt relationship with Product owner and other stake holders to facilitate team's interaction with them\nCoached Product Owners in creation and maintenance of Product Backlog\nCoached team members on Agile principles and providing general guidance on the methodology\nContinuously learned Agile/Scrum techniques and shared findings with the team\nEngaged with other Scrum Masters to increase the effectiveness of the application of Scrum in the organization\nFacilitated getting the work done without coercion, assigning, or dictating the work\nFacilitated sprint planning, burn down charts, sprint review and sprint retrospective meetings \nGathered business requirements by conducting meetings with stakeholder and business users.\n Performed GAP analysis of client requirements, generated workflows for the project.\nAnalyzed and optimized the process. Prepared business requirement document.\nDocumented High level and expanded Use Cases. Use Case analysis using UML, which provides the framework for potential Use Case deliverables.\nDeveloped an analysis model that includes Sequence diagrams, Use Case diagrams,\nActivity diagrams using MS Visio that provides the development team a view of the requirements for construction phase activity.\nCompleted weekly project status reports.\nDiscussed the Test Cases and Test Plans and select Test Data for Software Testers.\n Member of team responsible for evaluation, timely implementation and support of business products in the distributed computing environment.\n Involved in analyzing risks associated in integrating the client systems located in different geographical areas.\nInvolved in weekly walkthroughs to verify the status of the testing effort and the project asa whole.\n\n\nEnvironment: Requisite Pro, MS Visio, Visual Source Safe, WinRunner, Java, J2EE, Java\nScript, XML, HTML, SQL Server 2000, Windows 2000, Ms Office.\n\nScrum Master/Sr. Business Analyst\nNov 2015 to Dec 2016\nCVS Health, Woonsocket, RI\n\nProject Description: CVS Health’s international health plan covers expats and their families. It also has option that covers international business travelers from 6 months up to 2 years. The Expat Resource center dashboard provides its’ members overview of access to provider (medical facilities) in destination country, news alerts, financial and employment information, general health related matters and contact details for in-country assistance. It also lists the geographical statistics of the Healthcare services in the selected destination\n\nRoles and Responsibilities :\n\nFacilitated sprint planning, burn down charts, sprint review and sprint retrospective meetings \nConducted meticulous GAP analysis while successfully reengineering key business processes to increase operational efficiency and alignment of business unit objectives\nFacilitated Daily Scrum Meetings and Monthly Reviews meetings. Conducted sprint retrospective and followed up on action items for continuous improvement\nPrepared extensive cost - benefit analysis to support system and process changes and information reporting/reports.\nMeticulously analyzed complex data, staffing plans and variances to recommend solutions to improve revenue per call and customer satisfaction/retention\nDeveloped crucial functional requirement specifications, creating detailed use cases and process flow diagrams to support functional specifications.\nInteract with business heads  to finalize the Business Requirements.\nAs a Product Owner, presented new business solutions to stakeholders before initiating the project.\nConducted GAP Analysis by creating “AS-Is” and “TO-Be” process flows and system analysis to increase operational efficiency determine if solutions meet the high-level business requirements.\nAnalyzed impact of proposed solution across the business. Developed proposed statement of work(SOW) ensuring solution meets the defined technological needs and specifications.\n Facilitate JAD sessions with the business group to gather, analyze and document business requirements and business rules.\nDecompose Business Requirements into Functional, Non-Functional and Reporting requirements..\nDocument the Business Requirement Document (BRD) and the Requirement traceability matrix.\n Created UML Models such as wireframes, Use Case Diagrams, Activity Diagrams and Flow Diagrams using MS Visio and online UML tools.\nImplement the Agile Software Development methodology for SDLC, for tracking defects and managing the project. Participated in the Sprint Planning, Sprint Review, Sprint retrospective, Daily Stand up meetings and all related SCRUM ceremonies.\n Design the User stories, facilitated story point discussions and managed them in Microsoft TFS (TeamFoundation Server).\nEnsure complete test coverage through test cases and scripts, during Integration, System, Regression and executed the UAT testing.\nInvolved in writing user manuals and conducting user trainings sessions.\nResponsible for release of three important work streams. This involved coordinating with teams, documenting all issues, risks and seek a resolution so that the go live happened smoothly.\n\n\nEnvironment:  XML/XSD, Web Services, SQL, Java Script, Oracle, Microsoft TFS, HP Quality Center. MS SQL Server, JIRA, MS Office (Word, Excel, PowerPoint, Access), MS Visio, SharePoint\n\n\n\nBusiness Analyst\nFeb 2015 to Nov 2015\nKaiser Permanente, Pleasanton, CA\n\nProject Description: Kaiser Permanente as a business strategic decision to gain market advantage and be the provider of choice for home dialysis therapies.The project was to use technology solutions to add value to the Kaiser Permanente’s home therapies program and to encourage the selection of home modalities by patients and physicians. With different vendors, Kaiser Permanente developed an application called Soarians Clinical's web based/portal application. The system was developed to maintain the clinical, financial, and administrative functions.\n\nRoles and Responsibilities :\nWorked with the management in assigning the project resources.\nElicited requirements by interviewing the physicians and the pharmacists, site visits to the facilities and document those requirements.\n Interacted with the business owner and the executives for defining the objectives\nof SDLC Process.\nCreated the use cases and the process flows in MS Visio (Business ProcessModeling).\nProvided input to estimates for project management and change management activities through analysis of requirements effort, resources, and technology.\nSupported the development and training of staff & modeling the key business analyst disciplines and skill sets.\nGathered the requirements according to HIPAA on different transaction sets.\nCoordinated and Conducted JAD Sessions for the business users.\nGathered the utmost information from the end users while conducting the JA Decisions and meeting up with the deliverables of the session.\nCreated the web scenario use cases and developed report screen mockups.\nResponsible for doing the data mappings in SQL Server 2005 and finding out the database elements to complete the Technical Specification Document.\nInvolved in gathering business requirements and collaborated on creation of documents such as the Functional Specifications Document (FSD) and TechnicalSpecification Document (TSD).\n\nEnvironment: Agile, JIRA, MS Office, Lync 2013, MS Project, MS Visio 2010, MS SQL Server, ASP.net, SharePoint 2010, ServiceNow.\n\n\nBusiness Analyst \nNov 2013 to Feb 2015\nCharter Communications, Stamford, CT\n\nProject Description: The project is managing strategic company initiatives, the implementation of new marketing products, services and promos, and major IT infrastructure work/migrations, from a Revenue Assurance organizational perspective, which includes contract processing, rate entry and audit, quality assurance, production billing, custom billing, accounts receivable, collections, and customer service billing related inquiry and credit processes.\n\nRoles and Responsibilities:\n\nDeveloped specs for business logic agents – components within OMS which asynchronously communicate with various systems or other BLAs to take the order to completion\n Re-design of components to comply with new design patterns incorporated as part of and enhanced J2EE system\nUsed XML to map data elements for messaging between various system components through a centralized bus\n Acted as liaison between business users and development team to clarify requirements and problems encountered during development\nWorked with developers to make sure they understand the use cases and worked with quality control teams to develop test plans and test cases\nAssisting the PMs in setting realistic project expectations and in evaluating the impact of changes on the organization and project plans\nParticipated in bug review meetings to discuss outstanding issues with QA team and developers\nWorked with UAT team to validate that the developed application will meet the business requirement\nIdentifying potential problems, taking corrective measures and tracking risks to closure\nProduction Support – first point of contact for trouble shooting the system\n\nEnvironment: Java/J2ee, HTML, UML, XML, WebMethods, SQL, PL/SQL, MS Visio, Caliber RM,\nSDLC, GUI, Oracle, Weblogic Server, Solaris\n\n\t\t\t\t\t\t\nBusiness Analyst \nAug 2009 to  Sept 2013\nACC Limited, Mumbai,  India\n\t\t\t\t\t\t\nProject Description: Worked in E-Business team. E-Business project develops and supports Goodman manufacturing online web applications. Employee Net, Supplier Net and SecureNnet are the 3 projects supported by the team. Each application provides web application for different user groups like employees, suppliers and customers. All the IT development, maintenance and support are taken care of E-Business team.\n\nRoles and Responsibilities:\t\n\nInteracted with business heads to finalize the Business Requirements for the application\nDerived Functional Requirement Specifications based on User Requirement. \nUnderstand and articulate business requirements from user interviews and then convert requirements into technical specifications. \nPrioritized business requirements and segregated them into high level and low level Use Cases, Activity and Sequence according to UML methodology. \nCoordinated between business line, operations and the technical team throughout the project.\nExperience in working on user interface (UI) screens for SharePoint system.\nWorked with the business team for the project requirement review and User Acceptance Testing (UAT). \nCreated UAT plans and several other types of test cases for each project to ensure that the system runs smoothly after the proposed enhancements.\nCreated and maintained the Requirement Traceability Matrix (RTM) between the requirements and design documents and test plans.\nPerformed Use Case testing to support QA team in adjusting to agile environment.\nManaged various tests, stored test information, reviewed and analyzed test results.\nConducted presentations of the Q/A test results with analysis to the stakeholders and users and documented modifications and requirements.\nDeveloped a Use Case Model ,UI using MS Visio and developed a detailed project plan with emphasis on deliverables.\nDesign application solutions, considering user functionality and user interface.\nSuccessfully conducted JAD sessions, which helped synchronize the different stakeholders on their objectives and helped the developers to have a clear-cut picture of the project.\nInvolved in the application and database design Participated in Gap analysis between stakeholders and user’s needs and proposed solutions.\nExperience in analyzing data using excel and creating Pivot tables and creating reports using SQL \n\nEnvironment: Agile, TFS,MS Office, MS Project, Rational Requisite Pro, MS Visio 2010, MS SQL Server,\n",
    "extracted_skills": [
        "agile",
        "asp.net",
        "communication",
        "data analysis",
        "go",
        "html",
        "java",
        "jira",
        "leadership",
        "oracle",
        "project management",
        "scrum",
        "sql",
        "swift"
    ]
}