{
    "id": "resume_4d4a052d-d80d-4d4f-9b2f-a723a38525aa",
    "metadata": {
        "filename": "Vamshi Teja_Business Analyst.docx",
        "processed_date": "2025-09-24T08:45:57.919978+00:00"
    },
    "raw_text": "Vamshi Teja\nEmail Id:vamshiteja50@gmail.com\nContact: 650-417-3184\n\nProfessional Summary:\n 7+ years of experience, working as Business Analyst in various Domains including Airlines, Healthcare, and Banking.\nExtensive Knowledge of Software Development Life Cycle (SDLC), Development methodologies like AGILE, Waterfall.\nExperienced in Iterative Development Frameworks such as Rational Unified Process, Agile and Scrum.\nHands on experience Business and Requirements Analysis, Business Process modeling and Project planning.\nExperienced in Eliciting Business Requirements and Expertise in Transforming Business requirements in to Functional requirement documents and Designing business models using UML Diagrams.\nExperienced in facilitating requirement elicitation techniques such as Joint Application Development (JAD), Rapid Application Development (RAD) and Joint Requirement Planning (JRP).\nProficient in analyzing and Creating Use Cases, Use Case Diagrams, Activity diagrams, Class diagrams, Data Flow Diagrams, Business Flow Diagrams and Sequence diagrams using MS Visio and Rational Rose.\n Communicated and collaborated with external and internal Stakeholders to ensure the success of the project. \nExperienced in Created extensive SQL queries for data retrieval, manipulation, and reporting\nTraced and informed business requirement changes through the lifecycle of the project using Rational Requisite Pro and maintain a Requirements Traceability Matrix (RTM) to keep the stakeholders informed of the progress of the project.\nExperience in conducting  Gap Analysis, SWOT and  Cost Benefit Analysis\nExperience in the creation of Test Plan and Test Cases from the Requirements document. Documented Test Plans, Test Cases, Test Scripts, Test Procedures based on the Design Document and User Requirement Document for the Integration, Regression, Functional, Performance, and User Acceptance Testing (UAT).\nParticipated in daily scrum stand-ups to know the progress towards the sprint goal. Lead Agile development sprint planning meetings for one or more projects.\nPrioritized user stories, Epics and themes and plan them into Sprint releases, based on client deliverables.\n\n\nTechnical Specifications\n\nClient: Southwest Airlines, Dallas,TX.\t\t\t\tOCT 16-Present\nRole: Business Analyst\n\nThe project involved enhancing the website for southwest Airlines. It also included System for organizing travel details for registered customers like booking tickets, managing their itinerary, booking hotels, and ground transportation. The application was interfaced with various databases to fetch data via APIs.\nResponsibilities:\nGathered Business requirements, defined Scope of Project, created BRD, FSD and Project Charter.\nFacilitated one on one interview, workshops, and other requirement elicitation sessions.\nOrganized Joint Application development (JAD) session and workshops with end user/client/business and development teams.\nCreated Epic and User stories using Jira\nInstalling, configuring and monitoring MS SQL Database Servers.\nAssisted the project manager in preparing the project schedules, milestone tracking and resource allocation using MS Project.\nConducted Change Request Meeting and documented issues and performed impact analysis \nCreate and fine tune SQL Server Integration Services (SSIS) packages for ETL and data migration\nConducted Functional walkthrough sessions to educate team with ongoing developments.\nCreated Class Diagrams ,State Diagrams ,Sequence Diagrams, and Use cases using MS Visio\nPerformed Gap Analysis to identify the discrepancy between what is and what should be in the website layout and developed a plan to close the gap\nDocumented Test Scripts, Test flows, Test performance using MS Word and MS Excel.\nReviewed test scripts for the new functionality by working with offshore team, reviewed test results and performed User Acceptance Testing (UAT).\nEnvironment: Agile, JIRA, Windows, MS Project, Ms Visio, Ms Excel\n\nHealth edge, Burlington, MA\t\t\t\t             JUL 2015– OCT 2016\nBusiness Analyst \nThe main objective of the project was to design an Electronics Claims Processing (ECP) system to accept the electronic claims coming from the various providers (doctors and hospitals) and process them. System also incorporates the health insurance products, which helps their employees to choose and calculate their benefits. The project was also to make the service providers acquired by HIPAA compliant and to integrate all of them into one system.\nResponsibilities: \t\n\nAccumulated system requirements from various departments like accounting, Human Resource through surveys, interviews and JAD sessions.\nCreated Business Requirement Specifications and Functional Specifications Document using MS Office Tools.\nMet with users and stakeholders and identified problems, resolved issues and improved the process to ensure a stable and accurate solution.\nCreated user stories and story cards.\nDesigned the functional requirements of the application through Mock-up forms for better illustration of the application, and also documented the non-functional requirements.\nCreated exceptions report which were then submitted to project lead and stakeholders on a regular basis.\nDeveloped UML diagrams using MS Visio.\nUpdated and modified progress and resources allocation in MS project for the team.\nFacilitated user acceptance testing and created test strategies with Information Technology Group.\nPerformed manual front-end testing to check all functionalities of different modules.\nMake sure to trace test cases to operations use cases. \nRecommend and implement naming convention for Test Cases, Test Sets and Defects. \nPerform Gap Analysis\nCoordinate with Test Coordination Center to set up and follow up on daily, weekly and monthly reports.\nAttended Weekly status meeting and provided a weekly report that includes test metrics consisting of status reports. \nAssisted in Load Testing and UAT testing.\nWorked on HP Quality Center to log bugs and raise tickets.\nSuggested measures and recommendations to improve the current application performance.\n\nEnvironment: Agile, Windows, MS Office, Sql , MS Project, MS Visio.\n\n\nClient: CHASE, Palo Alto, CA.\t\t\t\tDec 13–Jul 15\nBusiness Analyst \nCHASE provides a broad range of banking, asset management, wealth management, and corporate and investment banking products and services.\nThe project focused on the credit card transactions and made them transparent. Making an offer based on their usage, improvise web based user interface richer and easy to operate. Along with that added responsibilities, client information was aligned with IDAM systems for quicker notifications. The customer’s dashboard was enhanced to display the spending report for every quarter and suggested different types of credit cards for Chase customers. \n\nResponsibilities:\nActed as a liaison between business clients and technical teams by planning, conducting and directing the analysis of business requirements to support online transactions.\nLed requirements elicitation sessions to understand business problems and how proposed system enhancements will address them for escalating the issues.\nAssisted in the development of quality assurance activities including Quality Assurance Plan, Product Acceptance Plan, Test Plan, and Test Cases.\nProduced business requirement artifacts including UML, Use Cases, Business Rules, Supplemental (Non-Functional) Specifications, and User Interface Design Specifications.\nCreated workflow mockups to create navigation flow for the websites.\nCreated extensive SQL queries for data retrieval, manipulation, and reporting\nCreated User Stories for maintaining FTPs and navigation flow for the online transactions for downstream, upstream and midstream interfaces (HTTP, REST).\nCreated Business Change Request Management (BCRM) Documents for building integrated platforms to accommodate new technologies & development methods, improve the processing of sensitive information, and reduce operational risks, User Acceptance Testing (UAT) and Test Plans (Quality Center).\nUpdated the bank's Identity and Access Management (IDAM) strategy and worked with multiple technical teams and financial advisors for integration and measuring probable impact.\nFacilitated technical teams to develop, implement, and administer access control processes that support the creation, modification, and termination of system level user accounts and associated access rights for IDAM.\nCreated Wireframes to present it to the development team to better understand business process.\n\nEnvironment: RUP, HTTP, REST, MS Visio, Ms excel\n\n\nClient: Cigniti Technologies\t Hyd, Ind.\t\t\t\t\tAug2010-Nov 2013\nRole:   Quality Analyst\n\nResponsibilities:\nCreated Test Scenarios and Test cases from functional requirements related to End-to-End application.\nProvided updates during daily scrum call /Daily standup call.\nHandled several integrated and independent Release initiatives.\nCoordinated with team in reviewing the scripts and followed up with onshore developer and project management.\nPerformed manual testing on mobile devices like checking UI, Browser compatibility, Installation/ Uninstallation of the application on mobile devices.\nGenerated test cases according to user stories specified in QC tool for each sprints.\nCreated Test scenarios, Test cases from SRS documented.\nSupported Production team in every integrated and Independent release, by certifying services from our end.\nInteracted with the development team to report bugs and discussed the status of bugs with open status or hold status.\nActively participated in enhancement meetings, project review meetings, Weekly status meetings and various other meetings which were focused on making the application more effective.\nInvolved in various documentation tasks such as daily status reports, weekly progress reports, Requirements traceability Metrics (RTM) and defect logs.\nPerformed detailed analysis on the Rejected defects and Post Production Defects and took corrective measures to avoid them in future releases.\nCommunicated the issues with the developers for every build prepared the Test results and consolidated reports to assure the functionality.\nDocumented the existing system and verified it with follow-up meetings.\nExtensively used Application Life Cycle Management (ALM) for test Scripts, bug tracking and reporting..\nPerformed Database testing using SQL queries in SQL Server.\n\nEnvironment: HP QC, Manual Testing, JIRA, Confluence and SOAP UI.\n",
    "extracted_skills": [
        "agile",
        "confluence",
        "jira",
        "project management",
        "scrum",
        "sql"
    ]
}