{
    "id": "resume_1cfe1d41-b096-49a3-9604-17d8e7fd5d57",
    "metadata": {
        "filename": "Vamshi L.docx",
        "processed_date": "2025-09-24T08:45:57.819788+00:00"
    },
    "raw_text": "\n\nVamshi \n\n\nSUMMARY\n\n8+ years of experience in developing and designing Web Based Internet/Intranet, Client- Server and Multi-tier distributed applications using latest J2EE technologies and various open source frameworks.\nExperienced in all stages of SDLC (Software Development Life Cycle) including proposal, process engineering, requirement analysis, design, development, testing, deployment and support.\nExpertise in Front-End Development using MVC frameworks such as SpringMVC,Struts, JSF, JQUERY.\nExtensive experience in Java, J2EE technologies such as JDBC, JSP, JSF, Servlets, EJB, Hibernate, Spring, XML, XSD, XSL and JNDI, Web services, Struts, Tiles, Hibernate, JMS, AJAX.\nExpertise in Client Side Designing and Validations using Angular js, Node.js,HTML, DHTML, CSS, Java Script, JSP, Struts Tag Library, JSTL.\nProficient in Object Oriented Analysis and Design (OOAD) based on Unified Modeling Language (UML) architecture. \nDeveloped different Web components such as JSPs, Servlets, Filters, Custom Tag Handlers and Business components such as RMI, EJB, JMS, and Web Services.\nFamiliar with all aspects of technology projects including BusinessRequirements, TechnicalArchitecture, DesignSpecification, Development and Deployment.\nExperienced in databases such as Oracle, DB2 and MS SQL Server to manage tables, views, indexes, sequences, stored procedures, functions, triggers and packages.\nFamiliar and Worked on various Operating Systems like UNIX (Sun Solaris, AIX), Linux,Windows NT, Windows XP, Windows 2K.\nProficient in with GUI plug-ins like Tiles Framework, Custom Tag Libraries, validation plug-ins like Validator Framework.\nResponsible in migration from Hibernate to Open JPA.\nDeveloped dynamic web applications and web services using RAD, Eclipse, JBuilder, JDeveloper,Netbeans and Web Logic workshop.\nImplemented various Ajax Frameworks such as JQuery, DOJO, JSON. Designed and developed various integration components using JMS and MQ Series.\nExtensively worked on XML technologies like XML, XSL, XSD, XSLT, Xquery, Xpath and DTD.\nExpertise in developing Web Services for data transfer from client to server and vice versa using Apache Axis, REST, SOAP, WSDL, and UDDI.\nWritten and developed scripts for automating tasks using Ant 1.5, and UNIX shell programming\nExposure to Application Servers like BEA WebLogic, IBM WebSphere, Apache Tomcat and JBoss.\nHands on experience with source control tools like CVS, Clear Case, SVN, Git and Perforce.\nWorked on Spring-DAO based declarative transaction management. \nWorked extensively with importing metadata into Hive using Scala and migrated existing tables and applications.\nDefined AWS Security Groups which acted as virtual firewalls that controlled the traffic allowed to reach one or more AWS EC2 instances. \nExperienced in frameworks like Jakarta struts framework, JSF, spring, Spring Boot, Spring Batch, Spring Security, Hibernate.\nDeveloped functions and store procedures using SQL and PL/SQL for the application. \nWrote database queries using SQL and PL/SQL for accessing, manipulating and updating Oracle database. \nExpertise in Cutting Edge Technologies like EJB, JMS, JTA, XML and Web Sphere MQ Series with good experience in Developing and Deploying Enterprise Java Beans on Application Servers like WebLogic, WebSphere and JBoss.\nExtensively worked on debugging using Logging Frameworks such as Apache Log4j.\nPerformed Unit testing, Integration Testing and generating of test cases for web applications using JUnit, Log4J, and Cactus.\nHands-on experience with Integrated Development Environment (IDE) IDEs like IBM Eclipse, JBOSS, WSAD, TOAD, Edit Plus.\nExcellent Technical, Analytical, Problem Solving skills, strict attention to detail and ability to work independently, work within a team environment.\n\nTechnical Skills\n\n\nProfessional Experience: \nClient: Staples \nDuration:  Jan 2016 to till date\nRole: Sr. JAVA Full Stack  Developer\n\nDescription: Staples mainly focuses on developing a Retail application for the Staples Incorporation for selling\nproducts such as printer, scanners, floppy, office accessories, sheets etc. The motive of Staplesis to provide quick service to the consumer who needs quick purchase of office accessories both in lesser and bulk quantities.\nGeneration of internal feeds like Coupons, Rebates and Campaigns are additional challenges. It requires technical expertise as well as domain knowledge.\n\nResponsibilities: \nDefined and constructed layers, server-side objects and client-side interfaces based on J2EE design patterns, Developed and implemented Swing, spring and J2EE based MVC (Model-View-Controller) framework for the application. \nDesigned Prototype and project layout skeletons using ReactJS, JQuery and CSS/LESS and HTML5. \nExperienced in developing web-based applications using Java, XML, CSS, HTML, DHTML and JavaScript. \nImplemented the associated business modules integration using spring, and Hibernate data mapping.\nUsed spring dependency injection, annotations and Spring MVC components to implement business layer and navigation part of application\nRESTful web services using Jersey for JAX-RS implementation. \nWorked on Rest Web services as well as Node Rest framework for backend services, used Mongo DB (NoSQL) for database services.\nWorked on SOA Web Services using SOAP with JAX-WS for transmission of large blocks of XML data over HTTP. \nInvolved in designing and building microservices. \nUsed various jQuery and Bootstrap plug-in like date picker, Bootstrap selectors. \nExposed and consumed SOAP based Web Services to communicate between systems. \nGUI design and development using Java Swing, JFC Used for open source web testing.\nUsed ActiveMQ to improve the stability and scaled the system for more concurrent users.\nDeveloped web application and Implemented user interface using Ruby, CSS, HTML5, JavaScript, JQuery. \nWrote SQL queries, stored procedures and enhanced performance by running explain plans.\nConfigured and verified AWS workstations as per application requirement\nUsed GWT and Amazon AWS (EC2/S3/EBS) for prototyping and subsequent evaluation.\nDeveloped UI for internal data aggregation tool using GWT, SmartGWT, Tomcat, RCP&REST services.\nDeveloped Microservices using spring boot, spring security and deployed to jwt cloud. \nConfigured Swagger-UI registered Micro service with Eureka server to monitor service health check from Spring Boot admin console.\nUsed Micro service architecture, with Spring Boot based services interacting through a combination of REST and Apache Kafka message brokers.\nDeveloped quality code adhering to Scala coding Standards and best practices.\nUsed Java Messaging Services (JMS) for reliable and asynchronous exchange of important information such as payment status report.\nExperience in Single Page Application (SPA) using AngularJS, created Multiple & Nested Views, Routing, Controllers, Services and Custom Directives, Node.js, Bower, Grunt \nDeveloped new features for a REST SOA backend in Clojure and led evolution of an entire backend architecture.\nWorked on Rest Web services as well as Node Rest framework for backend services, used Mongo DB (NoSQL) for database services.\n Developed the Web application using Spring MVC, Ext-JS, Html and JavaScript.  \nCreated and configured new JIRA projects and worked with departments to maintain existing JIRA projects. \nUsed log4j for logging and SVN for version control.\nBrief experience on implementing the AngularJS in creating animations based on CSS classes for a new requirement surfaced for the client.\nCreating a responsive web application integrating Twitter Bootstrap with Angular JS and media queries.\nDeveloped Maven scripts and developed builds using Maven and continuous integration servers like Jenkins.\nUsedMaven goals for testing and packaging the various components and releasing on Apache Archiva for easy accessibility and maintenance within the organization\nConsumed Web Services for getting the credit card information from third party application.\nUse of data structures and algorithms for time and memory complexity reduction\nUsed JMeter to test performance of SOAP protocol. \nUsed Junit and TestNG testing Framework as a test runner with Selenium. \nUsed to test performance both on static and dynamic resources using JMeter. \n\nEnvironment:Java, J2EE, JDK 1.7/1.8, RCP, AWS SDK, Ext JS, Git, GWT, Swing, JFC, Spring 4.x, AWS SNS/SQS, hibernate4.x, Core Java,Scala, SOAP/Rest, Web Services, Python 2.7, JavaScript, clojure, UML, HTML5, CSS, SASS, RAD 7, WAS 8 WSDL, SDK’s, JIRA 5.x/6.x, JAXB, Linux, JAX-WS, JAX RPC, JMS, JSF, UNIX, Selenium NOSQL(MongoDB), Angular JS, ReactJS, AJAX, Apache JMeter, JQuery, JUnit, Maven, EMR, Oracle 10g.\n\nClient: Apple, SunnyVale, CA\nDuration:  May 2014 to Dec 2015 \nRole: Sr. JAVA Full Stack Developer\n\nDescription: Agent Toolbox is the new tool that the ASCS (Apple Store Customer Support) agents use now for all support calls - intuitive and user friendly. All the 1-800-MY-APPLE calls will be routed to the Agent Toolbox and the calls are taken care by the APPLE Employees. This is a single web page application and works on the Safari browser only as of now. Based on Service Oriented Architecture. This project was implemented to drive down AHT (average call handling time) and reduce agent-training time.\n\nResponsibilities:\n\nDeveloped the J2EE application based on the Service Oriented Architecture.\nUsed Design Patterns like Singleton, Factory, Session Facade and DAO.\nDeveloped using new features of Java 1.7 Annotations, Generics, enhanced for loop and Enums. \nDeveloped screens using HTML5, CSS, JavaScript, JQuery and AJAX.\nCreation of prototypes using Inkspace and Quickview 3.0\nDeveloping and editing user Interface Screens using JSP, HTML5.0, JavaScript and node.js.\nImprove presentation of webpages CSS 3.0, Adobe Flash and JQuery plug - ins. \nDesigned SOA integration using Apache CXF.  Enabled rapid service tier development.\nUsed AngularJS for DOM Manipulation, Filters, and Directives.\nWeb application backend REST API utilizing AngularJSandOracle.\nUsed Twitter Bootstrap to create responsive web pages which can be displayed properly in different screen sizes.\nWorked on Cross-browser Compatibility of UI pages. Implemented for internet browsers such as Chrome, Firefox, and IE 8/9/10/11.\nDebugged the application using Chrome Inspector, Firebug, IE Tester and many other debugging tools.\nCreated and injected Spring services, Spring controllers and DAOs to achieve dependency injection and to wire objects of business classes.\nUsed Spring Inheritance to develop beans from already developed parent beans.\nImplemented SOA to develop REST Based Web services using Apache Axis. \nDeveloped Service layer Using Spring, AspectJ and persistence layer using Hibernate.\nDesigned spring boot mechanism without configuration XML's and replaced it with Java classes.\nInvolved in implementing DAO layers using JPA standards and Hibernate API interfaces.\nBuilt spring based Java and Scala micro services to support enterprise web application.\nCreated SQL queries, PL/SQL Stored Procedures, Functions for the Database layer by studying the required business objects and validating them with Stored Procedures using DB2 and JPA with Hibernate provider.\nExtensively used Hibernate mappings, HQL, EHCache, Query, Criteria, Lazy loadingTransactions and Lockings.\nDeveloped RESTWeb Services clients to consume those Web Services as well other enterprise wide Web Services.\nExposed the Web Services to the client applications by sharing the WSDL’s.\nUsed DAO pattern to fetch data from database using Hibernate to carry out various database.\nUsed Hibernate Transaction Management, Hibernate Batch Transactions, cache concepts.\nModified the Spring Controllers and Services classes so as to support the introduction of Spring framework. \nCreated logical and physical data models putting to practice, concepts of normalization and RDBMS.\nUsed XStreamAPI to transfer data back and forth between Spring MVC and Ext JS.\nJenkins to automate the build and deploy process. \nDeveloped and consumed Apache CXF based Web Services as part of Payments Application.\nFocused on Test Driven Development; thereby creating detailed JUnit tests for every single piece of functionality before actually writing the functionality.\nUsed Rational Application Developer (RAD) which is based on Eclipse, to develop and debug application code.\nUsed Log4j utility to generate run-time logs.\nSVN was used for project management and version management.\nDeployed the application on Websphere 7.0 application server.\n\nEnvironment: J2EE, Spring framework, Spring MVC, Hibernate 3.x, Angular JS, jQuery, JSON, JSF, Servlets 2.3, JDBC, AJAX, Web services, SOAP, XML, Java Beans, XStream, NetTool, Apache CXF 2.6, Apache POI, Ext JS, JQuery, JavaScript, Oracle 10g, IBM RAD, Websphere7.0, Agile Methodology, Design Patterns, SVN, Apache Maven, JUnit, HtmlUnit, XSLT, HTML/DHTML.\n\nClient: BCBS, Richardson, TX\nDuration: Nov 2012 – Apr 2014\nProject: Small Group Renewal\nRole:Sr. Java Full Stack Developer\n\nDescription: Small Group Renewal(SGR) is the automated solution for streamlining the health insurance sales process. BA Renewals delivers information and tools created to assist with reselling or reacquiring existing accounts, presenting additional plan offerings and alternatives, and monitoring anniversary effective dates to reduce the forfeiture of any business opportunities. Workflow, Single Rating Engine (SRE), and other relevant common services are used to enable Renewing process automation.\n\nResponsibilities:\n\nInvolved in complete development of ‘Agile Development Methodology/SCRUM’, developed and tested the application during various iterations.\nInvolved in various phases of Software Development Life Cycle (SDLC) such as requirements gathering, modeling, analysis, design, development, testing, and monitoring.\nSpring JMS was used to connect to ActiveMQ for the purpose of interconnecting various internal systems.\nJava Messaging Service(JMS) - IBM MQ Series provides independent and potentially non-concurrent applications on a distributed system to communicate with each other, Used to achieve SOA.\nInvolved in fitting the Data power SOA web sphere appliance in the web services for the ease of error handling and load balancing.\nTested Web Services using SOAP UI and involved in composing test suites for operations.\nUsed Collection Framework and Multithreading for performing cache Operation.\nDeveloped, and debugged the EJB with WebSphere Application server.\nDeveloped the middle tier using EJBs, Java Servlets.\nDeveloped session, entity beans and message driven beans.\nDesigned and developed web pages using with HTML5, DHTML, XHTML, CSS3, Ajax, JSP and JQuery based on the W3C standards and Web 2.0.\nAchieved role control functionality mainly by retrieving JSON data from AJAX and combining the retrieved data with jQuery to manipulate nodes in DOM tree.\nUtilized a combination of regular expression and jQuery Validation Plugin to conduct input check.\nWhile in the newer sub project, conducted validation in AngularJS way.\nWrote Oracle PL/SQL Stored procedures, triggers\nInvolved in Use Case Diagrams, Class Diagrams and Sequence diagrams using Rational Rose.\nMQ was used to provide a single unifying transport that reduces cost and maintenance efforts, including support for HTTP, REST and JMS.\nCreated test cases to validate Regular Expressions.\nDeveloped reports in an excel format using POI-HSSF API.\nUsed XML/XSLT for transforming common XML format and SAML for Single Sign-On.\nDesigned configuration XML Schema for the application.\nUsed Regular Expressions to Serializable for pattern classes. \nDeveloped Maven scripts and developed builds using Maven and continuous integration servers like Jenkins.\nUsed XMLHttp Request Object to provide asynchronous communication as part of AJAX implementation.\nExperience with KORN based scripts as part of triggering UNIX and J2EE based Jobs.\nExtensively used various Spring Framework modules like DI(IOC), Bean Wiring, Inheritance, Auto Wiring, JDBC Templates, AOP and Spring Quartz Schedulers for Jobs.\nUsed SOAP for Web Services by exchanging XML data between applications over HTTP.\nWSDL was used for publishing Web Service interfaces.\nJunit tests were written to test each module in the application. \nWrote Ant Scripts to automate the build and deploy process.\nPrepared the test plans and executed test cases for unit, integration and system testing using different automation tools like jUnit, Soap UI and Fiddler.\nPerformance Testing experience using Jmeter.\n\nEnvironment:  Core Java/J2EE, Servlets, JSP, Java Spring, JSTL, EJB, JMS, XML, XSLT, JDBC, AJAX, IBM WebSphere Application Server 7.0, Oracle 10g, WSAD, IBM MQ, HTML, CSS, JavaScript, Eclipse, UML, Rational Rose, Windows XP, CVS, JUnit, ANT, Adobe Flex, Visio.\n\nClient: JPMorgan Chase, NYC, NY \nDuration: Feb 2011 – Oct 2012             \nProject: Prime Brokerage & Financing Technology - PB CSR Dashboard\nPosition: Sr. Java Developer\n\nDescription:  CSR Dashboard is an internal facing application, accessed via the Prime View portal,which is currently designed to serve the CSR who need to provide a proactive and superior client service with Option Assignment events, with Corporate Actions and Money Transfer events to follow. This tool provides a CSR centric view of all key events for all families supported by a CSR, Team Lead or Area Manager.  As of today Option Exercise and Corporate Actions have been on boarded. \n\n Responsibilities:\n\nWorked on Agile Scrum development lifecycle with 2-week sprints, fast-paced deadlines to implement new features and get it deployed to prod every 2 months. \nUsed Spring Framework for dependency injection, integration of Hibernate using Spring ORM support, development of RESTful web services to give JSON output. \nUsed Spring MVC front controller pattern to handle requests starting with dispatcher servlet to handle incoming requests.\nConfigured Spring MVC from scratch using XML configurations, namespace handling, spring security set upand giving access to resources.\nUsed the concepts of Internationalization and Localization using Spring.\nInvolved in writing code to transform XML documents using JAXB Marshalling and Unmarshalling using Spring Injections.\nUsed Hibernate in persistence layer, written hibernate mappings using Annotations, HQL, Criteria and Named Queries.\nInvolved in Design and Development of RESTful API.\nREST web services are created using spring with Jackson Mappers to exchange data using JSON data structure.\nUsed SVN for source Version Control, resolving code conflicts and merging code base.\nDeployed the application in Web Logic Application Server.\nStrong experience in writing PL/SQL queries and performance tuning.\nDevelopedUnixShell scripts to automate repetitive database processes. \nUsed Maven for dependency management, build applications and deploy to the containers, application servers and create versions in the repository.\nInvolved in SDLC and moving project from one stage to another such as testing, UAT and production. \nDesigned and developed the UI using Node.js, Angular JS, JQuery, Ext JS, Backbone JS, HTML 5, CSS 3, bootstrap and JSP.\n\nEnvironment:Core Java, Java 1.6, Spring, Hibernate, SVN, Apache, Eclipse 3.3, JSP, JNDI, Log4j, JUnit, XML, XSD, Angular JS, Node.js, JQuery, HTML 5, bootstrap, JavaScript, Web Logic Application Server, Apache Tomcat 6.0, Oracle, Windows XP, REST API, NetBeans, UNIX.\n\nClient: American Family Insurance Madison, WI                                                              \nDuration: Nov 2009 –Jan 2011 \nRole:  Sr. Java/J2EE Developer\n\nDescription: Sales Tool Project is an Online Auto Insurance Sales tool used to estimate the quote, calculate the     premium as per state rules and sell the quote to customers. Customers can access this tool from www.amfam.com and buy insurance online, Sales Tool Rewrite project is an enhancement and Integration project with the following major business requirements.Implement a new Online Auto Insurance Sales process flow for quoting to reduce the number of questions/responses necessary to provide a quote premium.\n\nResponsibilities:\nAnalysis and understanding of business requirements.\nInvolved in the architecture team for design and implementation of system.\nDeveloped application using Spring MVC, JSP, JSTL and AJAX on the presentation layer, the business layer is built using spring and the persistent layer uses Hibernate.\nDeveloped Custom Tags to represent data in a desired unique table format and to implement paging Logic.\nUsed JavaScript for client-side validations, and AJAX to create interactive front-end GUI\nCreated the web application using MVC Struts framework.\nDesigned developed and maintained the data layer using Hibernate and performed configuration of Struts, Application Framework.\nDeveloped views and controllers for client and controllers for client and manager modules using Spring MVC and Spring Core.\nDeveloped user interfaces using JSP, HTML, CSS, JavaScript, JQuery and Ajax with JSON.\nBusiness logic is implemented using Spring Core and Hibernate.\nData Operations are performed using Spring ORM wiring with Hibernate and Implemented HibernateTemplate and criteria API for Queryingdatabase.\nDeveloped Exception handling framework and used log4J for logging.\nDeveloped WebServices using XML messages that use SOAP. Created WSDL and the SOAP envelope.\nDeveloped and modified database objects as per the requirements.\nInvolved in Unit integration, bug fixing, acceptance testing with test cases, Code reviews.\n\n          Environment: Java, J2EE, JSP, Spring, Hibernate, JMS, XML, Web Services, SOAP, AJAX, HTML, JavaScript, CSS, Log4J, JUnit, Maven, WebSphere, Application Server, Eclipse, Oracle.\n\nClient: ValueLabs, Hyderabad, Andhra Pradesh\nDuration: May 2008-Oct 2009\nRole: Java/J2EE Developer\n\nDescription:  BSHM builds a system, which helps both Doctor and patient in an efficient manner by providing information about the availability of Doctors, maintaining patient records according to their visit and generating reports of patients of their medications, Lab Findings, Problems List and serves the pharmacy maintenance also. The information may be very critical from both doctor's and patient's point of view, BSHM maintains a safe and secure database system for patients. BSHM stores patient's records efficiently and make them easily retrievable. The whole system modules are Appointments, patient chart, Reports, pharmacy, Administration.\n\nResponsibilities:\n\nInvolved in Analysis and Design of the Project, which is based on MVC (Model-View-Controller) Architecture and Design Patterns.\nInvolved in developing prototypes of the product.\nCreatedUML Use Cases, Sequence diagrams, Class diagrams and Page flow diagrams using Rational Rose.\nDesigned GUI Components using Tiles frame work and Validation frame work.\nDesigned and developed UI using HTML, JSP and Struts where users have all the items listed for auctions.\nDeveloped ANT scripts for builds and deployments.\nDeveloped Controller Servlets, Action and Form objects for process of interacting with Oracle database and retrieving dynamic data.\nResponsible for coding SQL Statements and Stored procedures for back end communication using JDBC.\nParsing of XML documents was done using SAX and DOM and XML transformation was done using XSLT.\nWrote JavaScript validations on the client side.\nInvolved in writing Detail Design Documents with UML Specifications.\nInvolved in unit testing and system testing and also responsible for preparing test scripts for the system testing.\nResponsible for packaging and deploying components in to the Tomcat.\nUsed java IO to create reports, which were mailed to be mailed to manager every hour.\nResponsible for performance tuning of the product and eliminating memory leakages in the product.\nParticipated in Code Review meetings with developers. \n\nEnvironment: CoreJava, Java Beans, JSP, Jbuilder, Javascript, Servlets, JDBC, LOG4J, XML, XSLT, HTML, Struts, Tiles, SAX,DOM, Tomcat, UNIX, Oracle.\n",
    "extracted_skills": [
        "agile",
        "angular",
        "aws",
        "communication",
        "css",
        "ec2",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "jira",
        "mongodb",
        "node.js",
        "oracle",
        "problem solving",
        "project management",
        "python",
        "rest api",
        "ruby",
        "s3",
        "scala",
        "scrum",
        "sql"
    ]
}