{
    "id": "resume_be3f0449-2f8c-4a28-ae90-e5b61e4ac7de",
    "metadata": {
        "filename": "Venkata_Sr.PHP_Developer.docx",
        "processed_date": "2025-09-24T08:45:58.662509+00:00"
    },
    "raw_text": "Venkata\nSr. PHP / Drupal Developer\n       Email: venkata.s.k310@gmail.com                                                       Cell: (316) 247-2160\nSummary\nAround 9+ years of experience in PHP, LAMP, WAMP, Drupal, WordPress, Zend, CodeIgniter, Cake PHP Frameworks.\nExperienced in developing web-based applications using PHP 5.x, MySQL, XML, CSS, HTML, DHTML, XHTML, JavaScript, jQuery and AJAX Technology. \nExperience in building frameworks in Python for Test Automation. \nSolid experience in Relational Database Management System (RDBMS) design, programming, normalization and security administration. \nExcellent knowledge in Twitter Bootstrap and Responsive Design\nExperience on working with CSS Backgrounds, CSS Layouts, CSS Positioning, CSS Animations, CSS Text, CSS Borders, CSS Margin, CSS Padding, and CSS Table. \nEffective skills of working with Eclipse IDE and MVC.\nExperienced in developing websites using HTML 4.0/5.0, CSS, CSS3, JavaScript, JQuery, Ajax and JSON. \nDesigned the web layouts using Adobe Photoshop. \nExperienced in developing application using 3-tier architecture (i.e. Presentation Layer, Business layer and Data access Layer). \nExtensive experience with multiple technologies like Python 2.7, 3.2, 3.4, PHP, Shell Scripting, Java, C, Perl, and VBA. \nExperienced in developing event driven applications using AJAX, JSON and XML. \nIncorporated the table less design methodology using CSS3 that follows W3C standards. \nAdvanced knowledge of HTML5, CSS3, XML, DHTML, JavaScript including JQuery, prototype libraries, Webkit\nExpertise in web applications that required cross browser compatibilities like Chrome, Safari, Firefox, Internet Explorer and Opera. \nExtensively used the backbone.js, Angular js, reactjs frame works, JSON and JavaScript frameworks jQuery.\nExcellent experience in implementing various design patterns including MVC\nExperienced on Installation, Integration and Configuration of third party tools, Content Management System (CODEIGNITER, Smarty).\nDeveloped custom Drupal Theme to effectively address business requirements. \nExpertise in all PHP-related projects technical aspects like design, development, project documentation and product maintenance.  \nExcellent experience over Drupal 4/ 5/ 6/ 7/ 8.\nExperienced in Drupal tool like View Tools, UberSearch, Drupal Theme Viewer to create powerful and flexible web applications. \nExperienced in third party payment gateway (PGP) with PHPscripting. \nExpertise in deploying applications using Apache HTTP server, Tomcat server and Jboss server. \nTechnical Skills:\n\n\nResponsibilities\n\nDesigned, Developed Custom Drupal Modules for implementing Oauth and REST API. \nWorked on HTML, HTML5, JavaScript, CSS and their integration within a PHP environment.\nCoding in LAMP (Linux, Apache, MySQL, and PHP) environment. \nPerformed web development, template development, testing, debugging, integration, documentation and deployment\nBuild interactive web application using JQuery, Javascript, DOM manipulation, JSON, AJAX, \nBootstrap 2 and 3, responsive design.\nMaintained and supported existing applications built on the Drupal platform ensuring site availability\nEngaged in incident management, problem solving and solution implementation\nDesigned and developed new web applications, forms, content management workflows leveraging Drupal\nInvolved in Installing, theming, customizing Drupal systems, including Drupal 7 and Drupal 8\nCreated Drupal modules and the extended modules as needed.\nWorked on HTML5/CSS and jQuery in a Drupal based CMS environment\nWorked on analysis, design, development and implementation of web applications using PHP, Zend Framework, Oracle and MySQL\nWorked on an open-source CMS Drupal to build website using Drupal\nHeavily used HTML5 and CSS3 and applied CSS frameworks such as Bootstrap\nImplemented AJAX and JQuery on Front-End to make the web page more dynamic.\nDynamic content management at client side using AJAX, JavaScript, DHTML.\nExperience working with APIs, integrating with external web services including REST, XML or JSON\nCustomized dashboard development for accessing easy user interface using front end tools such as Ajax, Jquery, Javascript etc. \nUsed PHP framework such as Cake, Zend and Zend 2\nDeveloped various sections using AngularJS, ReactJS, HTML, CSS, Velocity, Ajax, Json and Spring web service.\nIntegration with multiples API using REST and SOAP. \nWorked in an SVN/GIT managed environment. \nWorked on Stack Zend PHP, Apache Web Server, SVN, Oracle, JavaScript, jQuery\nInvolved in integration testing, functional testing and UI testing\nEnvironment: Drupal 8/7/6, REST API, Oauth, PHP 4/5, HTML 4/5, XHTML, CSS, AJAX, JavaScript, MySQL, Perl, Python, Windows, Apache, MVC Frame Work, jQuery, CSS. \nResponsibilities\n\nInvolved in back-end development with PHP (4/5), MySQL, XML and light database design. \nDesigned and developed multiuser, 3-tier MVC web-application (Apache, PHP5, Oracle11g, jQuery, jQuery UI, Javascript /JSON) for describing whole infrastructure.\nWorked with LAMP stack and open source software\nUsed javascripct frameworks like NODE.JS,ANGULAR.JS\nResponsible for website maintenance client websites on a daily basis involving HTML, CSS, Drupal\nInvolved in release into Production, Development, QA, and Staging.\nOptimized sites for usability, search engines and accessibility, and updated existing sites and content management systems.\nMade and implemented a huge variety of websites and web apps using PHP, JavaScript, HTML5, CSS3, MySQL\nKnowledge of modern web technologies and techniques (Node.JS, SASS, LESS, Responsive Design, etc.)\nExperience with version control systems like Git, SVN, etc. Experience working with CI/CD tools like Jenkins, Travis, etc. \nWorked on coding optimized SQL queries, PL/SQL Stored Procedures, Functions, Packages and Triggers on databases like MySQL, MS SQL and Oracle\nUse of PHP and Zend framework.\nUsed HTML, CSS, javascript, jquery on client side.\nImplemented Jquery code to create various design sliders on Home pages of websites.\nInvolved in the development using Drupal and PHP\nUsed Jquery for creating different menus and dialog boxes and also used different jquery plugins for calendar, calculator and printing options.\nWorked on Stack Zend PHP, Apache Web Server, SVN, Oracle, JavaScript, jQuery\nCreated and implemented a wide variety of websites and web applications using PHP, JavaScript, HTML5, CSS3, MySQL\nDeveloped single paged web based apps using “backbone.js”.\nBuild AJAX pages using PHP to display current server time\nEnvironment: Drupal, JQuery, Zend 2, PHP, CSS,Python, MySQL, Google map api V3, Html, CSS, JavaScript \n\nResponsibilities\n\nInvolved in database design, application design and site architecture design to meet requirements\nResponsible for the development of web applications and scripts utilizing JavaScript, HTML, PHPand MySQL \nWorked on Linux and UNIX platforms. Also worked with XML, XSD, and RESTful APIs \nDeveloped user interface using PHP5, Ajax, JQuery, HTML, CSS, javascript, LAMP\nBuilt custom modules and libraries in Drupal\nBuilt secure, scalable backend solutions and wrote database queries and logic.\nWorked with Drupal modules, theming, distributions & content management\nInvolved with both maintaining / updating & developing new client websites\nInvolved with Quality assurance of own work, code testing, cross browser testing, etc.\nInvolved in Website Code Optimization.\nIntegrating REST web services PHP based API's into the site. \nResponsible for creating efficient design and developing User Interaction screens using HTML5, CSS3, JavaScript, jQuery, AJAX and JSON. \nDeveloped various sections using AngularJS, HTML, CSS, Velocity, Ajax, Json and Spring web service\nClient side validations, structuring and reconstitution of sub templates and templates was performed using JavaScript. \nWorked on HTML, CSS, PHP, ASP, MySQL, MSSQL, Java script / jQuery, Action Script 2/3\nWorked on Git Hub\nWrote concise, clean, modular CSS, HTML, Drupal and PHP codes\nWorked on Drupal to create custom widgets\nInteract with the front end web development (HTML, CSS, JavaScript)\nDevelop site themes with LESS or SASS and traditional CSS\nMaintaining SQL server database and updating PHP script. \nUsing three kind of database Granite Database, Oracle, MYSql.\n\nEnvironment: PHP, HTML, JavaScript, MYSQL, SVN, Drupal, Dreamweaver MX 2004, PHPMYADMIN, Visual Source Safe, MS Excel, jQuery Zend Framework, JSON, XML, Python \nResponsibilities\n\nWorked on HTML, CSS, and of digital imaging and illustration with Adobe Photoshop, InDesign, and Illustrator\nWorked on JavaScript, ASP.NET, and PHP and with Macromedia Flash.\nWorked on theme layer for Drupal\nWorked with the Foundation framework and with AJAX based sites/web applications.\nDeveloped Jquery plugin for accordions and customized them meeting the business requirements. \nCreated Images, Logos and Icons that are used across the web pages using Adobe Flash and Photoshop. \nDeveloped a user friendly secondary back end to update and maintain multiple Magento e-commerce installs using PHP, CSS, HTML, MYSQL and MSSQL. \nUsed HTML, CSS, javascript, jquery on client side. \nCreated Images, Logos and Icons that are used across the web pages using Adobe Flash and Photoshop. \nUsed advanced level of HTML5, JavaScript, CSS3 and pure CSS layouts (table less layout). \nInvolved with front-end integration projects using various frameworks and HTML5, SAAS, CSS3, JavaScript, DOM, and Ajax technologies and methodologies. \nBack end development and maintenance of websites using PHP and MySQL. \nEfficiently developed code for different modules by using Oracle SQL, PLSQL and Shell scripting \nUsed advanced level of HTML5, JavaScript, CSS3 and pure CSS layouts (table less layout). \nInvolved with front-end integration projects using various frameworks and HTML5, SAAS, CSS3, JavaScript, DOM, and Ajax technologies and methodologies. \nEnvironment: Magento, PHP, MySQL, LAMP, Zend, Javascript, AJAX, Jquery, CSS3, XHTML, HTML5, Cake  JQuery, Code ignitor,  Html 5, XML, XSD, SAAS, PL/SQL, Photoshop, UNIX .\n",
    "extracted_skills": [
        "angular",
        "asp.net",
        "ci/cd",
        "css",
        "git",
        "html",
        "java",
        "javascript",
        "jenkins",
        "mysql",
        "node.js",
        "oracle",
        "php",
        "problem solving",
        "python",
        "rest api",
        "sql"
    ]
}