{
    "id": "resume_89ff4b0c-a088-49f5-9906-854a6a47e2de",
    "metadata": {
        "filename": "Vishnu BA Resume.docx",
        "processed_date": "2025-09-24T08:45:59.880991+00:00"
    },
    "raw_text": "                                                                      Vishnu Vardhan\n\nSUMMARY OF SKILLS\nSeasoned Business Analyst with around 10 years of experience in Banking, Healthcare, Oil and Gas domains.\nExcellent problem solving, communication and analytical skills for understanding the business requirements, business rules/processes and detailed design of the application.\nExpertise in conducting feasibility studies, requirements gathering, analyzing the business process, documentation and conducting review sessions.\nDesign, documentation and review of business documents like Business Requirement Document (BRD), Functional Requirement Document (FRD) and System Requirement Specifications (SRS).\nKnowledge of Data warehousing concepts and Extract, Transform and Load (ETL) processes.\nExtensively used SQL Scripts/Queries for Data Verification and Validation.\nCompetent in creating Unified Modeling Language (UML) Diagrams for Business Process Modeling like Use Case Diagrams (UCD), Activity Diagrams (AD), Sequence Diagrams (SD), and Data Flow Diagrams (DFD).\nFacilitated Change Management across entire process from project initialization to testing through project delivery, software development & implementation, management in diverse business & technical environments in accordance to the Agile Methodology.\nAbility to utilize logical, rational judgment with a talent for understanding and evaluating many aspects of a problem and focusing on key issues.\nProficiency in entire Software Development Lifecycle (SDLC), SCRUM Framework using Agile Methodology and Iterative Software Development Life Cycle Process.\nWorked with the project team to determine appropriate Test/Deployment Plans, and supported the product launch.\nCoordinated with Analysts, Managers, Developers and Testers for complex projects during the SDLC.\n\n\nWORK EXPERIENCE\n\nSr. Business Analyst\nHuntington Bank, Troy, MI                                                                                       September 2015 – Present\nThe project involved conversion of Warren Bank data to Huntington Bank using CIS application and DB2 database. The conversion had to be using Huntington rules and information has to be converted without any loss of data.\n\nEstablished a RUP (Rational Unified Process) centric business analysis methodology.\nCollaborated in building a business analysis process model using Rational Rose, RequisitePro, and MS Visio.\nProvided key initiatives in working with users in defining project and system requirements. \nProvided inputs in the strategic development of detailed project plans, work assignments, target dates, etc.\nDesigned and developed Use Cases, Activity Diagrams, Sequence Diagrams and OOD using UML.\nIdentified, researched, investigated, analyzed, defined and documented business processes and Use Case scenarios.\nPerformed all necessary programming, testing and documentation for COBOL, DB2 batch programs and sub-routines.\nResponsible for 24x7 coverage for various mainframe based Cobol applications using DB2, VSAM and IMS databases.\nPerformed all necessary programming, testing and documentation for COBOL, DB2 batch programs and sub-routines.\nGathered data from the legacy system (db2) to the present updated system using data warehouse tools such as Informatica.\nResponsible for creating Business Process Modeling and Work Flow Diagrams.\nPerformed extensive Requirement Analysis including Data Analysis and GAP Analysis.\nFunctioned as a primary liaison between the business line, operations, and the technical areas throughout the project cycle.\nConducted JAD sessions to resolve critical issues.\nInvolved in designing the web forms using HTML, Java Script, DHTML, CSS, AJAX and ASP.Net \nActively involved in developing classes, Objects for business logic by using C#.Net 4.0 programming\nFacilitate weekly JAD sessions and interviews with SMEs, senior management and IT teams to track and document Credit Risk, Market Risk and Operational Risk related issues and tasks.\nPlayed a key role in the planning, testingand implementation of system enhancements and conversions.\nUsed Object-oriented analysis (OOA) for object-modeling techniques to analyze the functional requirements for a system. \nDesigned and developed the view-controller components using Servlets/JSPs, JavaScript, CSS, JQuery, AJAX, HTML and DHTML.\nAssisted in presenting reports and analysis to help guide the management.\nOrganized cross training of team members and users to become more responsive.\nAssisted in development of training materials for new technology and process improvements.\n\nEnvironment: Windows, MS Word, MS Excel, MS PowerPoint, MS SharePoint, MS Visio, .NET, Oracle, Crystal Reports, IBM Mainframes, Servlets, JSP, CSS, RUP, UML,C#,HTML,JavaScript,SQL, Win Runner.\n\n\nSr. Business Analyst\nFederal Reserve Bank, San Francisco, CA                                                  December 2013 – August 2015\nThe project involved replacing the core operational cash system, known as \"Standard Cash Application\" (SCA) with a new solution that was based on the latest technology and tools. The SCA replacement system have replaced both legacy WebSCA and legacy SCA Systems. The goal of the project was to position NCA and SFIT to develop a project cost assessment model with a reasonable level of accuracy and an effective plan for the design, development, built and implementation activities for the SCA replacement system.\n\nParticipated in implementation of version 1 tool to migrate project backlog for all 6 development teams from manual backlog to Version 1.\nInvolved in Data Mapping fields accepted by version 1 during import process.\nManaged product backlog with Product Owner, and coordinated grooming & planning of User Stories.\nActed as a liaison between the Development Team and Business Team.\nConsistently answered QA and Development questions regarding requirements during the Sprint.\nInvolved in QA check and verified that Test Cases were traced with requirements as per the functionality of the system.\nCaptured, documented and prioritized requirements for business process improvement.\nInvolved in preparing Metrics, Burn-Up Chart information for completed Sprint in backlog.\nTracked User Stories in backlog, which helped to measure accurate velocity of the Burn-Up Chart.\nImplemented the business logic using C#.Net and handled the data transactions using ADO.NET \nCreated various database tables and triggers and complex queries in SQL Server 2008 \nInvolved in development and maintenance of Use Cases.\nHelped create test scenarios for the purpose of testing during sprint development to assist the QA Involved in design, development micro services with Restful and SOAP web services using Spring REST. \n Using Java Persistence API (JPA) for accessing, persisting, and managing data between Java \nobjects / classes and a relational database eam.\n\nWrote User Stories; updated Use Cases; prepared Agile Metrics, Documentation, Impact Assessments, System Maintenance & Process Improvement Opportunities, and collaborated with team members to develop solutions that achieve accuracy and transparency within systems development.\nCompleted a technical evaluation of development tools to determine which tools were viable for new replacement system and to inform the development estimate.\nScheduled and documented meetings with key project resources and/or stakeholders in an effort to ensure project milestones were met and open issues were resolved in a timely and efficient manner.\n\nEnvironment: Mainframes, Oracle, SQL, Rose, MS Word, ADO.NET, SQL Server 2008, MS PowerPoint, MS Excel, MS Visio, Spring REST, SOAP Mercury Quality Centre, JIRA.\n\n\nSAP Business Systems Analyst\nAmerican International Group ,Berkeley Heights, NJ          May 2013 to February 2017\n• Consulted for AIG P&C (Property and Casualty) for SAP Reinsurance Management (FS-RI, FS-CD, FI-GL) module while serving on the Reinsurance Project Team at the company's Global SAP Solution Center. \n• Managed all SAP performance improvements/tuning for SAP Reinsurance Team. Led a team of on-shore and off-shore technical and functional resources to ensure all performance related concerns were addressed. \n• Liaised with business users to conduct requirements gathering sessions in order to transform the business requirement into a functional specification requirement for developing necessary solutions. \n• Oversaw and assisted in multiple full life cycle product implementations for enhancements to Policy Administration and Claims Management modules. \n• Managed design, build, tests, go-live and cut over (post deployment) application changes to the global production system. Suggest performance improvements and provide appropriate system solutions by identifying and validating customer requirements documents. \n• Responsible for managing deployment rate for defects, minor enhancements and major enhancements and ensure that the development and testing is completed in the required time-frame to achieve yearly targets. \n• Plan, prepare, and execute FUT (Functional Unit Testing) and UAT (User Acceptance Testing) of enhancements and fixes made to various systems. \n• Led process re-engineering to increase efficiency and integration among upstream and downstream systems; reduced delivery time of financial data to business users and senior management by 60%. \n• Experienced in ETL from spreadsheets and database tables, and data mapping. Practical understanding of data modeling concepts. \n• Led in-house training courses for new hires and interns on the fundamentals of reinsurance, claims and policy management, SAP FS-RI module, as well as assist in the preparation of training materials.\n\nEnvironment: SAP, UAT,FUT, RUP, MS SharePoint, MS Word, MS Excel, MS PowerPoint, MS Visio, REST, MS Project, \n\n\n\nBusiness Analyst\nKey Bank, Cleveland, OH                                                                October 2010 – January 2012\nKey Bank is a regional bank in the United States. This project involved reengineering of the Credit Card System, plugging all the gaps of the old system and creating better usability, scalability and portability. It involved extensive research and development of standardized systems to deal with account acquisition, retention; credit limits management, and bad debts.\n\nAssisted the PM in setting realistic project expectations and evaluating the impact of changes on the organization and planned accordingly and conducted project related presentations.\nPrepared Requirement Traceability Matrices (RTM) and managed every change requests effectively throughout the Software Development Life Cycle.\nFollowed RUP (Rational Unified Process) centric business analysis methodology.\nDeveloped strategic partnerships with the business unit to develop a solid knowledge base of the business line including the business plan, products, process and revenue streams.\nInitiated JAD sessions with end users through one-on-one and group interviews to better understand the user requirements.\nFacilitated and managed meeting sessions with committee of SMEs from various business areas including Mortgage Servicing, Loan Monitoring, and Asset Management.\nCollaborated with development architect to develop both high-level and detailed application architecture to meet the business needs.\nInvolved in developed the application using Core Java, J2EE and JSP's. \nWorked to develop this Web based application entitled EMR in J2EE framework which uses Hibernate for persistence, spring for Dependency Injection and JUnit for testing. \nProvided key initiatives in working with users in defining project and system requirements.\nProvided inputs in the strategic development of detailed project plans, work assignments, target dates, etc.\nDesigned and developed a LINQ to SQL and Web Service driven Web Form application that served as a more user-friendly and powerful user interface for an existing application.\nInvolved into migration of .NET 1.1 modules into .NET 4.0 frameworks.\nDocumented and delivered Business Requirement Documents and Functional Requirement/Specification Documents to the project team.\nParticipated in the logical and physical design sessions, developing design documents.\nWorked with Data Extraction, Transformation, and Loading.\nCreated SQL queries using Joins to join tables and updated the database tables using commands such as update, insert and delete.\nWorked with consultants and business partners to analyze response and risk models to improve operational efficiencies.\n\nEnvironment: .NET, Windows 2000/XP, Rational Requisite Pro 7.0, UML, Rational Rose, Rational Clear Quest 8.0, MS Word 2007, ASP.NET MVC 4, Core Java, J2EE and JSP's,MS Project 2007, MS PowerPoint 2007, MS SQL Server 2005, , spring, HP Quality Centre, QTP.\n\n\nBusiness Analyst\nPrime Healthcare Services, Ontario, CA                                 November 2009 – September 2010\nPrime Healthcare Services is a holding company that owns and operates 43 hospitals in the United States. The project was to develop an application for the hospitals to use as a central repository for storing reports from different departments of the hospital. Major modules included Enrolment/Registration, Billing and Reports. This System was being developed using HIPAA guidelines and regulations which keeps track of Healthcare transactions like Eligibility Request/Response, Request and Response for Claims Status, Prior Authorization, and Claim/Encounter.\n\nCreated and analyzed performance reports and used the data to implement changes and updates that improve service and performance.\nRequired to meet aggressive ad hoc deadlines and work on special projects. (Projects included major software upgrades for the service center and institution of an email channel for customer service.)\nAnalyzed and documented Fact Sheets, Business Requirement Document (BRD), Functional Specification Documentation, and System Requirement Documentation.\nConducted meetings to understand the workflow, their processes and assisted in GAP Analysis to derive requirements for existing systems enhancements.\nWorked closely with Team Managers and monitored phone calls and productivity of Representatives and HR analysts to ensure the effectiveness of service.\nWorked with a team of Operations Managers, Supervisors, and other HR Analysts to update standards and establish goals.\nWorked closely with the HR Service Center managers to ensure the effectiveness and quality of the service our personnel deliver.\n Converted raw images and layouts from a graphic designer into CSS/HTML themes.\nCoded Tested and debugged Java code and Servlets using Eclipse\nDesigned and executed test plans, tracked defects and got them resolved to ensure that business requirements and functional specifications were tested and fulfilled.\nDeveloped POC using Silver light 4, XAML, Expression Blend, and C # \nDeveloped Data Access Components using LINQ using .NET4 C#, VS2010 \nDesign of ASP.NET Applications using MVC \nSupported the Training and Business Process Management departments as a Subject Matter Expert.\nResponsible for organizing customer feedback for the HR Director and other management positions on monthly basis.\n\nEnvironment: MS Office Suite, MS Project, RUP, UML.NET4 C#, VS2010, MS Visio, Eclipse, SharePoint, CSS/HTML.\n\n\n\n\n\n\nJr.Business Analyst\n\nReliance Petrolium , Ahamadhabad ,India                              July 2007- October 2009\n\n• Translated business goals, feature concepts and customer needs into prioritized product requirements and use cases. \n • Designed conceptual data model based on the requirement, interacted with stakeholders & non-technical users to understand the business logics. \n • Involved in model reviews with project team members through regular on-site visits, virtual meetings and customer advisory board sessions. \n • Created Tableau Dashboards with interactive views, trends and drill downs for senior management. \n • Created the reports using Business Objects functionalities like Queries, Slice and Dice, Drill down, Cross Tab, Master/Detail and Formulas. \n • Developed data connections from multiple data sources to Tableau Desktop for report and dashboard development. \n • Generated high detail oriented views using multiple measures, Individual Axes, Dual Axes and Custom Geo-coding in Tableau.\n\nEducation\n\nBachelor of Technology \nNational Institute of Technology, Tiruchirapalli, TamilNadu.\n\n\n\n\n",
    "extracted_skills": [
        "agile",
        "asp.net",
        "communication",
        "css",
        "data analysis",
        "go",
        "html",
        "java",
        "javascript",
        "jira",
        "oracle",
        "problem solving",
        "scrum",
        "sql",
        "tableau"
    ]
}