{
    "id": "resume_9dbd17ef-d48d-40ab-932a-c12e4fa9d3c3",
    "metadata": {
        "filename": "Vivek Joshi_CV.docx",
        "processed_date": "2025-09-24T08:46:00.548641+00:00"
    },
    "raw_text": "\nVivek Joshi\nBusiness Analyst\nBellevue, WA\n\nBusiness/Systems Analyst professional with 12 years of experience with excellent communication and analytical skills, Solution Development, requirements gathering in managing projects using Agile methodologies.\n\nAbility to coordinate and lead cross-functional teams towards task completion.\nAbility to translate high-level business wants and needs into technical requirements including workflow diagrams.\nParticipate in system design sessions and provide input to architecture\nExperience designing and authoring agile user stories based on functional analysis of epic stories and assisting developers in implementation of features.\nKnowledge of software development cycle, testing, and agile release train methodologies.\nWorking with scrum master for sprint/Iteration planning activities.\nDocument design specifications and other system-related information.\nProvide technical guidance or support for the development or troubleshooting of systems.\nDevelop, document and revise system design procedures and review test procedures, and quality standards.\nProvide advice on project costs, design concepts, or design changes.\nEffective leadership, analytical, technical writing, and verbal communication skills.\nExperience in project management managing multiple teams concurrently.\n\nTechnical Skills:\nAgile (Rally, TDP, JIRA),Waterfall, SDLC, QA\nMS Excel, Visio, MS PowerPoint, Microsoft SharePoint\nRequisite Pro, Rational Quality Manager, HP QC\nWorking knowledge of using SQL queries\nDesign of Micro services.\nCreating Swagger files (JSON) for APIs\nKnowledge of APIGEE proxy APIs implementation\n\nWork Experience\nSystem Analyst –I Net Soft Inc(Sept 2017 to till date)\n\nProject Description\nClient:T-Mobile Bellevue Washington ((Sep 2017 to till date)\n\nCommunication product: Provide a new product to the T-Mobile for Business marketplace to support interactive unified communications and collaboration via app-based real-time voice and text, conference calling, and fax including support of a cloud PBX without the traditional barriers of the GSM network. \n\nContribution \nAs a system analyst of digital technology and development team, is responsible for:\nCommunicate with client to understand the business / system specific requirements.\nFacilitating meetings for the team. This includes, preparing, moderation &post processing\nInteracting with Product owner\nUnderstanding the requirements and creating user stories\nInteracting with team and have them understand the functionality\nWrite user stories, acceptance criteria\nParticipate in grooming sessions and actively think for all requirements and capture those\nCreating Swagger files (JSON) for APIs and communicate to development team\nValidating API end points in POSTMAN tool.\nAble to work and coordinate with other teams’ scrum master to discuss any conflicts from product integration perspective\nHelping with the release planning.\nBeing familiar with the team’s work\nKeeping in touch with every stakeholder regularly\nHelping the team to continuously improve their process.\nReflecting issues to the team through observation from outside of the team\n\nBusiness Analyst/Consultant - Tech Mahindra (Feb 2011 to Sept 2017)\n\nProject Description  \nClient: AT&T\nAT&T Collaborate: Middletown New Jersey ((May 2015 to Sept 2017)\nAT&T Collaborate™ offers a flexible hosted voice solution that gives you the traditional voice features you need and the collaboration tools you want, regardless of your work location.\n\nContribution \nAs a system engineer of Ordering team, is responsible for  \nPerform System Engineer(T2) activities for Trinity/Hosted Communications (AT&T Collaborate) for ordering system. \nProvide e2e knowledge and expertise, support T3 SEs in researching, tracking and writing requirement and user stories for GUI, database, and backend processing as well as Application Interface Documents.\nSupport defect management process by providing support for e2e data flow and provide support for Developers and System Testers in defect calls and chats.\nWork with product team and user experience team to drive the best user experience and flow. \nProvide impact assessments and estimates. \nPartner with extended team members from e2e teams to ensure successful deployment.\nRequirement Analysis \nWriting User Stories since the project is on Agile \nReview Application Design documents and test cases to ensure developers and system testers have clear understanding of expectations  \nDesigning of Architecture  \nReviews on other Impacted applications and interfaces \nSystem/Application Testing Support \nDeployment & Support activities \n\n\nProject Description\nClient: AT&T Noida, India ((Feb 2014 to Apr 2015)\nGCP DPPCO: Supporting AT&T’s Target Architecture systems (Sales Express and SSDF) & FMO applications ADOPT (Design, Price, Propose, Contract, and Order) applications to support Sales teams in the FMO and PMO ordering flows.\n\nContribution \nAs a system engineer of Sales team, is responsible for  \nOwning inventory management API\nWork with product team and user experience team to drive the best user experience and requirements analysis for Inventory API\nWriting User Stories for any code/test impact on the API   \nDesigning and creation of Application Interface Document (AID) and High Level Document (HLD)  \nReviews on other Impacted applications and interfaces \nSupport defect management process by providing support for data flow and provide support for developers and system testers in defect calls and chats.\n\n\nProject Description\nClient: AT&T, Mumbai, India ((Dec 2012 to Feb 2014)\nAT&T Business Manager: ABM is the front end ordering system which provides the BellSouth Large and Small Business groups a straightforward, functional interface to support the creation and modification of regional service orders.  This system provides a graphical user interface with backup data retrieval and flexible window presentation.  It provides Service Order negotiation and generation functionality for Small Business and Large Business customers in the South East region.\n\nContribution\nPart of front end team, was responsible for:\nAttending the business requirement meetings.\nCreating High Level Document and Impact analysis\nCommunicate with client to understand the business / system specific requirements.\nCoordinates with Client, Product Owner, Designers, Architects, and Technical Leads through regular grooming sessions to define user stories and API requirements for each technical project including acceptance criteria and traceability\nPerforms impact and dependency analysis with Tech Leads and engineering stakeholders \nReviews on other Impacted applications and interfaces\nParticipation in daily scrum meeting.\nProviding requirement and its traceability with business requirement (Waterfall Project))  \nSystem/Application Testing Support\nDeployment & Support activities\n\n\nProject Manager -Netwing Technologies – Mumbai India \nMay 2009 to Dec 2010\nContribution\nOverall Project management by understanding the client’s requirements, delivering the quality results and reports, meeting the client deadlines in the required cost estimated.\nAnalysis of the requirements provided by client\nPreparation of Business Requirement Document\nDeveloping project plan\nHelping the team in all technical aspects\nPreparation of RFP documents\nVendor Management\n\nSenior Engineer - Independent Mobile Infrastructure Ltd, Jaipur India \nDec 2007 to Feb 2009\n\nContribution\nThis essential position at the state level is a key determinant of where IMIL erects its Mobile towers and reports to the Head of Circle Operations, with functional reporting to the GM - Operations Planning at HQ. Administrative reporting is to the Circle Head.\n\nAs a senior engineer, was responsible for \nTechnical data analysis\nProject plan tracking with inputs from all stakeholders.\nUpdating existing & planned database\nTeam management\n\nRF Engineer – Nutek India Ltd, (Feb 2006 to Dec 20007)\nClient: Ericsson, Gurugram India\nContribution\nGSM RF Performance maintenance, stats monitoring with trouble shooting and optimization on GSM-1800 and Frequency planning of new sites.\n\nAs a team member, was responsible for \nDrive Test including voice and data for GSM\nOptimize system performance based on field test data and reports\nUpdating existing & planned database\nPerform frequency/carrier planning, traffic and capacity analysis\n\n\nEducation\nBachelor of Engineering – 2005 batch\n\n\n",
    "extracted_skills": [
        "agile",
        "collaboration",
        "communication",
        "data analysis",
        "gcp",
        "jira",
        "leadership",
        "project management",
        "scrum",
        "sql"
    ]
}